[
  {
    "topic": "artificial-intelligence",
    "title": "AI toys are all the rage in China—and now they’re appearing on shelves in the US too",
    "link": "https://www.technologyreview.com/2025/10/07/1125191/ai-toys-in-china/",
    "summary": "Kids have always played with and talked to stuffed animals. But now their toys can talk back, thanks to a wave of companies that are fitting children’s playthings with chatbots and voice assistants.&#160; It’s a trend that has particularly taken off in China: A recent report by the Shenzhen Toy Industry Association and JD.com predicts&#8230;",
    "published": "Tue, 07 Oct 2025 16:51:02 +0000",
    "guid": "https://www.technologyreview.com/?p=1125191",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "The three big unanswered questions about Sora",
    "link": "https://www.technologyreview.com/2025/10/07/1124998/the-three-big-unanswered-questions-about-sora/",
    "summary": "Last week OpenAI released Sora, a TikTok-style app that presents an endless feed of exclusively AI-generated videos, each up to 10 seconds long. The app allows you to create a “cameo” of yourself—a hyperrealistic avatar that mimics your appearance and voice—and insert other peoples’ cameos into your own videos (depending on what permissions they set).&#160;&#8230;",
    "published": "Tue, 07 Oct 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124998",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "Enabling real-time responsiveness with event-driven architecture",
    "link": "https://www.technologyreview.com/2025/10/06/1124323/enabling-real-time-responsiveness-with-event-driven-architecture/",
    "summary": "",
    "published": "Mon, 06 Oct 2025 08:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124323",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "Unlocking AI’s full potential requires operational excellence",
    "link": "https://www.technologyreview.com/2025/10/01/1124593/unlocking-ais-full-potential-requires-operational-excellence/",
    "summary": "Talk of AI is inescapable. It’s often the main topic of discussion at board and executive meetings, at corporate retreats, and in the media. A record 58% of S&#38;P 500 companies mentioned AI in their second-quarter earnings calls, according to Goldman Sachs. But it’s difficult to walk the talk. Just 5% of generative AI pilots&#8230;",
    "published": "Wed, 01 Oct 2025 14:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124593",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "OpenAI is huge in India. Its models are steeped in caste bias.",
    "link": "https://www.technologyreview.com/2025/10/01/1124621/openai-india-caste-bias/",
    "summary": "When Dhiraj Singha began applying for postdoctoral sociology fellowships in Bengaluru, India, in March, he wanted to make sure the English in his application was pitch-perfect. So he turned to ChatGPT. He was surprised to see that in addition to smoothing out his language, it changed his identity—swapping out his surname for “Sharma,” which is&#8230;",
    "published": "Wed, 01 Oct 2025 10:28:23 +0000",
    "guid": "https://www.technologyreview.com/?p=1124621",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "The US may be heading toward a drone-filled future",
    "link": "https://www.technologyreview.com/2025/09/30/1124470/the-us-may-be-heading-toward-a-drone-filled-future/",
    "summary": "On Thursday, I published a story about the police-tech giant Flock Safety selling its drones to the private sector to track shoplifters. Keith Kauffman, a former police chief who now leads Flock’s drone efforts, described the ideal scenario: A security team at a Home Depot, say, launches a drone from the roof that follows shoplifting&#8230;",
    "published": "Tue, 30 Sep 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124470",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "US investigators are using AI to detect child abuse images made by AI",
    "link": "https://www.technologyreview.com/2025/09/26/1124343/us-investigators-are-using-ai-to-detect-child-abuse-images-made-by-ai/",
    "summary": "Generative AI has enabled the production of child sexual abuse images to skyrocket. Now the leading investigator of child exploitation in the US is experimenting with using AI to distinguish AI-generated images from material depicting real victims, according to a new government filing. The Department of Homeland Security’s Cyber Crimes Center, which investigates child exploitation&#8230;",
    "published": "Fri, 26 Sep 2025 19:03:34 +0000",
    "guid": "https://www.technologyreview.com/?p=1124343",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "Shoplifters could soon be chased down by drones",
    "link": "https://www.technologyreview.com/2025/09/25/1124088/shoplifters-could-soon-be-chased-down-by-drones/",
    "summary": "Flock Safety, whose drones were once reserved for police departments, is now offering them for private-sector security, the company announced today, with potential customers including businesses intent on curbing shoplifting.  Companies in the US can now place Flock’s drone docking stations on their premises. If the company has a waiver from the Federal Aviation Administration&#8230;",
    "published": "Thu, 25 Sep 2025 17:34:26 +0000",
    "guid": "https://www.technologyreview.com/?p=1124088",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "How AI and Wikipedia have sent vulnerable languages into a doom spiral",
    "link": "https://www.technologyreview.com/2025/09/25/1124005/ai-wikipedia-vulnerable-languages-doom-spiral/",
    "summary": "When Kenneth Wehr started managing the Greenlandic-language version of Wikipedia four years ago, his first act was to delete almost everything. It had to go, he thought, if it had any chance of surviving. Wehr, who’s 26, isn’t from Greenland—he grew up in Germany—but he had become obsessed with the island, an autonomous Danish territory,&#8230;",
    "published": "Thu, 25 Sep 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124005",
    "fetched_at": "2025-10-08T06:33:04"
  },
  {
    "topic": "artificial-intelligence",
    "title": "The AI Hype Index: Cracking the chatbot code",
    "link": "https://www.technologyreview.com/2025/09/24/1123999/the-ai-hype-index-cracking-the-chatbot-code/",
    "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. Millions of us use chatbots every day, even though we don’t really know how they work or how using them affects us. In&#8230;",
    "published": "Wed, 24 Sep 2025 09:40:19 +0000",
    "guid": "https://www.technologyreview.com/?p=1123999",
    "fetched_at": "2025-10-08T06:33:04"
  }
]