[
  {
    "topic": "biotechnology",
    "title": "Microsoft says AI can create “zero day” threats in biology",
    "link": "https://www.technologyreview.com/2025/10/02/1124767/microsoft-says-ai-can-create-zero-day-threats-in-biology/",
    "summary": "A team at Microsoft says it used artificial intelligence to discover a &#8220;zero day&#8221; vulnerability in the biosecurity systems used to prevent the misuse of DNA. These screening systems are designed to stop people from purchasing genetic sequences that could be used to create deadly toxins or pathogens. But now researchers led by Microsoft’s chief&#8230;",
    "published": "Thu, 02 Oct 2025 18:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124767",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "Trump is pushing leucovorin as a treatment for autism. What is it?",
    "link": "https://www.technologyreview.com/2025/09/24/1124029/trump-leucovorin-autism-tylenol/",
    "summary": "MIT Technology Review Explains: Let our writers untangle the complex, messy world of technology to help you understand what’s coming next. You can read more from the series here. At a press conference on Monday, President Trump announced that his administration was taking action to address “the meteoric rise in autism.” He suggested that childhood&#8230;",
    "published": "Wed, 24 Sep 2025 11:56:32 +0000",
    "guid": "https://www.technologyreview.com/?p=1124029",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "A pivotal meeting on vaccine guidance is underway—and former CDC leaders are alarmed",
    "link": "https://www.technologyreview.com/2025/09/18/1123844/meeting-vaccine-guidance-former-cdc-leaders-alarmed/",
    "summary": "Update Friday 6am ET: The advisory CDC panel recommended that children under the age of 4 do not receive the combined MMRV vaccine (for measles, mumps, rubella, and varicella) but instead receive two separate shots. This week has been an eventful one for America’s public health agency. Two former leaders of the US Centers for&#8230;",
    "published": "Thu, 18 Sep 2025 16:21:31 +0000",
    "guid": "https://www.technologyreview.com/?p=1123844",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "AI-designed viruses are here and already killing bacteria",
    "link": "https://www.technologyreview.com/2025/09/17/1123801/ai-virus-bacteriophage-life/",
    "summary": "Artificial intelligence can draw cat pictures and write emails. Now the same technology can compose a working genome. A research team in California says it used AI to propose new genetic codes for viruses—and managed to get several of these viruses to replicate and kill bacteria. The scientists, based at Stanford University and the nonprofit&#8230;",
    "published": "Wed, 17 Sep 2025 15:14:29 +0000",
    "guid": "https://www.technologyreview.com/?p=1123801",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "We can’t “make American children healthy again” without tackling the gun crisis",
    "link": "https://www.technologyreview.com/2025/09/11/1123553/maha-report-gun-violence-checkup/",
    "summary": "Note for readers: This newsletter discusses gun violence, a raw and tragic issue in America. It was already in progress on Wednesday when a school shooting occurred at Evergreen High School in Colorado and Charlie Kirk was shot and killed at Utah Valley University.&#160; Earlier this week, the Trump administration’s Make America Healthy Again movement&#8230;",
    "published": "Thu, 11 Sep 2025 16:57:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1123553",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "2025 Innovator of the Year: Sneha Goenka for developing an ultra-fast sequencing technology",
    "link": "https://www.technologyreview.com/2025/09/08/1121509/innovator-of-the-year-sneha-goenka/",
    "summary": "Sneha Goenka is one of MIT Technology Review’s 2025 Innovators Under 35.&#160;Meet the rest of this year’s honorees.&#160; Up to a quarter of children entering intensive care have undiagnosed genetic conditions. To be treated properly, they must first get diagnoses—which means having their genomes sequenced. This process typically takes up to seven weeks. Sadly, that’s&#8230;",
    "published": "Mon, 08 Sep 2025 10:30:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1121509",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "Putin says organ transplants could grant immortality. Not quite.",
    "link": "https://www.technologyreview.com/2025/09/05/1123113/putin-organ-transplants-immortality-longevity-replacement/",
    "summary": "This week I’m writing from Manchester, where I’ve been attending&#160;a conference on aging. Wednesday was full of talks and presentations by scientists who are trying to understand the nitty-gritty of aging—all the way down to the molecular level. Once we can understand the complex biology of aging, we should be able to slow or prevent&#8230;",
    "published": "Fri, 05 Sep 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1123113",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "RFK Jr’s plan to improve America’s diet is missing the point",
    "link": "https://www.technologyreview.com/2025/08/29/1122733/rfk-jrs-plan-to-improve-americas-diet-is-missing-the-point/",
    "summary": "A lot of Americans don’t eat well. And they’re paying for it with their health. A diet high in sugar, sodium, and saturated fat can increase the risk of problems like diabetes, heart disease, and kidney disease, to name a few. And those are among the leading causes of death in the US. This is hardly&#8230;",
    "published": "Fri, 29 Aug 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1122733",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "I gave the police access to my DNA—and maybe some of yours",
    "link": "https://www.technologyreview.com/2025/08/22/1122315/i-gave-police-access-to-my-dna/",
    "summary": "Last year, I added my DNA profile to a private genealogical database, FamilyTreeDNA, and clicked “Yes” to allow the police to search my genes. In 2018, police in California announced they’d&#160;caught the Golden State Killer, a man who had eluded capture for decades. They did it by uploading crime-scene DNA to websites like the one&#8230;",
    "published": "Fri, 22 Aug 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1122315",
    "fetched_at": "2025-10-08T06:33:05"
  },
  {
    "topic": "biotechnology",
    "title": "Why US federal health agencies are abandoning mRNA vaccines",
    "link": "https://www.technologyreview.com/2025/08/15/1121885/why-us-federal-health-agencies-are-abandoning-mrna-vaccines/",
    "summary": "This time five years ago, we were in the throes of the covid-19 pandemic. By August 2020, we’d seen school closures, national lockdowns, and widespread panic. That year, the coronavirus was responsible for around 3 million deaths, according to the World Health Organization. Then came the vaccines. The first mRNA vaccines for covid were authorized for&#8230;",
    "published": "Fri, 15 Aug 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1121885",
    "fetched_at": "2025-10-08T06:33:05"
  }
]