[
  {
    "topic": "main",
    "title": "The US is set to cancel funding for two major direct-air-capture plants",
    "link": "https://www.technologyreview.com/2025/10/07/1125207/the-us-is-set-to-cancel-funding-for-two-major-direct-air-capture-plants/",
    "summary": "The US Department of Energy appears poised to terminate funding for a pair of large carbon-sucking factories that were originally set to receive more than $1 billion in government grants, according to a department-issued list of projects obtained by MIT Technology Review and circulating among federal agencies. One of the projects is the South Texas&#8230;",
    "published": "Tue, 07 Oct 2025 18:29:20 +0000",
    "guid": "https://www.technologyreview.com/?p=1125207",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "AI toys are all the rage in China—and now they’re appearing on shelves in the US too",
    "link": "https://www.technologyreview.com/2025/10/07/1125191/ai-toys-in-china/",
    "summary": "Kids have always played with and talked to stuffed animals. But now their toys can talk back, thanks to a wave of companies that are fitting children’s playthings with chatbots and voice assistants.&#160; It’s a trend that has particularly taken off in China: A recent report by the Shenzhen Toy Industry Association and JD.com predicts&#8230;",
    "published": "Tue, 07 Oct 2025 16:51:02 +0000",
    "guid": "https://www.technologyreview.com/?p=1125191",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "The Download: extracting lithium, and what we still don’t know about Sora",
    "link": "https://www.technologyreview.com/2025/10/07/1125075/the-download-extracting-lithium-and-what-we-still-dont-know-about-sora/",
    "summary": "This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. This company is planning a lithium empire from the shores of the Great Salt Lake On a bright afternoon in August, the shore of Utah’s Great Salt Lake looks like something out of&#8230;",
    "published": "Tue, 07 Oct 2025 12:10:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1125075",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "The three big unanswered questions about Sora",
    "link": "https://www.technologyreview.com/2025/10/07/1124998/the-three-big-unanswered-questions-about-sora/",
    "summary": "Last week OpenAI released Sora, a TikTok-style app that presents an endless feed of exclusively AI-generated videos, each up to 10 seconds long. The app allows you to create a “cameo” of yourself—a hyperrealistic avatar that mimics your appearance and voice—and insert other peoples’ cameos into your own videos (depending on what permissions they set).&#160;&#8230;",
    "published": "Tue, 07 Oct 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124998",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "This company is planning a lithium empire from the shores of the Great Salt Lake",
    "link": "https://www.technologyreview.com/2025/10/07/1125060/this-company-is-planning-a-lithium-empire-from-the-shores-of-the-great-salt-lake/",
    "summary": "BOX ELDER COUNTY, Utah – On a bright afternoon in August, the shore on the North Arm of the Great Salt Lake looks like something out of a science fiction film set in a scorching alien world. The desert sun is blinding as it reflects off the white salt that gathers and crunches underfoot like&#8230;",
    "published": "Tue, 07 Oct 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1125060",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "The Download: introducing the 10 climate tech companies to watch for 2025",
    "link": "https://www.technologyreview.com/2025/10/06/1124939/the-download-introducing-the-10-climate-tech-companies-to-watch-for-2025/",
    "summary": "This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. Introducing: 10 climate tech companies to watch Every year, the MIT Technology Review newsroom produces a list of some of the most promising climate tech firms on the planet. It’s an exercise that&#8230;",
    "published": "Mon, 06 Oct 2025 12:10:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124939",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "2025 Climate Tech Companies to Watch",
    "link": "https://www.technologyreview.com/2025/10/06/1124257/2025-climate-tech-companies-to-watch/",
    "summary": "",
    "published": "Mon, 06 Oct 2025 10:45:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124257",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "Bill Gates: Our best weapon against climate change is ingenuity",
    "link": "https://www.technologyreview.com/2025/10/06/1124265/bill-gates-ingenuity-climate-change-tech-investment/",
    "summary": "It’s a foregone conclusion that the world will not meet the goals for limiting emissions and global warming laid out in the 2015 Paris Agreement. Many people want to blame politicians and corporations for this failure, but there’s an even more fundamental reason: We don’t have all the technological tools we need to do it,&#8230;",
    "published": "Mon, 06 Oct 2025 10:45:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124265",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "2025 Climate Tech Companies to Watch: HiNa Battery Technology and its effort to commercialize salt cells",
    "link": "https://www.technologyreview.com/2025/10/06/1124270/2025-climate-tech-companies-to-watch-hina-battery-salt-cells/",
    "summary": "HiNa Battery Technology is a trailblazer in developing and mass-producing batteries using sodium, a widely available element that can be extracted from sea salt. The startup’s products—already powering small vehicles and energy storage plants in China—provide a valuable alternative to lithium-based batteries, made with materials mined and processed in just a few countries. Over the&#8230;",
    "published": "Mon, 06 Oct 2025 10:45:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124270",
    "fetched_at": "2025-10-08T06:33:03"
  },
  {
    "topic": "main",
    "title": "How we picked promising climate tech companies in an especially unsettling year",
    "link": "https://www.technologyreview.com/2025/10/06/1124275/2025-climate-tech-companies-to-watch-methodology/",
    "summary": "MIT Technology Review’s reporters and editors faced a dilemma as we began to mull nominees for this year’s list of Climate Tech Companies to Watch. How do you pick companies poised to succeed in a moment of such deep uncertainty, at a time when the new Trump administration is downplaying the dangers of climate change,&#8230;",
    "published": "Mon, 06 Oct 2025 10:45:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1124275",
    "fetched_at": "2025-10-08T06:33:03"
  }
]