[
  {
    "topic": "policy",
    "title": "Another effort to track ICE raids was just taken offline",
    "link": "https://www.technologyreview.com/2025/10/06/1124912/effort-track-ice-raids-offline/",
    "summary": "People over Papers, a crowdsourcing project that maps sightings of US immigration agents, was taken offline yesterday by Padlet, the collaborative bulletin board platform on which it was built. It’s just the latest ICE-tracking initiative to be pulled by tech platforms in the past few days.  A Padlet customer service representative told Celeste, one of&#8230;",
    "published": "Mon, 06 Oct 2025 10:02:10 +0000",
    "guid": "https://www.technologyreview.com/?p=1124912",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "How to measure the returns on R&D spending",
    "link": "https://www.technologyreview.com/2025/09/17/1123760/how-to-measure-the-returns-to-rd-spending/",
    "summary": "MIT Technology Review Explains: Let our writers untangle the complex, messy world of technology to help you understand what’s coming next. You can read more from the series here. Given the draconian cuts to US federal funding for science, including the administration’s proposal to reduce the 2026 budgets of the National Institutes of Health by&#8230;",
    "published": "Wed, 17 Sep 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1123760",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "Taiwan’s “silicon shield” could be weakening",
    "link": "https://www.technologyreview.com/2025/08/15/1121358/taiwan-silicon-shield-tsmc-china-chip-manufacturing/",
    "summary": "One winter afternoon in a conference room in Taipei, a pair of twentysomething women dragged their friend across the floor. Lying on the ground in checkered pants and a brown sweatshirt, she was pretending to be either injured or dead. One friend picked her up by her arms, the other grabbed hold of her legs,&#8230;",
    "published": "Fri, 15 Aug 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1121358",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "Why Trump’s “golden dome” missile defense idea is another ripped straight from the movies",
    "link": "https://www.technologyreview.com/2025/08/13/1121332/trump-golden-dome-missile-defense-national-security/",
    "summary": "In 1940, a fresh-faced Ronald Reagan starred as US Secret Service agent Brass Bancroft in Murder in the Air, an action film centered on a fictional “superweapon” that could stop enemy aircraft midflight. A mock newspaper in the movie hails it as the “greatest peace argument ever invented.” The experimental weapon is “the exclusive property&#8230;",
    "published": "Wed, 13 Aug 2025 10:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1121332",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "Why the AI moratorium’s defeat may signal a new political era",
    "link": "https://www.technologyreview.com/2025/07/09/1119867/why-the-ai-moratoriums-defeat-may-signal-a-new-political-era/",
    "summary": "The “Big, Beautiful Bill” that President Donald Trump signed into law on July 4 was chock full of controversial policies—Medicaid work requirements, increased funding for ICE, and an end to tax credits for clean energy and vehicles, to name just a few. But one highly contested provision was missing. Just days earlier, during a late-night&#8230;",
    "published": "Wed, 09 Jul 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1119867",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "What does it mean for an algorithm to be “fair”?",
    "link": "https://www.technologyreview.com/2025/06/17/1118918/what-does-it-mean-for-an-algorithm-to-be-fair/",
    "summary": "Back in February, I flew to Amsterdam to report on a high-stakes experiment the city had recently conducted: a pilot program for what it called Smart Check, which was its attempt to create an effective, fair, and unbiased predictive algorithm to try to detect welfare fraud. But the city fell short of its lofty goals—and,&#8230;",
    "published": "Tue, 17 Jun 2025 08:49:25 +0000",
    "guid": "https://www.technologyreview.com/?p=1118918",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "How AI can help make cities work better for residents",
    "link": "https://www.technologyreview.com/2025/06/16/1118210/ai-city-government-residents-constituents/",
    "summary": "In recent decades, cities have become increasingly adept at amassing all sorts of data. But that data can have limited impact when government officials are unable to communicate, let alone analyze or put to use, all the information they have access to. This dynamic has always bothered Sarah Williams, a professor of urban planning and&#8230;",
    "published": "Mon, 16 Jun 2025 10:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1118210",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "Senior State Department official sought internal communications with journalists, European officials, and Trump critics",
    "link": "https://www.technologyreview.com/2025/05/01/1115988/senior-state-department-official-sought-internal-communications-with-journalists-european-officials-and-trump-critics/",
    "summary": "This story is part of MIT Technology Review’s &#8220;America Undone” series, examining how the foundations of US success in science and innovation are currently under threat. You can read the rest here. A previously unreported document distributed by senior US State Department official Darren Beattie reveals a sweeping effort to uncover all communications between the staff&#8230;",
    "published": "Thu, 01 May 2025 17:41:32 +0000",
    "guid": "https://www.technologyreview.com/?p=1115988",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "We need targeted policies, not blunt tariffs, to drive “American energy dominance”",
    "link": "https://www.technologyreview.com/2025/04/17/1115132/we-need-targeted-policies-not-blunt-tariffs-to-drive-american-energy-dominance/",
    "summary": "President Trump and his appointees have repeatedly stressed the need to establish “American energy dominance.”&#160; But the White House’s profusion of executive orders and aggressive tariffs, along with its determined effort to roll back clean-energy policies, are moving the industry in the wrong direction, creating market chaos and economic uncertainty that are making it harder&#8230;",
    "published": "Thu, 17 Apr 2025 09:00:00 +0000",
    "guid": "https://www.technologyreview.com/?p=1115132",
    "fetched_at": "2025-10-08T06:33:08"
  },
  {
    "topic": "policy",
    "title": "US office that counters foreign disinformation is being eliminated",
    "link": "https://www.technologyreview.com/2025/04/16/1115256/us-office-that-counters-foreign-disinformation-is-being-eliminated-say-officials/",
    "summary": "This story is part of MIT Technology Review’s &#8220;America Undone” series, examining how the foundations of US success in science and innovation are currently under threat. You can read the rest here. The only office within the US State Department that monitors foreign disinformation is to be eliminated, according to US Secretary of State Marco Rubio,&#8230;",
    "published": "Wed, 16 Apr 2025 14:25:26 +0000",
    "guid": "https://www.technologyreview.com/?p=1115256",
    "fetched_at": "2025-10-08T06:33:08"
  }
]