[
  {
    "title": "Quantum Sensors Sidestep the Heisenberg Uncertainty Principle",
    "link": "https://spectrum.ieee.org/sidestep-heisenberg-uncertainty",
    "summary": "A cornerstone of quantum physics is uncertainty. Heisenberg’s uncertainty principle states that the more precisely you pinpoint the position of a particle, the less precisely you can know its momentum at the same time, and vice versa. However, a new study reveals that scientists have now discovered a way to sidestep this quantum trade-off. This could lead to next-generation quantum sensors that can simultaneously measure both the position and momentum of particles with unprecedented precision. “We take it for granted that the Heisenberg uncertainty principle is a fundamental law that cannot be broken,” says Tingrei Tan , a research fellow at the University of Sydney Nano Institute and School of Physics. “I want to be clear that we have not broken the Heisenberg uncertainty principle. But in certain cases, we can get around it.” Other kinds of uncertainty are known in quantum physics as well. For example, if an atom is excited to a higher orbital, one cannot precisely know both the energy and the duration of its excited state at the same time. Previously, scientists have taken advantages of these kinds of trade-offs to “ squeeze ” or reduce the uncertainty in the measurements of a given variable while increasing the uncertainty in the measurement of another variable the researchers can ignore. For example, researchers have shown they can make qubits—the key components in quantum computers—highly resistant to a common source of error known as bit flip , when a qubit’s state flips from 1 to 0 or the reverse, while making them more vulnerable to a different common source of error known as phase flip, when a qubit switches between one of two opposite phases. They make this trade-off because having just one common source of error to correct instead of two can drastically simplify quantum-computer design. Now Tan and his colleagues have found they can make a similar swap to sidestep Heisenberg’s uncertainty principle. “We are increasing the precision with which we can measure momentum and position at the same time within a small sensing range, while increasing the uncertainty with which we can measure those properties simultaneously outside of that sensing range,” Tan says. Since the kind of quantum sensing applications the researchers want to carry out with this new technique are roughly on the atomic scale anyhow, gaining precision on a tiny scale while losing it on larger ones is a worthwhile trade-off. It’s a bit like using a magnifying glass—you care about what you want to focus on under the lens, not around it. Inspiration from quantum computing In the new study, the researchers experimented with a single ytterbium ion held in place and controlled with electric and magnetic fields. They generated sets of specific patterns of vibrations in the ion known as grid states or Gottesman-Kitaev-Preskill states. Scientists have long investigated GKP states for quantum error-correction strategies in quantum computing . In the case of trapped ions, because of the way in which the patterns of vibrations are entangled together, any small disturbance would generate changes in these patterns, which quantum error-correction techniques can detect and account for in quantum computations. In the new study, by preparing grid states in the vibrations of a ytterbium ion, the researchers found they could simultaneously measure both its position and momentum with a precision beyond the standard quantum limit—the best achievable using only classical sensors. Tingrei Tan in the Sydney Nanoscience Hub at the University of Sydney, where he manages the Quantum Control Laboratory. Fiona Wolf/The University of Sydney “We are borrowing techniques from quantum error correction to do quantum sensing,” Tan says. Tan says a key application for this research is spectroscopy — the analysis of atoms or molecules based on the specific wavelengths of light they absorb or reflect, which finds wide use in medical research, navigation in environments where GPS does not work , and searches for dark matter . In general, however, “this opens up a whole new way to do precision measurements,” Tan says. “It was taken for granted that there were pairs of variables that you could not measure precisely at the same time, and our work provides a framework for how we can get around those limitations.” The scientists detailed their findings on 24 September in the journal Science Advances .",
    "published": "Mon, 06 Oct 2025 14:00:05 +0000",
    "author": "Charles Q. Choi",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "The NEC-Approved Solution That’s Changing How Fleets Approach EV Charging",
    "link": "https://content.knowledgehub.wiley.com/electrify-faster-spend-less-why-fleet-managers-are-turning-to-automated-load-management/",
    "summary": "Maximize existing grid capacity and avoid costly upgrades. Learn how Automated Load Management enables faster, more affordable fleet electrification . Download the free technical guide. Download this free whitepaper now!",
    "published": "Thu, 02 Oct 2025 11:00:04 +0000",
    "author": "The Mobility House",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Muscle-Bound Micromirrors Could Bring Lidar to More Cars",
    "link": "https://spectrum.ieee.org/mems-lidar",
    "summary": "Five years ago, Eric Aguilar was fed up. He had worked on lidar and other sensors for years at Tesla and Google X, but the technology always seemed too expensive and, more importantly, unreliable. He replaced the lidar sensors when they broke—which was all too often, and seemingly at random—and developed complex calibration methods and maintenance routines just to keep them functioning and the cars drivable. So, when he reached the end of his rope, he invented a more robust technology—what he calls the “most powerful micromachine ever made.” Aguilar and his team at startup Omnitron Sensors developed new microelectromechanical systems (MEMS) technology that he claims can produce more force per unit area than any other. By supplying new levels of power to micromirrors , the technology is capable of precisely steering lidar’s laser beams, even while weathering hazardous elements and the bumps and bangs of the open road. With chips under test by auto-industry customers, Omnitron is now modifying the technology to reduce the power consumed by AI data centers. Lidar, a scanning and detection system that uses lasers to determine how far away objects are, is often adopted by self-driving cars to find obstacles and navigate. Even as the market for lidar is expected to grow by 13.6 percent annually , lidar use in the automotive industry has remained relatively stagnant in recent years, Aguilar says, in part because the technology’s lifespan is so short. Vibration from bumpy roads and severe environmental conditions are the biggest reliability killers for automotive lidar, says Mo Li , who studies photonic systems at the University of Washington. The optical alignment within the lidar package atop self-driving cars is delicate—tremors from a poor paving job could physically alter where the mirrors sit in the housing, potentially misaligning the beam and causing the system to fail. Or temperature fluctuations could cause parts to expand or contract with the same unfortunate outcome, he explains. Aguilar wondered which part broke most often and found the culprit to be scanners, the parts responsible for angling small mirrors that direct the laser beam out of the system’s housing. He wanted to make scanners that could withstand the tough conditions lidar faces, and silicon flexures stood out as a solution. These structures act like springs and allow for meticulous control of the mirrors within lidar systems without wearing out, as the standard metal springs do, Aguilar claims. Designing a better chip Aguilar hoped the new material would be the answer to the problem that plagued him, but even silicon springs didn’t make lidar systems as robust as they needed to be to withstand the elements they faced. To make lidar even stronger, the team at Omnitron aimed to design a more powerful MEMS chip by increasing the amount of force the device can apply to control the mirrors in the lidar array. And they claim to have achieved it—their chip can exert 10 times as much force per unit area on an actuator that positions a micromirror or other sensor component as the current industry standard, they say. That extra force allows for extremely valuable control in fine adjustment. To reach this achievement, they had to dig deep—literally. Omnitron’s micromirrors steer lidar beams and could find use in data centers. Omnitron In this MEMS device, the mirror and its actuator are etched into a single silicon wafer. On its nonmirror end, the actuator is covered with tiny, closely spaced plates that fit between trenches in the wafer, like the interlocking teeth of two combs. To move the mirror, voltage is applied, and electrostatic forces angle the mirror into a specific position by moving the plates up and down within the trenches as the electric field pulls across the trench sidewalls . The force that can be used to move the mirror is limited by the ratio of depth to width of the trenches, called aspect ratio. Put simply, the deeper the trenches are, the more electrostatic force can be applied to an actuator, which leads to a higher range of motion for the sensor. But fabricating deep, narrow trenches is a difficult endeavor. Overcoming this limiting factor was a must for Aguilar. Aguilar says Omnitron was able to improve on the roughly 20:1 aspect ratio he notes is typical for MEMS (other experts say 30:1 or 40:1 is closer to average these days), reaching up to 100:1 through experimentation and prototyping in small university foundries across the United States “That’s really our core breakthrough,” Aguilar says. “It was through blood, sweat, tears, and frustration that we started this company.” The startup has secured over US $800 million in letters of intent from automotive partners, Aguilar says, and is two months into an 18-month plan to prove that it can produce its chips at full demand rate. Even after verifying production capabilities, the technology will have to face “very tough” safety testing for thousands of consecutive hours in realistic conditions, like vibrations, thermal cycles, and rain, before it can come to market, Li says. Saving power In the meantime, Omnitron is applying its technology to solve a different problem faced by a different industry. By 2030, AI data centers are expected to require around 945 terawatt-hours to function—more than the country of Japan consumes today. The problem is “the way data moves,” Aguilar says. When data is sent from one part of the data center to another, optical signals are converted into electrical signals, rerouted, and then turned back to optical signals to be sent on their way. This process, which takes place in systems called network switches, burns huge amounts of power. Google’s solution, called Apollo , is to keep the data packets in the form of optical signals for the duration of their travels, which yields a 40 percent power savings, the company claims . Apollo does so by using an array of mirrors to direct the data. Aguilar is planning to make the process even more efficient using dense arrays of Omnitron’s more-powerful mirrors. Doing so could quadruple the amount of data each network switch could route by increasing the number of channels in each switch from 126 to 441, Aguilar says. Omnitron is still early in its data-center implementation, so it’s not yet clear to what degree this technology can really improve on Google’s Apollo. However, following a “critical design review” in mid-September, “one of the world’s top AI hyperscalers has requested our mirrors for their next-generation switch,” Aguilar says. “This is proof that Omnitron solves a problem that even the biggest AI infrastructure companies can’t address in-house.” And there may be even more applications to come. Omnitron has received feelers from the defense industry, space companies, and groups interested in methane detection, says Aguilar. “It’s pretty cool seeing the people knock on our door for this, because I was just focusing on lidar,” he says.",
    "published": "Wed, 01 Oct 2025 15:00:03 +0000",
    "author": "Perri Thaler",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "“Hearing Car” Detects Sounds for Safer Driving",
    "link": "https://spectrum.ieee.org/fraunhofer-hearing-car-microphone",
    "summary": "Autonomous vehicles have eyes—cameras, lidar, radar. But ears? That’s what researchers at Fraunhofer Institute for Digital Media Technology’s Oldenburg Branch for Hearing, Speech and Audio Technology in Germany are building with the Hearing Car . The idea is to outfit vehicles with external microphones and AI to detect, localize, and classify environmental sounds, with the goal of helping cars react to hazards they can’t see. For now, that means approaching emergency vehicles—and eventually pedestrians, a punctured tire, or failing brakes. “It’s about giving the car another sense, so it can understand the acoustic world around it,” says Moritz Brandes , a project manager for the Hearing Car. In March 2025, Fraunhofer IDMT researchers drove a prototype Hearing Car 1,500 kilometers from Oldenburg to a proving ground in northern Sweden. Brandes says the trip tested the system in dirt, snow, slush, road salt, and freezing temperatures. How to Build a Car That Listens The team had a few key questions to answer: What if the microphone housings get dirty or frosted over? How does that affect localization and classification? Testing showed performance degraded less than expected once modules were cleaned and dried. The team also confirmed the microphones can survive a car wash. Each external microphone module (EMM) contains three microphones in a 15-centimeter-wide package. Mounted at the rear of the car—where wind noise is lowest—they capture sound, digitize it, convert it into spectrograms, and pass it to a region-based convolutional neural network (RCNN) trained for audio event detection. If the RCNN classifies an audio signal as a siren, the result is cross-checked with the vehicle’s cameras: Is there a blue flashing light in view? Combining “senses” like this boosts the vehicle’s reliability by lowering the odds of false positives. Audio signals are localized through beamforming , though Fraunhofer declined to provide specifics on the technique. All processing happens onboard to minimize latency. That also “eliminates concerns about what would happen in an area with poor Internet connectivity or a lot of interference from [radio-frequency] noise,” Brandes says. The workload, he adds, can be handled by a modern Raspberry Pi . According to Brandes, early benchmarks for the Hearing Car system include detecting sirens up to 400 meters away in quiet, low-speed conditions. That figure, he says, shrinks to under 100 meters at highway speeds due to wind and road noise. Alerts are triggered in about 2 seconds—enough time for drivers or autonomous systems to react. This display doubles as a control panel and dashboard letting the driver activate the vehicle’s “hearing.” Fraunhofer IDMT The History of Listening Cars The Hearing Car’s roots stretch back more than a decade. “We’ve been working on making cars hear since 2014,” says Brandes. Early experiments were modest: detecting a nail in a tire by its rhythmic tapping on the pavement or opening the trunk via voice command. A few years later, support from a tier 1 supplier (a company that provides complete systems or major components such as transmissions, braking systems, batteries, or advanced driver assistance systems (ADASs) directly to automobile manufacturers) pushed the work into automotive-grade development, soon joined by a major automaker. With EV adoption rising, automakers began to see why ears mattered as much as eyes. “A human hears a siren and reacts—even before seeing where the sound is coming from. An autonomous vehicle has to do the same if it’s going to coexist with us safely.” —Eoin King, University of Galway Sound Lab Brandes recalls one telling moment: Sitting on a test track, inside an electric vehicle that was well insulated against road noise , he failed to hear an emergency siren until the vehicle was nearly upon him. “That was a big ‘ah-ha!’ moment that showed how important the Hearing Car would become as EV adoption increased,” he says. Eoin King , a mechanical engineering professor at the University of Galway in Ireland, sees the leap from physics to AI as transformative. “My team took a very physics-based approach,” he says, recalling his 2020 work in this research area at the University of Hartford in Connecticut. “We looked at direction of arrival—measuring delays between microphones to triangulate where a sound is. That demonstrated feasibility. But today, AI can take this much further. Machine listening is really the game changer.” Physics still matters, King adds: “It’s almost like physics-informed AI. The traditional approaches show what’s possible. Now, machine learning systems can generalize far better across environments.” The Future of Audio in Autonomous Vehicles Despite progress, King, who directs the Galway Sound Lab ’s research in acoustics, noise, and vibration, is cautious. “In five years, I see it being niche,” he says. “It takes time for technologies to become standard. Lane-departure warnings were niche once too—but now they’re everywhere. Hearing technology will get there, but step by step.” Near-term deployment will likely appear in premium vehicles or autonomous fleets, with mass adoption further off. King doesn’t mince words about why audio perception matters: Autonomous vehicles must coexist with humans. “A human hears a siren and reacts—even before seeing where the sound is coming from. An autonomous vehicle has to do the same if it’s going to coexist with us safely,” he says. King’s vision is vehicles with multisensory awareness—cameras and lidar for sight, microphones for hearing, perhaps even vibration sensors for road-surface monitoring . “Smell,” he jokes, “might be a step too far.” Fraunhofer’s Swedish road test showed that durability is not a big hurdle. King points to another area of concern: false alarms. “If you train a car to stop when it hears someone yelling ‘help,’ what happens when kids do it as a prank?” he asks. “We have to test these systems thoroughly before putting them on the road. This isn’t consumer electronics, where, if ChatGPT gives you the wrong answer , you can just rephrase the question—people’s lives are at stake.” Cost is less of an issue: microphones are cheap and rugged. The real challenge is ensuring algorithms can make sense of noisy city soundscapes filled with horns, garbage trucks, and construction. Fraunhofer is now refining algorithms with broader datasets, including sirens from the United States, Germany, and Denmark. Meanwhile, King’s lab is improving sound detection in indoor contexts, which could be repurposed for cars. Some scenarios—like a Hearing Car detecting a red-light-runner’s engine revving before it’s visible—may be many years away, but King insists the principle holds: “With the right data, in theory it’s possible. The challenge is getting that data and training for it.” Both Brandes and King agree no single sense is enough. Cameras, radar, lidar—and now microphones—must work together. “Autonomous vehicles that rely only on vision are limited to line of sight,” King says. “Adding acoustics adds another degree of safety.”",
    "published": "Tue, 30 Sep 2025 14:00:03 +0000",
    "author": "Willie D. Jones",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Electric Boats Drive New England Aquaculture",
    "link": "https://spectrum.ieee.org/electric-boats-aquaculture",
    "summary": "This article was originally published by Canary Media . At a dock along the banks of the Cousins River, Chad Strater loaded up his small aluminum workboat with power tools and a winch. Strater, who owns a marine construction business, was setting out to tinker with floating equipment at a nearby oyster farm. On the quiet morning in August, with the sun already beating down hard, his vessel whirred to life, only without the usual growl of an oil-guzzling motor. The boat is all electric. Just north of where the Cousins River meets Casco Bay, Willy Leathers was powering up his own electric watercraft, which had its first outing in July. Leathers uses his 28 -foot (8.5-meter) boat for cultivating oysters at Maine Ocean Farms , where roughly 3 million of the animals grow in dozens of floating cages. Both Strater and Leathers said they switched to electric workboats for several reasons. Their new watercraft are a cleaner alternative to the smelly, polluting petroleum-powered vessels that dominate Maine’s 3 , 500 miles (5,633 kilometers) of coastline. Electric propulsion is also significantly quieter than a gas or diesel motor. For Leathers, whose 10 -acre (4-hectare) sea farm is a significant presence in the cove where he operates, the swap is about being a good neighbor to the shoreside community. “ It’s an innovation born from necessity for us,” said Strater about his electric boat, which he docks each night at the Sea Meadow Marine Foundation , the nonprofit boatyard and aquaculture innovation hub he runs with several other small business owners. “[The boat] really works well for what we do with it, and we’re letting farmers use it to see how it could work for them.” The Rise of Electric Boats Battery-powered vessels are starting to catch on in the United States and worldwide as companies and maritime authorities work to reduce emissions and improve the experience of cruising waterways. The technology ranges from small outboard motors on workboats and recreational watercraft to powerful inboard systems on ferries, tugboats , and supply vessels for offshore wind farms and oil rigs. In recent decades, Norway, with its extensive coastline and ample government funding, has spearheaded the transition globally. China, which is both the world’s largest shipbuilder and battery manufacturer, has rapidly deployed hundreds of battery-powered vessels over the last several years. Falling battery costs, better technology, and stricter environmental rules are compelling some vessel owners to install partial or fully electric systems, primarily for watercraft that operate near the shore or on fixed routes. For commercial fishing in particular, customers are helping to drive the push to clean up. “ Everyone’s more concerned now with where their food comes from, and we’ve seen that [consumers] are looking for that complete sustainable supply chain,” said Ed Schwarz, the head of marine solutions sales in North America for Siemens Energy, which has built electric propulsion systems for U.S. ferries . Maine Ocean Farms founders Eric Oransky [left] and Willy Leathers switched to an electric workboat in July 2025. Brendan Bullock Electrification has only very recently come to the U.S. aquaculture sector. In Maine, the small but fast-growing segment includes nearly 200 farms for shellfish, fin fish, and edible seaweed. Strater and Leathers are among the first in their business to trade gas motors for electric propulsion—a switch they say they’re hoping to accelerate. Oil-guzzling motors are among the largest sources of greenhouse gas emissions for the state’s multibillion-dollar seafood sector. Still, electrifying commercial watercraft can be a difficult course to navigate , given the higher up-front costs of electric motors and the lack of charging infrastructure—and grid infrastructure in general—in rural waterfront communities. Early adopters like Strater and Leathers said they hope the experiences gained from their demonstrations can help pave the way for decarbonizing Maine’s blue economy. With the help of the Island Institute , a Maine-based nonprofit that works on marine-related energy transitions, Leathers is collecting performance data from his vessel to share more broadly with the industry. “ People say it looks cool and shiny and looks like it operates great,” Lia Morris, the Island Institute’s senior community development officer, said of electric boats. “ But we really want to be able to prove out the [business] case.” Electric boats can cost between 20 percent and 30 percent more than a gas- or diesel-powered vessel of a comparable size. However, owners can save on maintenance and fuel over the long term, Strater’s business partner Nick Planson said. “ The high-level math that we’ve come up with” is a financial break-even point of “ about four to five years, and then over a 10 -year time span, you’re definitely coming out way ahead based on the vastly reduced maintenance cost, replacement cost of failed equipment, and fuel costs,” said Planson. Battery-Powered Workboats Lack Charging Infrastructure But the initial price tag presents a significant hurdle. Strater and Planson’s sleekly designed, no-frills watercraft cost US $ 100 , 000 to build and outfit with a single electric outboard motor. Leathers’s boat, called Heron, cost about four times as much. It has two electric outboards and a ramp for unloading and hauling more than 10 , 000 oysters at a time from the sea farm to distributors waiting on the dock. Its hull is also equipped with a small cabin and toilet. Both operations relied on grant funding to defray the expense of going electric. For their part, Strater and Planson used about $ 50 , 000 from a larger U.S. Department of Agriculture small business grant they got in 2024 to establish a use case for electric workboats in the aquaculture industry. Leathers’s business, Maine Ocean Farms, was included on a collaborative $ 500 , 000 U.S. Department of Energy (DOE) grant last year that earmarked about $ 289 , 000 for boat building and propulsion systems, in addition to other funds for charging infrastructure and data collection. The prospects for funding future projects are now much murkier under the Trump administration, maritime policy experts say. The DOE ’s Office of Energy Efficiency and Renewable Energy, which awarded the money to Maine Ocean Farms and its partners, is facing significant budget cuts in the next fiscal year. The GOP-backed spending law that passed in July rescinded some unobligated grant funding for cleaning up marine diesel engines. While other programs were spared, it’s unclear whether the current Congress will approve new funding for initiatives ranging from electrifying huge urban ports to deploying low-emissions ferries in rural communities. “ We can go really fast for a short distance. We can go really slow for a long distance, and it works for what we do with it,” says Strater. But federal grants aren’t the only way to address the higher cost of electric boats. Strater and Planson also worked with Coastal Enterprises, Inc., a Maine-based community development financial institution focused on climate resilience, to establish a “ marine green” loan program that can make the up-front costs of switching to electric propulsion more accessible to small businesses. “ The more electric engines that are being employed in Maine helps lift the whole tide for everyone,” said Nick Branchina, director of CEI ’s fisheries and aquaculture program. As part of its marine green lending, CEI offers loans starting at $ 25 , 000 for small businesses to make the switch to electric propulsion and comfortably afford the cost of batteries or a shoreside charging installation. Planson said that as electrification moves beyond initial grant-funded projects, the challenge is keeping systems affordable. He said he wants to see other small business owners able to “ take a reasonable swing” at electric propulsion. Buying a boat, of course, is only the first obstacle. Electric vessel owners must also learn how to use their new propulsion systems and find a place to charge them. How Do Electric Boats Perform in Cold Weather? This summer, Leathers said he’s had no trouble making the nearly 2-mile (3-kilometer) round trip from the slip where he docks Heron in South Freeport, Maine, to his farm on Casco Bay. With a full charge, he can make trips slightly farther to meet distributors closer to Portland. But as temperatures drop this winter, Leathers said he’s not sure how far the outboards’ two batteries will take him. Cold weather can reduce battery capacity and impact performance, shrinking an electric motor’s range. It’s a part of Leathers’s demonstration to find out what the impacts are in practice. Like Leathers, Strater and Planson also work year-round. They said they’re both impressed with how their boat performed last winter after launching in the fall of 2024 . For Planson, who markets battery-powered equipment to aquaculture farmers as part of his startup, Shred Electric , a boat’s ability to run through the year’s coldest months is a key selling point. “ The proof is in the pudding,” said Planson. “ When you’re working with…waterfront applications, it really needs to work every day and all year.” Strater and Planson said their boat’s range was an important consideration when they partnered with the startup Flux Marine to build the electric outboard motor. With limited shoreside charging infrastructure in place, the boat has to make it out and back on a single charge, sometimes to aquaculture operations 7 miles (11 kilometers) away. In the 10 months since the boat’s launch, Strater has learned that range correlates to speed. He can modulate the boat’s pace depending on how far he wants to go. “ We can go really fast for a short distance. We can go really slow for a long distance, and it works for what we do with it,” he said. Soon, Maine’s early adopters will have shared access to a higher-capacity Level 2 charger that will be installed at the Sea Meadow Marine Foundation and can charge batteries in little over 2 hours, or three times as fast as the current system. The startup Aqua SuperPower was awarded a portion of the DOE funding last year to install additional marine chargers there and at a wharf in Portland owned by the Gulf of Maine Research Institute. Island Institute also helped with grant funding for the charger at the Sea Meadow boatyard. Maine will need much more high-capacity charging infrastructure for the marine industry to transition to electric propulsion, said Morris, of the Island Institute. As the state’s aquaculture and fisheries industries look to grow beyond small-scale operations, other businesses will need to charge more frequently to make longer, farther trips up and down the coast. Expanding charging stations north of Casco Bay represents what Morris calls a “ chicken and egg” problem: a dynamic where chargers are either installed before demand gets high and sit unused, or electric boats hit the water and there’s not enough charging infrastructure, stalling future adoption. This challenge is compounded by both New England’s aging grid infrastructure and the remote nature of some of the region’s waterfront access points. Getting the right amount of power to a charging station on the shore can be costly, even in Yarmouth, which sits on Casco Bay. Often it’s the last mile that can be the most expensive. At Sea Meadow Marine Foundation, three-phase power, which can accommodate higher loads, is limited by the dirt road that separates the boat launch from the more heavily trafficked U.S. Route 1 . “ There are a lot of complicated questions,” Morris said. “ I don’t think it’s unique to Maine, it’s any rural area, but complicated questions and conversations with the utilities and the rural municipalities are going to have to be solved for.” Back on the water, Leathers docked his electric boat, Heron, alongside the sea farm’s barge, where thousands of oysters pass through for processing on harvest days. He switched the motor off and hopped onto the floating platform. For a moment, the bay was calm to the point of near silence. Then Leathers picked up an oyster cage with a rattle, turning it over in his hands as water splashed out. The sounds of the workday began. “ As a whole industry, I think it’s going to take proving that someone like us can do it,” Leathers said. “ And then the next person kind of snowballing after that.”",
    "published": "Mon, 29 Sep 2025 16:00:04 +0000",
    "author": "Julia Tilton",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Is Pivotal Helix eVTOL a First Responder in the Sky?",
    "link": "https://spectrum.ieee.org/pivotal-helix",
    "summary": "When Sinatra sang “Come Fly with Me,” he couldn’t have imagined anything like the Pivotal Helix . The Helix is a single-seat, electric vertical take-off and landing aircraft, or eVTOL . And where dozens of eVTOL startups have failed to take flight, Pivotal says it’s on track to deliver its first customer model in the first quarter of 2026—almost certainly the first eVTOL maker to reach this milestone. Helix predecessor, Blackfly, has taken more than 1,000 piloted flights, and its maker has trained more than 50 pilots to fly this unique aircraft with eight electrified rotors whirling on a pair of detachable wings. Those trainees now include a new set of customers: Fire departments and paramedics, who see intriguing possibilities in emergency responses, including landing in places helicopters can’t reach, or in which the machines would be too disruptive. For example, the Helix recently flew a trio of safety demonstrations in California with fire departments in San Bernardino , Southern Marin, and Cosumnes. One demo flight ended with a discreet touchdown in a residential cul-de-sac in Thousand Oaks. “You couldn’t dream of doing that in a helicopter,” says Ken Karklin , chief executive of the Palo Alto, Calif.–based Pivotal, due to the disruptive noise and rotor wash of a fossil-fueled chopper. Testing by NASA engineers, Karklin says, showed the Helix sends only about 70 decibels of sound to the ground from a 150-foot flight altitude. “When the Helix passes overhead at 200 feet [61 meters], you may not hear it at all,” he says. The San Bernardino County Fire Department says the Helix highlights the potential of eVTOLs to dramatically reduce response times, and overcome barriers such as traffic congestion, long rural distances or hostile natural terrain. “This aircraft represents a powerful new tool in time-sensitive trauma care,” the department said in a media release. Two Weeks of Training and Then Up, Up, and Away Skepticism continues to swirl around eVTOLs , prompted in part by their short electric range and limited capacity for people or cargo. Many eVTOL proponents pitch a future of short-hop air taxis, essentially Ubers of the sky. Those backers tend to downplay massive hurdles in securing certification from the Federal Aviation Administration , which has struggled to come up with safety, airspace, and other guidelines for eVTOLs. Another challenge will be finding and training qualified pilots who will undoubtedly demand more pay than an Uber jockey. The Helix’s secret sauce, according to Karklin, is accessibility—in technical, regulatory and financial terms. “We’re flying prolifically today, and the [eVTOL] companies chasing FAA certification aren’t close,” he says. Built largely from carbon fiber, and weighing just under 158 kilograms, the Helix conforms with the FAA’s rules for ultralight aircraft. That means the Helix does not need formal certification, and buyers don’t need a pilot’s license to take to the skies. IEEE Spectrum’s Glenn Zorpette flew the Helix’s predecessor, the BlackFly , in California in 2022, and was blown away by the experience. (The company was then under a previous corporate identity as Opener, founded by BlackFly inventor Marcus Leng). Pivotal conducted a demonstration of its Helix eVTOL for the San Bernardino County (Calif.) Fire Protection District in June 2025. Bobby Montalvo/San Bernardino County Fire Protection District After a two-week training course that includes flight simulations, buyers graduate to unsupervised solo flights. Then they’re free, under the FAA’s ultralight rules, to fly during daylight, as long as they avoid congested areas, busy airports, or restricted airspace. The company plans to back sales with recurrent training to keep pilots up to speed. Unlike most eVTOLs , the Helix doesn’t move its rotors to adjust its attitude. Instead, the entire airframe tilts upward for vertical takeoff and landing, and shifts to horizontal to cruise up to 32 kilometers (20 miles) at a software-limited 103-kilometer-per-hour (64 mile-per-hour) top speed. The design helps make the Helix less daunting for rookie pilots; a single by-wire joystick controls every aspect of flight. Karklin says pilots can spend their time hovering, cruising, or banking, rather than constantly monitoring instruments that include battery state of charge and navigation. “They can keep eyeballs outside the canopy on a beautiful landscape,” Karklin says. Compared with the third-generation BlackFly aircraft, the Helix has about 97 percent new components , including the cylindrical cells in its 9-kilowatt-hour battery. The Helix can fly at higher altitudes and in thinner, warmer air without its motors overheating at high rpm’s: Picture Denver or Lake Tahoe, where even ground takeoffs begin at a mile or more above sea level. I mprovements include power and propulsion gains, automotive-grade batteries and electronics, and a redesigned monocoque, canopy, and flight instruments. A smartphone app records data on every flight, and manages charging and service. As with the BlackFly, the Helix’s wings can be quickly detached and stored on a car trailer, along with the pod-shaped fuselage, for convenient transport. While the Blackfly can cover 32 km in ideal conditions, Karklin’s personal best is 28 km. The owner of an earthbound EV might be tempted to push it, but the stakes are higher in the sky: Pivotal’s training instructs pilots to find a safe landing spot with no less than 20 percent of battery charge remaining. Proprietary chemistry ensures cells can deliver 100 percent of rated discharge all the way to that 20 percent barrier, ensuring no loss of thrust as the battery is depleted. Pivotal believes its Helix eVTOL is a natural transportation mode for emergency responders who need to get to residential addresses quickly and land without the noise and rotor wash of a conventional helicopter. Pivotal A Hybrid eVTOL is in the Works for Potential Military Customers Triple redundancy in the computer flight controllers helps ensure safety. If all else fails, the Helix’s pilot-operated parachute can slow its descent to about five meters per second. That’s swift enough to destroy the carbon-fiber fuselage in an emergency landing, but gentle enough to let the pilot unlatch the canopy and walk away injury-free in 97 percent of test scenarios. And t he Helix can now carry 100 kg (220 pounds) of payload between its pilot and assorted gear, a 10 percent gain over the BlackFly. “We’re now up to carrying the 80th percentile American male in weight, up from 51 percent,” Karklin says with a smile. For beefier first responders, that still doesn’t seem to leave much room for gear. Karklin notes an EMT’s “go bag” of medical supplies can weigh up to 25 kg, in part because they’ve never been created with mass in mind. Working with paramedics, the company has created an optimized medical kit that weights as little as 7 kg, including a small defibrillator. And if the Helix can’t haul as much equipment as an ambulance, it can get a first responder on the ground quicker to save or stabilize a patient, or to establish communications and survey the scene for rescuers to come. The vehicle trailer for the Pivotal Helix eVTOL is part of a package that adds $50,000 to the cost of the basic aircraft. Pivotal The company is taking deposits for a Helix with a base cost of US $190,000 but reaching roughly $260,000 with options such as a travel trailer, a Global System for Mobile Communications (GSM) radio, or an Automatic Dependent Surveillance-Broadast (ADS-B) radio system. Karklin acknowledges the limitations of today’s lithium-ion batteries to get aircraft off the ground and keep them flying over meaningful distances. “There’s nothing that beats the energy density of diesel fuel, with Jet-A right behind,” he says, referring to the kerosene-based aviation fuel. So Pivotal is also developing a new BlackFly with a gas-electric hybrid power train, strictly for demonstration purposes for now, that might range up to 322 km (200 miles), for potential defense customers . Yet Karklin is bullish on the potential for simple, plug-in rechargeable eVTOLs. The company’s new development program, he discloses, is training EMTs from two fire departments to fly its Helixes, and seeking other customers in the first-responder space. “Electric aviation has a rich future ahead of it,” he says. This article was updated on 12 September 2025 to correct a noise figure and better distinguish between Blackfly and Helix stats.",
    "published": "Thu, 11 Sep 2025 12:30:03 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "How Nauto’s AI Dashcam Reduces Driver Risk and Accidents",
    "link": "https://spectrum.ieee.org/ai-dashcam-driver-safety-nauto",
    "summary": "Driving trucks is one of the unappreciated backbones of modern civilization. It’s also hard and sometimes dangerous work. But technology is being spun up to make the job safer and easier. A new class of devices is being targeted at fleets that help drivers elude accidents by flagging risky situations. The new systems use convolutional neural networks running in the vehicle (“edge” AI ) and in the cloud to fuse data inputs from onboard vehicle diagnostics, along with data from cameras facing the driver and the roadway. The result are systems that can assess, in real time, the risk of collision and warn drivers in time to avoid most of them. One of the most advanced of these new systems is from a company called Nauto, a startup based in Palo Alto, Calif. Earlier this year, the Virginia Tech Transportation Institute (VTTI) put Nauto’s AI-enabled safety system through its paces on the same Virginia Smart Roads controlled-access test tracks where it conducted a 2023 benchmark study evaluating three similar products. VTTI says this year’s testing was performed under the same scenarios of distracted driving, rolling stops, tailgating, and night driving. According to the Virginia Tech researchers, Nauto’s dashcam matched or outperformed the previously benchmarked gadgets in detection accuracy—and provided feedback that translated more directly into information supervisors could use to address and correct risky driver behavior. “This study allowed us to evaluate driver-monitoring technologies in a controlled, repeatable way, so we could clearly measure how the [Nauto] system responded to risky behaviors,” says Susan Soccolich , a senior research associate at VTTI. MIT driver attention researcher Bryan Reimer , who was not involved in the study, says the real value of systems like Nauto’s lies beyond monitoring. “Many companies focus only on monitoring, but monitoring alone is just an enabler—the sensor, like radar in adaptive cruise control or forward collision warning. The real art lies in the support systems that shape driver behavior. That’s what makes Nauto unique.” Reducing Alert Fatigue in Trucking Safety “One of our primary goals is to issue alerts only when corrective action is still possible,” says Nauto CEO Stefan Heck . Just as important, he adds, is a design meant to avoid “alert fatigue,” a well-known phenomenon in which alerts triggered when situations don’t actually call for them make would-be responders less apt to take heed. False alerts have long plagued driver-assist systems, causing drivers to eventually disregard even the most serious warnings. Nauto claims its alerts are accurate more than 90 percent of the time, because it combines more than 10 distraction and drowsiness indicators. Among the inattention indicators the system tracks are head nodding or tilting, yawning, change in eye-blink rate, long eyelid closures (indicating something called microsleeps), and gaze drifting from the road for extended periods (what happens when people text and drive). If a pedestrian enters the crosswalk and the driver is awake, alert, and not driving too fast, the system will remain silent under the assumption that the driver will slow down or stop so the person on foot can cross the street without incident. But if it notices that the driver is scrolling on their phone, it will sound an alarm—and perhaps trigger a visual warning too—in time to avoid causing injury. While VTTI did not specifically test false-positive rates, it did measure detection accuracy across multiple scenarios. Soccolich reports that in Class 8 tractor tests, the system issued audible in-cab alerts for 100 percent of handheld calls, outgoing texts, discreet lap use of a smartphone, and seat-belt violations, as well as 95 percent of rolling stops. For tailgating a lead vehicle, it alerted in 50 percent of the trials initially, but after adjustment, delivered alerts in 100 percent of cases. Nauto’s alarms may be triggered not only in the driver’s cabin but also in fleet supervisors’ offices of the trucking company that uses the system. But Nauto structures its alerts to prioritize the driver: Warnings—for all but the most high-risk situations—go to the cab of the truck, allowing self-correction, while supervisors are notified only when the system detects recklessness or a pattern of lower-risk behavior that requires corrective action. “Many companies focus only on monitoring, but monitoring alone is just an enabler—the sensor, like radar in adaptive cruise control or forward collision warning. The real art lies in the support systems that shape driver behavior. That’s what makes Nauto unique.” — Bryan Reimer, MIT Advanced Dashcam for Fleet Risk Management The company packages its vehicle hardware in a windshield-mounted dashcam that plugs into a truck’s onboard diagnostics port . With forward- and driver-facing cameras and direct access to vehicle data streams, the device continuously recalculates risk. A delivery driver glancing at a phone while drifting from their lane, for example, triggers an immediate warning and a notice to supervisors that the driver’s behavior warrants being called on the carpet for their recklessness. By contrast, a rural stop-sign roll-through at dawn might trigger nothing more than a cheerful reminder to come to a complete stop next time. There are more complex cases, such as when a driver is following another vehicle too closely. On a sunny day, in light traffic, the system might let it go, holding back from issuing a warning about the tailgating. But if it starts to rain, the system recognizes the change in safe stopping distance and updates its risk calculation. The driver is told to back off so there’s enough space to stop the truck in time on the rain-slicked road if the lead car suddenly slams on its brakes. Nauto aims to give drivers 3 to 4 seconds to steer clear, brake gently, or refocus. “The better response isn’t always slamming on the brakes,” Heck says. “Sometimes swerving is safer, and no automated braking system today will do that.” AI Dashcams Lower Trucking Collision Rates According to a 2017 Insurance Institute for Highway Safety (IIHS) report, if all vehicles in the United States were equipped with both forward collision warning with automatic emergency braking in 2014, “almost 1 million police-reported rear-end crashes and more than 400,000 injuries in such crashes could have been prevented.” A separate IIHS study concluded that putting both technologies on a vehicle was good enough to prevent half of all such collisions. Heck, pointing to those numbers as well as to the Nauto system’s ability to sense danger originating both outside and inside a truck, claims his company’s AI-enabled dashcam can help cut the incidence of collisions even further than those built-in advanced driver assistance systems do. Vehicle damage obviously costs a lot of money and time to fix. Fleets also pay follow-on costs such as those associated with driver turnover , a persistent problem in trucking. Lower crash rates, conversely, cut recruitment and training costs and reduce insurance premiums, giving fleet managers strong incentive to implement technologies like this new class of AI dashcams. Today, Nauto’s dashcam is an aftermarket add-on about the size of a smartphone, but the company envisions future vehicles with the technology embedded as a software feature. With insurers increasingly setting their rates based on telematics from fleets, the ability to combine video evidence, vehicle data, and driver monitoring could reshape how risk is calculated and rates are set. Ultimately, the effectiveness of these risk assessment and alerting devices hinges on driver trust. If the driver believes that the system is designed to make them a better, safer motorist rather than serving as a surveillance tool, they’ll be more likely to accept input from their electronic copilot—and less likely to crash.",
    "published": "Sat, 06 Sep 2025 13:00:02 +0000",
    "author": "Willie D. Jones",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "BMW Overhauls Its EV Approach With the iX3",
    "link": "https://spectrum.ieee.org/bmw-ix3-neue-klasse",
    "summary": "Since creating its first innovative motorcycle in 1923, and a sporty small car in 1928, BMW built its “ Ultimate Driving Machine ” reputation from literal nuts and bolts: hardware, with thousands of parts engineered, tested, and tuned in the service of cars and motorcycles that would delight owners and guarantee fun. The automaker’s Neue Klasse (or “New Class”) EVs—led by the production 2026 iX3 SUV that will debut on 8 September at the IAA Mobility show in Munich—show how the industry is being revolutionized. Software is the new king, the element that increasingly differentiates cars and gives automakers their competitive edge. IEEE Spectrum was invited to Munich in July, where BMW executives and engineers showed the iX3 prior to its public reveal and offered a deep dive into its Neue Klasse tech . BMW iX3’s Advanced Digital System Beneath the iX3’s strikingly modern exterior lies a new digital nervous system that will underpin up to 40 new BMW models between now and 2027, including EVs, plug-in hybrid electric vehicles, and cars with internal combustion engines . For these software-defined vehicles, four so-called Superbrains will sense their surroundings, monitor drivers, and respond to their commands. These four big brains amass 20 times as much computing power as BMW’s current-generation EVs. As the single largest vehicle investment in BMW history, Neue Klasse includes the “Heart of Joy” controller that engineers see as their secret weapon to make EVs that are safer than ever, yet truly fun to drive—not just in the straight-line speed that has become the norm for Teslas and other models. Christian Thalmeier, a manager of driving dynamics development at BMW , says weighty EV batteries and electric motors bring new challenges in keeping BMWs feeling agile, stable, and light-footed. The previous 10-millisecond latency of BMW’s more balkanized system controllers was fine for the lumbering responses of internal combustion engines. But they’re no match for the near-instant reactions of electric motors. The Heart of Joy combines all powertrain, chassis, and braking functions into a single unit. Predictive algorithms operate on a high-speed bus at 1,000 “beats” per second, 10 times as fast as before. “This heart beats very fast, so it makes the car feel alive and agile,” Thalmeier says. “ It makes a fairly heavy car handle lightly, something you’ll feel not only under high g-forces, but in normal driving.” These new EVs use electric motors themselves to influence the car’s handling, stability, and braking behavior. The iX3 not only regenerates 40 percent more electricity than before; BMW estimates that 98 percent of all stops in real-world driving can be handled by the electric motors, with no need for drivers to squeeze the brake pedal. The automaker says iX3 test passengers, after closing their eyes, often can’t tell that the BMW has come to a full stop, with the system delivering precision and smoothness that human drivers can’t match. Brake wear is reduced as well. Thalmeier offered the example of a driver making a high-speed emergency lane change, followed by a sharp return to the original lane to avoid a collision. It’s a notorious tricky move that, even for relatively skilled drivers, could result in a treacherous loss of control. Between the combined speed of electric motors and computing, the iX3 can divert torque to the rear axle while the driver has barely begun to crank the wheel to avoid a car or obstacle ahead, setting up what’s to come. The car then automatically performs brake interventions at individual wheels and shifts torque to front wheels to maintain control as the car snaps back into its lane. The result is a pro-level maneuver that could avoid a serious collision between two or more cars—and something that would be impossible in any fossil-fueled car. Semi-Autonomous Driving Innovations The iX3’s second Superbrain combines the latest generation of semi-automonous driving systems in a single unit (versus four previously). That helps systems operate as a silent companion to boost safety. Semi-autonomous functions are designed to keep the human driver engaged and in the loop, rather than zoning out. Here, a driver can still steer the iX3, apply brakes, or even drive intentionally over a lane marker—such as to steer around a bicyclist or romp through high-speed corners—without the driver-assistance system intervening, shutting down, or having to be annoyingly restarted. The BMW’s driver-monitoring camera and algorithms will recognize the difference between, say, a courteous or Type-A driver and one who is distracted, and react accordingly. A third controller manages the infotainment operating system, including AI-supported cloud-based functions, a 3D heads-up display, and a world-first system called Panoramic iDrive, in which driving information is projected onto a black nano-coated surface that stripes the entire lower windshield. Owners can configure six separate slots for the panoramic display, such as navigation maps and performance readouts. The 1.1-meter-long backlit matrix display is designed to be viewable in bright sunlight, or for drivers wearing polarized sunglasses. Finally, a fourth controller manages basic onboard operations such as vehicle access and security and remote-software upgrades. Like other legacy automakers, BMW is taking new cues from vertically integrated Chinese powerhouses such as BYD , which sources and develops raw materials, software, batteries, and other tech in-house. BMW executives said today’s key is to separate vehicle and software development to future-proof cars, including via over-the-air updates. “This means we continuously develop software rather than starting from scratch” with each new model, says Christoph Grote , senior vice-president of BMW Group electronics and software. The iX3 will include the ability to set up a panoramic display on the lower portion of the windshield. BMW BMW’s global teams are generating 130 times as much software as a decade ago. Roughly 10,000 developers are tasked with more than 1,000 software modules, 20 gigabits of software, and 500 million lines of code that will be integrated into the Superbrains and overall architecture. Stable software platforms run on the Superbrains, with a “Shared Service Layer” acting as a connecting “middleware” element whose functions include cybersecurity and flexible over-the-air updates. The digital nervous system allows a radically simplified wiring harness, eliminating 600 m of wiring for a 30 percent weight savings. The brains and their high-speed data connections link with smaller “zonal controllers” that manage data flows exclusively in their zones. BMW iX3’s Powerful Electric Motors As for the actual nuts and bolts of the iX3, they’re impressive in their own right. An initial iX3 M50 xDrive model churns up 345 kilowatts (463 horsepower) of power and 645 newton meters of torque from its electric motors. BMW’s redesigned dual electric motors, with an asynchronous front motor and a synchronous unit at the rear, integrate silicon-carbide inverters, and reduce friction losses by 40 percent. The automaker estimates the all-wheel-drive iX3 will scoot from 0 to 100 kilometers per hour in 4.9 seconds, and reach a top speed of 210 km/h. These models adopt a leading-edge 800-volt platform , double that of Tesla’s, and on par with leading models from Chinese makers, Hyundai/Kia, Porsche, Vivian, and others. They can charge at up to 400 kW, a faster pace than any EV currently sold in America, backed by compatible chargers that are now coming online from providers such as the new Ionna network , or in Europe, from Ionity. On the right charger, the iX4 can add 350 km (217 miles) of driving range in just 10 minutes, or a 10 to 80 percent charge in 15 minutes—fast enough to quiet EV naysayers. BMW’s former prismatic cells give way to new Generation 6 cylindrical batteries, developed in-house at the automaker’s new Battery Competence Center, in a partnership with China’s CATL. BMW says those cylindrical cells will boost energy density by 20 percent, including higher nickel content in cathodes and more silicon in anodes. For the iX3, that’s enough to deliver a generous 560 km of range under the European Union’s WLTP testing regime, or 400 miles by the more real-world estimates of U.S. EPA standards. That’s a healthy 30 percent jump in driving range in a single EV generation, driven by new batteries and reductions in aerodynamic drag and powertrain energy losses. A sunken compartment inside the BMW iX3 holds the car’s charger. BMW Remarkably, BMW says that 50 percent of the batteries’ lithium, cobalt, and nickel will come from recycled materials. These cylindrical cells replace BMW’s previous prismatic design, in two form factors depending on the model application: a 46-mm diameter and either a 95-mm or 120-mm height. Those cells line up neatly in packs with no space-wasting modules that require individual wiring. “Pack-to-body” construction saves more space and mass: The battery’s metal upper housing actually forms the floor of the cabin (below the carpeting of course). The iX3 crams 108 kilowatt-hours of energy into roughly the same space as the automaker’s previous battery. The iX3 will initially emerge from a new, ground-up factory in Debrecen, Hungary. European customers will see their first cars in spring, with an iX5 M50 xDrive model starting from 68,900 euros. That European debut will be followed by sales in the U.S., starting from around US $60,000, and China. (BMW plans to build Neue Klasse models in China as well, and eventually at its largest global factory in Spartanburg, S.C.). For U.S. buyers, the $7,500 federal consumer subsidies that helped ease the transition to EVs will be long gone by the time the iX3 arrives. In other words, the iX3 will need to be compelling enough to stand on its own two feet. Based on an early glimpse, though, BMW has a reasonable shot at success.",
    "published": "Fri, 05 Sep 2025 09:15:02 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Despite Headwinds, EV Charging in the U.S. Is Booming",
    "link": "https://spectrum.ieee.org/public-ev-chargers-electrify-america",
    "summary": "For EV-charging companies , the obstacles are piling up like a nasty freeway wreck. There’s slowdown in EV adoption in the United States. The Trump administration has put EVs in the crosshairs by gunning for fuel-economy and climate-change standards, abolishing consumer tax credits on 30 September, and slapping stiff tariffs on EV makers. The current administration even sought to claw back federally approved funding for public chargers, but has reluctantly reversed course after being rebuffed in the courts. Defying those hurricane-force headwinds, companies are still poised to open 16,700 public DC fast chargers in the United States this year, a single-year record and a 20 percent jump from 2024, according to charging analytics company Paren. Electrify America is key to those gains: The nation’s largest non-Tesla purveyor of fast charging is expanding its own footprint by 30 percent this year. IEEE Spectrum spoke with Rachel Moses, Electrify America’s senior director of sales and marketing, who explained what it will take to keep a growing army of EV drivers plugged in and charging—as quickly as possible for time-pressed drivers. What has Electrify America been up to lately? Rachel Moses: We’ve really been focused on upgrading our early-generation equipment. Go back to 2018, in the Chinatown area of Los Angeles, and we built a three-charger location that was the first of its kind, with 350 kilowatts. But we know we need much, much larger sites. Our latest is in Santa Monica, near the I-10 freeway, with 20 Hyper-Fast chargers that can add up to 20 miles of driving range per minute for capable EVs. Our focus is building those large-format locations, with a minimum of 10 dispensers, and improving the customer experience to reduce queuing, a phenomenon that’s happening mostly in California and parts of the Northeast. In those early years, the company concentrated on installing chargers along highway corridors, as Tesla had done with its Supercharger network, to reassure potential owners they could cover long distances in an EV. Now you’re targeting cities themselves? Moses: We’re really building in specific metro areas, to support drivers who maybe don’t have access to off-street parking—but now can get into an EV because they can use our public infrastructure. We have a 20-dispenser station in San Francisco with a bathroom, amenities, and security cameras, next to a highway where there’s a lot of multiunit dwellings that may not have overnight charging. All told, we now have 5,000 dispensers at more than 1,000 sites. Improving EV Charger Reliability Electrify America and other providers took a lot of heat for balky or out-of-service chargers , especially compared with Tesla’s reliable network. But many infrastructure experts agree the situation on the ground has markedly improved over the last year. Anecdotally, my stops at Electrify America chargers have gone off without a hitch for several months now. What’s been changing? Rachel Moses is Electrify America’s senior director of sales and marketing. Electrify America Moses: That improvement has really come from the replacement of legacy hardware. We’ve seen a 75 percent reduction in service dispatches on next-generation equipment. We’ve taken our learnings and insights to invest in remote diagnostic capabilities that simply didn’t exist in 2017. We’ve also made our field-service engineers more strategically located. These rapid-response engineers are keeping more parts on hand for more high-touch, high-failure components, such as the connectors or the [human-machine interface] and screens. That next-generation equipment now has a 97 percent uptime. And we continue to invest in how to ruggedize the equipment with the highest touch points. A reporter for InsideEVs witnessed a demonstration of BYD’s new “ megawatt charger ” in Beijing, a 1,000-kW charger that can fill a compatible BYD model to 80 percent in five minutes, nearly as quickly as filling a gasoline tank. Electrify America pioneered 350-kW DC charging in the United States, and now we’re seeing small numbers of cars and chargers that might achieve charging peaks of about 400 kW. Is the United States in danger of falling behind the charging curve? Or is megawatt charging just overkill, as some skeptics suggest? Moses: When we launched 350-kW chargers in 2018, there was a perception that it was too much power for vehicles on the road. Today, there are still only a handful of vehicles that are capable of maxing out a 350-kW charger. So our current output is still beyond what most EVs on the road can take. We’re certainly still looking forward. We want to engage with all hardware manufacturers, and continue to develop next-generation equipment. But we also want to be really thoughtful about our future investments, and the timing to bring newer technologies to market. Tesla’s North American Charging Standard (NACS)—now standardized as the SAE JC 3400 connector—seems to be the clear winner of the standards war. Nearly every major automaker is ditching the Combined Charging System ’s Combo Plugs to switch its models to a Tesla-style plug over the next few years. But that will still leave millions of existing EVs reliant on the CCS plugs used by Electrify America and other non-Tesla charging providers. Owners of non-Tesla models are also accessing Tesla stations by carrying adapters, and vice versa. How will Electrify America manage this transition? Moses: We are committed to supporting the NACS 3400 connector, and we currently have two pilot locations to gain insight from the customer experience and understand the data. But we have to be very measured about the way in which we deploy it across our network. We certainly don’t want to orphan the existing CCS population. Those drivers had over 16 million sessions on our network in 2024, and we delivered over 600 gigawatt-hours of energy, which was 65 percent growth from 2023. Making sure we have the right balance (of the two plug standards) and rolling out NACS at existing and future locations is important to us. We do see some adapter use today, and we will continue to see that over coming years, but I don’t think it’s an ideal customer experience. Testing EV Compatibility Standards Before Elon Musk decided to open his network to all comers, his company had a big advantage: Their proprietary Superchargers only had to work with Teslas. But Electrify America’s chargers have to be compatible with cars from every global automaker, and be ready the minute their new models leave the showroom. Ideally, that includes a streamlined payment system. How do you stay on top of that? Moses: At our Center of Excellence in Northern Virginia, we opened a new technology development lab in 2024, with 22 chargers for testing. We bring in the auto manufacturers, so we’re testing the hardware, software, and firmware, and how various standards have been deployed by each manufacturer, because there can be some nuances. We’ve completed more than 45,000 hours of testing, which enables that seamless experience. As stewards of the industry, we also want to help set and evolve standards and collaborate industry-wide. In North America, we were pioneers of Plug & Charge (the EV communication and payment standard enabled by ISO 15118 ). But not all automakers have deployed it. So we have to make sure that every authentication method, whether it’s Plug & Charge, our mobile app, or a credit card reader, is constantly being tested and improved in collaboration with the automakers. EVs are facing new hurdles, including the end of federal US $7,500 credits that made it easier for buyers to make the leap to electified cars. Many analysts foresee at least a temporary dip in EV sales, and several automakers have postponed or canceled EV introductions. Are you concerned that momentum is slowing? There are industry headwinds, and we are kind of navigating this period of recalibration, while also seeing that consumer interest remains high. But we had that 50 percent year-over-year growth in charging sessions in 2024, and we expect that again in 2025. I’ve been in this industry for 16 years, and we’ve faced headwinds in the past. But the transition to electric mobility is a global shift that transcends short-term market fluctuations. Automakers and private-sector players are maintaining robust investments in EV development and infrastructure. So we have longer-term confidence that the future is electric.",
    "published": "Tue, 02 Sep 2025 16:00:03 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Automakers Race to Add Voice AI to Connected Vehicles",
    "link": "https://spectrum.ieee.org/ai-enabled-vehicle-assistant",
    "summary": "When rain begins to fall and a driver says, “ Hey Mercedes , is adaptive cruise control on?”—the car doesn’t just reply. It reassures, adjusts, and nudges the driver to keep their hands on the wheel. Welcome to the age of conversational mobility , where natural dialogue with your car is becoming as routine as checking the weather on a smart speaker. A new era of human-machine interaction This shift is more than a gimmick. Conversational interfaces represent the next evolution of vehicle control, allowing drivers to interact with advanced driver-assistance systems—without fiddling with buttons or touchscreens. Automakers are embedding generative AI into infotainment and safety systems with the goal of making driving less stressful, more intuitive, and ultimately safer. Unlike earlier voice systems that relied on canned commands, these assistants understand natural speech, can ask follow-up questions, and tailor responses based on context and the driver’s behavior. BMW , Ford, Hyundai , and Mercedes-Benz are spearheading this transformation with voice-first systems that integrate generative AI and cloud services into the driving and navigating experience. Tesla ’s Grok , by contrast, remains mostly an infotainment companion—for now. It has no access to onboard vehicle control systems—so it cannot adjust temperature, lighting, navigation functions. And unlike the approach taken by the early leaders in adding voice AI to the driving experience, Grok responds only when prompted. Mercedes leads with MBUX and AI partnerships Mercedes-Benz is setting the benchmark. Its Mercedes-Benz User Experience (MBUX) system—unveiled in 2018—integrated generative AI via ChatGPT and Microsoft ’s Bing search engine, with a beta launched in the United States in June 2023. By late 2024, the assistant was active in over 3 million vehicles, offering conversational navigation, real-time assistance, and multilingual responses. Drivers activate it by simply saying, “Hey Mercedes.” The system can then anticipate a driver’s needs proactively. Imagine a driver steering along the scenic Grosslockner High Alpine Road in Austria, hands tightly gripping the wheel. If the MBUX AI assistant senses that the driver is stressed via biometric data, it will slightly adjust the ambient lighting to a calming blue hue. Then a gentle, empathetic voice says, “I’ve adjusted the suspension for smoother handling and lowered the cabin temperature by two degrees to keep you comfortable,” At the same time, the assistant reroutes the driver around a developing weather front and offers to play a curated playlist based on the driver’s recent favorites and mood trends. A car with Google Maps will today let the driver say “Okay, Google” and then ask the smart speaker to do things like change the destination or call someone on the smartphone. But the newest generation of AI assistants, meant to be interactive companions and copilots for drivers, present an entirely different level of collaboration between car and driver. The transition to Google Cloud’s Gemini AI , through its proprietary MB.OS, platform enables MBUX to remember past conversations and adjust to driver habits—like a driver’s tendency to hit the gym every weekday after work—and offer the route suggestions and traffic updates without being prompted. Over time, it establishes a driver profile—a set of understandings about what vehicle settings that person likes (preferring warm air and heated seats in the morning for comfort, and cooler air at night for alertness, for example)—and will automatically adjust the settings taking those preferences into account. For the sake of privacy, all voice data and driver-profile information are stored for safekeeping in the Mercedes-Benz Intelligent Cloud, the backbone that also keeps the suite of MB.OS features and applications connected. BMW: from gesture control to voice first Although BMW pioneered gesture control with the 2015 7 Series , it’s now fully embracing voice-first interaction. At CES 2025, it introduced Operating System X —with BMW’s Intelligent Personal Assistant (IPA), a generative AI interface in development since 2016—that anticipates driver needs. Say a driver is steering the new iX M70 along an alpine roadway on a brisk October morning. Winding roads, sudden elevation changes, narrow tunnels, and shifting weather make for a beautiful but demanding journey. Operating System X, sensing that the car is ascending past 2,000 meters, offers a bit of scene-setting information and advice: “You’re entering a high-altitude zone with tight switchbacks and intermittent fog. Switching to Alpine Drive mode for optimized torque distribution and adaptive suspension damping [to improve handling and stability]” The brain undergirding this contextual awareness now runs on Amazon ’s Alexa Custom Assistant architecture. “The Alexa technology will enable an even more natural dialogue between the driver and the vehicle, so drivers can stay focused on the road,” said Stephan Durach, senior vice president of BMW’s Connected Car Technology division, when Alexa Custom Assistant’s launch in BMW vehicles was announced in 2022. In China, BMW uses domestic LLMs from Alibaba , Banma , and DeepSeek AI in preparation for Mandarin fluency in the 2026 Neue Klasse . “Our ultimate goal is to achieve...a connected mobility experience expanding from a vehicle to fleets, hardware to software, and ultimately to the entire mobility infrastructure and cities.” –Chang Song, head of Hyundai Motor and Kia’s Advanced Vehicle Platform R&D Division Ford Sync, Google Assistant, and the path to autonomy Ford, too, is pushing ahead. The company’s vision: a system that lets drivers take Zoom calls while the vehicle does the driving—that is, once Level 3 vehicle autonomy is reached and cars can reliably drive themselves under certain conditions. Since 2023, Ford has integrated Google Assistant into its Android -based Sync system for voice control over navigation and cabin settings. Meanwhile, its subsidiary Latitude AI is developing Level 3 autonomous driving , expected by 2026 Hyundai researchers test Pleos Connect at the Advanced Research Lab’s UX Canvas space inside Hyundai Motor Group’s UX Studio in Seoul. The group’s infotainment system utilizes a voice assistant called Gleo AI. Hyundai Hyundai’s software-defined vehicle tech: digital twins and cloud mobility Hyundai took a bold step at CES 2024, announcing an LLM-based assistant codeveloped with Korean search giant Naver . In the bad-weather, alpine-driving scenario, Hyundai’s AI assistant detects, via readings from vehicle sensors, that road conditions are changing due to oncoming snow. It won’t read the driver’s emotional state, but it will calmly deliver an alert: “Snow is expected ahead. I’ve adjusted your traction control settings and found a safer alternate route with better road visibility.” The assistant, which also syncs with the driver’s calendar, says “You might be late for your next meeting. Would you like me to notify your contact or reschedule?” In 2025, Hyundai partnered with Nvidia to enhance this assistant using digital twins —virtual replicas of physical objects, systems, or processes—which, in this case, mirror the vehicle’s current status (engine health, tire pressure, battery levels, and inputs from sensors such as cameras, lidar, or radar). This real-time vehicle awareness gives the AI assistant the wherewithal to suggest proactive maintenance (“Your brake pads are 80 percent worn. Should I schedule service?”) and adjust vehicle behavior (“Switching to EV mode for this low-speed zone.”). Digital twins also allow the assistant to integrate real-time data from GPS, traffic updates, weather reports, and road sensors. This information lets it reliably optimize routes based on actual terrain and vehicle condition, and recommend driving modes based on elevation, road surface conditions, and weather. And because it’s capable of remembering things about the driver, Hyundai’s assistant will eventually start conversations with queries showing that it’s been paying attention: “It’s Monday at 8 a.m. Should I queue your usual podcast and navigate to the office?” The system will debut in 2026 as part of Hyundai’s “ Software-Defined Everything (SDx)” initiative, which aims to turn cars into constantly updating, AI-optimized platforms. Speaking In March at the inaugural Pleos 25 —Hyundai’s software-defined vehicle developer conference in Seoul— Chang Song , head of Hyundai Motor and Kia’s Advanced Vehicle Platform R&D Division , laid out an ambitious plan. “Our ultimate goal is to achieve cloud mobility, where all forms of mobility are connected through software in the cloud, and continuously evolve over time.” In this vision, Hyundai’s Pleos software-defined vehicle technology platform will create “a connected mobility experience expanding from a vehicle to fleets, hardware to software, and ultimately to the entire mobility infrastructure and cities.” Tesla: Grok arrives—but not behind the wheel On 10 July, Elon Musk announced via the X social media platform that Tesla would soon begin equipping its vehicles with its Grok AI assistant in Software Update 2025.26. Deployment began 12 July across Models S , 3 , X , Y , and Cybertruck —with Hardware 3.0+ and AMD’s Ryzen infotainment system-on-a-chip technology. Grok handles news, and weather—but it doesn’t control any driving functions. Unlike competitors, Tesla hasn’t committed to voice-based semi-autonomous operation. Voice queries are processed through xAI’s servers, and while Grok has potential as a copilot, Tesla has not released any specific goals or timelines in that direction. The company did not respond to requests for comment about whether Grok will ever assist with autonomy or driver transitions. Toyota: quietly practical with AI Toyota is taking a more pragmatic approach, aligning AI use with its core values of safety and reliability. In 2016, Toyota began developing Safety Connect , a cloud-based telematics system that detects collisions and automatically contacts emergency services—even if the driver is unresponsive. Its Hey Toyota and Hey Lexus AI assistants, launched in 2021, handle basic in-car commands (climate control, opening windows, and radio tuning) like other systems, but their standout features include minor collision detection and predictive maintenance alerts. Hey Toyota may not plan scenic routes with Chick-fil-A stops, but it will warn a driver when brakes need servicing or it’s about time for an oil change. UX concepts are validated in Hyundai’s Simulation Room. Hyundai Caution ahead, but the future is an open conversation While promising, AI-driven interfaces carry risks. A U.S. automotive-safety nonprofit told IEEE Spectrum that natural voice systems might reduce distraction compared with menu-based interfaces, but they can still impose “moderate cognitive load.” Drivers could mistakenly assume the car can handle more than it’s designed to unsupervised. IEEE Spectrum has covered earlier iterations of automotive AI —particularly in relation to vehicle autonomy , infotainment, and tech that monitors drivers to detect inattention or impairment. What’s new is the convergence of generative language models, real-time personalization, and vehicle system control—once distinct domains—into a seamless, spoken interface.",
    "published": "Thu, 07 Aug 2025 15:15:18 +0000",
    "author": "Willie D. Jones",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Walmart Will Test a Green-Hydrogen Fuel Cell Truck in Chile",
    "link": "https://spectrum.ieee.org/hydrogen-fuel-cell-walmart-chile",
    "summary": "UPDATE 16 SEPTEMBER, 2025: Walmart Chile says their testing trials for the fuel cell truck will begin in November, instead of September as originally planned. —IEEE Spectrum Original article from 6 August, 2025 follows: Latin America’s first green-hydrogen-powered fuel cell truck has hit the road in Chile, marking a milestone for the country’s decarbonization efforts . The semitrailer truck will begin a yearlong testing phase in September 2025, loading up at Walmart Chile’s Quilicura Distribution Center and carrying out operations and deliveries throughout the greater Santiago metropolitan area. Data collected from the testing phase will provide a road map for Walmart and its partners to scale up hydrogen fuel cell trucks across Chile. But as Walmart and the rest of the country work to meet their decarbonization goals over the next decade, the challenge lies in building the necessary infrastructure to support hydrogen-powered ground transport in a geographically challenging environment. Green-Hydrogen Infrastructure Challenges Though Chile’s abundant wind and solar resources make it a prime location for producing green hydrogen , the country has yet to develop the national network of technical operators and fueling stations it will need to overhaul ground transportation with fuel-cell trucks. Two years ago, Walmart Chile’s Quilicura Distribution Center became the first distribution plant in Latin America to produce green hydrogen and operate with hydrogen fuel cell vehicles. That US $15 million initiative involved swapping 200 lead-acid battery-powered forklifts for hydrogen fuel cell versions. Now, that distribution center has the capacity to produce enough green hydrogen to refuel the new truck twice daily, says Ignacio Gómez , Walmart Chile’s supply-chain innovation and technology manager. [Editor’s note: The author conducted an interview with Gómez in Spanish and has provided translations for this story.] The truck, manufactured by Feichi Technology , based in Foshan, China, was purchased as part of a $6.15 million public-private partnership called the Hidrohaul Technological Program . Hidrohaul launched in 2024 as a four-year project to advance hydrogen-powered fuel cell vehicles by bringing together key government and industry players. Chile’s Production Development Corporation put up $3.45 million in funding for the program. Globally, Walmart has committed to decarbonizing operations by 2040, with transportation as a major part of its sustainable distribution strategy, says Gómez. “Hidrohaul is taking the first steps of this strategy by letting us test the country’s first green-hydrogen truck under real-life conditions,” says Gómez. “It’s allowing us to gather lessons learned in order to subsequently scale up this technology .” The truck has an expected range of 750 kilometers and can pull 49 tonnes while holding 75 kilograms of hydrogen fuel. But “no truck is ever going to pull into the station empty,” says Lewis Fulton , the director of the Energy Futures Program of the Institute of Transportation Studies at the University of California, Davis. To be on the safe side, Fulton says long-haul truckers typically avoid dipping below a quarter tank’s worth of fuel. That puts the practical range for the Feichi truck at around 560 km. Chile spans more than 4,200 km north to south, and Walmart operates nearly 400 stores across the country under several subsidiaries. The remote southern region of Punta Arenas is home to the company’s southernmost store in the world and is located nearly 3,000 km from Quilicura, which is currently the truck’s only refueling source. Despite the company’s plans to expand green-hydrogen production to all of its soon-to-be nine distribution centers throughout the country, most of the network, including Punta Arenas, is still out of range. The calculus that determines where hydrogen refueling stations should go changes based on the number of trucks, the capacity of each refueling center, and how far the trucks regularly have to travel to deliver their payloads. In California, Fulton and his team of researchers determined that 15 to 20 refueling stations spread across the state would offer both the geographic coverage and quantity of hydrogen to handle 5,000 heavy-duty trucks. The state leads the United States in fuel cell vehicle deployment . From north to south, Chile is about four times as long as the state of California. Gómez says Walmart is considering installing at least four hydrogen-fuel dispensers at its distribution centers to provide sufficient fuel capacity. At least to start, the truck will remain in central Chile to carry out its test routes. “The plan is for the trucks to carry real merchandise loads from the Quilicura Distribution Center and supply stores within the Metropolitan, Valparaíso, and O’Higgins regions,” Gómez says. Global Deployment of Hydrogen Trucks Chile joins a handful of other countries who have deployed hydrogen fuel cell trucks for long-haul trucking, including the United States, China, South Korea, Japan, and several members of the European Union. China leads the pack in terms of hydrogen fuel cell vehicles, with a targeted 25,000 expected on the roads by the end of this year, according to the Chinese government. That figure is still a relatively small share of the total heavy-duty vehicles operating in the Chinese market. Globally, high costs have limited the deployment of green-hydrogen-powered fuel cell trucks at the industrial scale. While Chile may fare better on this front than the United States and other European countries, in part because of its relationship with China , the country’s mountainous and remote terrain poses a unique hurdle for truck performance. “Hills are a big thing,” says Timothy Lipman of the University of California, Berkeley, who works with Fulton on research related to the rollout of fuel cell trucks in California. “If the topography is totally flat, you’re going to get a longer range and need less fuel than if you’re going over really steep hills.” Extreme hot and cold weather can also impact a fuel-cell truck’s battery and reduce efficiency over time, Lipman says. Thus far, Chile has embraced local hydrogen power in its efforts to phase out sales of carbon-emitting heavy-duty vehicles by 2045 . Yet as the country invests more resources into scaling up its green hydrogen market, Fulton notes that other low emissions technologies, like electric batteries, may become less feasible. “You can only concentrate on so many technologies,” Fulton says. “So if a country or a state makes a strong commitment to one or two technologies, eventually, maybe it gets harder to think about other ones.” This article appears in the October 2025 print issue as “Walmart Tests Fuel Cell Truck in Chile.”",
    "published": "Wed, 06 Aug 2025 13:00:04 +0000",
    "author": "Julia Tilton",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "BMW Answers Sustainability Skeptics With “Neue Klasse” of EV",
    "link": "https://spectrum.ieee.org/bmw-ev-sustainable-suv",
    "summary": "While the Trump administration’s Environmental Protection Agency grabs headlines today, kneecapping electric cars and emissions rules , a different kind of bottom-line skeptical take shouldn’t be overlooked: Are electric vehicles, in fact, as sustainable as consumers think ? For BMW, a new EV model line to be announced this fall will answer that question with a Yes. For some companies, the initial carbon footprint of battery-and-EV manufacturing can be high , making it an uphill climb to achieve net-zero carbon emissions. However, BMW’s “Neue Klasse” (or “New Class”) models will offer not just sporty performance and competitiveness with China, but also a key milestone toward the automaker’s goal of net-zero corporate emissions by 2050 . BMW will officially unveil its first Neue Klasse model in early September—the compact iX3 SUV. It’s the first of multiple BMW models that will share a newly efficient, ultrafast-charging electric architecture. In Munich, where IEEE Spectrum attended a Neue Klasse media preview, the automaker rolled out its bold plans for sustainable EV production. BMW Re-envisions the EV Battery Let’s start with the pricey heart of any EV, its battery. BMW will ditch today’s prismatic cells for new “Gen6” cylindrical batteries . Developed entirely in-house, and built in a partnership with China’s CATL , the nickel-rich cells feature a 46-millimeter diameter and come in two heights, either 95 or 120 mm, for greater flexibility across different models. BMW’s cells boost energy density by 20 percent compared with its fifth-generation batteries. The new cells charge 30 percent faster, too. That means fewer battery cells and electricity are required to cover the same distance. Those cells are integrated directly into a pack with no surrounding modules, saving weight and space. That high-voltage battery then connects directly to the chassis as a structural component, bringing more mass reduction: The top of the battery case actually forms the floor of a Neue Klasse vehicle. BMW claims that 50 percent of these batteries’ lithium, nickel and cobalt will come from recycled materials, as automakers seek a more-circular battery economy and reduced reliance on freshly mined minerals . In production, BMW says its batteries’ overall carbon footprint drops by 42 percent. And the iX3 will reduce the car’s total carbon footprint by 34 percent versus its predecessor over a 200,000-kilometer (124,260-mile) life cycle, under a full “well-to-wheels” emissions analysis . How is that possible? For one, iX3 production kicks off late this year in a factory in Debrecen, Hungary , designed to operate on 100 percent renewable energy, including solar power generated on site. The automaker plans to build some Neue Klasse models in China as well, and eventually at its Spartanburg, S.C., factory, which is also BMW’s largest. BMW’s Hungary Plant Re-envisions the Sustainable Factory The new Hungary factory gives rise to the most slam-dunk benefit of all. Despite initially higher carbon dioxide inputs from manufacturing, BMW says its Neue Klasse SUV will reach its break-even point on carbon emissions with a comparable internal-combustion-engine model after less than a year for the typical owner—once their odometer crosses 21,500 km. That represents a 34 percent CO 2 reduction from its current-gen EVs. Meanwhile, if the car is charged on renewable electricity only, BMW says the break-even point drops to 17,500 km, just under 11,000 miles. Beyond its battery, roughly one-third of every Neue Klasse SUV will be made from recycled materials. Pampered BMW buyers will still be able to choose leather upholstery, but the iX3 will come standard with a vegan interior. A seat fabric called Econeer is made from 100 percent recycled PET bottles. Yarn for floor mats is sourced entirely from recycled materials, as are fabrics for the headliner that covers the cabin’s ceiling. Thermoplastics used in the storage “frunk” below the hood are made from 30 percent recycled fishing nets and other marine plastics, sourced from ports worldwide to reduce ocean pollution. A growing portion of metals are recycled as well. The BMW’s aluminum swivel bearings and hub carriers are 80 percent secondary raw materials. Wheel rims are cast from aluminum with 70 percent recycled content. As an outspoken proponent of the United Nations’ Paris Agreement on climate, BMW says it is on track to reduce its annual carbon footprint by at least 40 million tonnes by 2030. That would represent a 26 percent drop from a baseline of 150 million tonnes in 2019. And for a luxury, legacy automaker that might be tempted to recycle its greatest hits, BMW appears serious about reinventing itself: In 2024, one of every four BMW Group models around the world (including the Mini and Rolls-Royce brands) was electrified, including a 17 percent sales share for full EVs.",
    "published": "Mon, 04 Aug 2025 10:00:02 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Quantum Gravimeter Provides GPS Backup on Australian Ship",
    "link": "https://spectrum.ieee.org/quantum-gravity-sensor",
    "summary": "A novel quantum sensor that measures gravity changes by detecting variations in the travel time of falling atoms has been tested in a first of its kind experiment aboard an Australian naval ship. The sensor—a dual gravimeter —has been developed by Australian company Q-CTRL and could reach the market in late 2026. During the tests onboard the Royal Australian Navy’s aviation training vessel MV Sycamore , the device provided 144 hours without GPS access. According to Michael J. Biercuk, Q-CTRL CEO and founder, the test marked the first time such a sensor was used in a practical scenario aboard a moving vehicle. The Trouble With GPS Quantum gravimetry is among the plethora of technologies that are being developed to serve as a backup for global navigation satellite systems (GNSSs) such as the Global Positioning System (GPS). With the rise in conflict and geopolitical tensions all over the world, GNSS jamming and spoofing (confusing users with fake satellite signals) has become an everyday problem in many areas of the world. In early May, a 300-meter-long container ship ran aground in the Red Sea reportedly because of GPS interference. Analysts’ data revealed the ship’s GPS position following the incident appeared hundreds of miles away from its actual spot, somewhere in the Sahara Desert. The incident underscored the growing vulnerability of GPS, a service of the U.S. government, which is indispensable not only for the transport sector but also for many other industries including banking, power-grid synchronization, or offshore drilling. Maritime users all over the world have long been relying on inertial navigation systems as a backup for GPS, but these systems have their limitations. They depend on accelerometers and gyroscopes to track the speed and motion direction changes of a vehicle. Their reliability, however, decreases with the distance traveled as tiny errors accumulate causing an increasing gap between the reported and actual position. Quantum gravity sensors, Biercuk said, don’t suffer from this problem. The system deduces the strength of Earth’s gravity in every given point of the journey from the motion of the atoms illuminated by laser beams inside a vacuum chamber and compares that data with gravity maps compiled from satellite measurements. “This is not dissimilar from some of the new visual navigation systems that are emerging,” Biercuk said. “If you put a camera on a drone and you look at the ground, you can identify hills and valleys and buildings, and then do map matching. We’re doing the same thing, except the set of eyes that we’re using to see the Earth come from these quantum sensors.” The Quantum Solution Despite the planet’s relatively regular spheroid shape, the Earth’s gravitational pull is not uniform. It differs based on the distribution of mass inside the planet but also reflects features of the landscape such as hills and valleys and differences in density of the minerals underground. In addition to the superb accuracy, quantum gravity sensing is also unjammable and unspoofable. “You can’t spoof gravity without literally moving a mountain,” said Biercuk. The passive nature of the sensor, which doesn’t require any active signal emissions (unlike lidar- or radar-based systems) helps defense users avoid detection by the adversary. The prototype system tested off the Australian coast is about the size of a server rack, but Biercuk hopes Q-CTRL’s engineers will be able to further shrink it to about the size of a small fridge before taking it to the market next year. The development took about 14 months, he said, and challenged the team once they began experimenting with the sensor outside their labs. “These sensors are extraordinarily sensitive and when you take them from a pristine laboratory environment to anything less than pristine, the whole world conspires against you,” said Biercuk. “Mechanical vibrations, radio interference, and the movements of a vessel in all directions creates noise, which completely obscures the signal.” The Q-CTRL team solved the problem through a complex software solution that filters out the unwanted noise. Despite the promising performance, Biercuk doesn’t think that quantum gravimeters could ever completely replace satellite navigation for any kind of users. But in addition to areas suffering from GPS interference, the system could help ships navigating around polar regions where GPS is notoriously unreliable due to the geometry of the satellites’ orbits. “GPS is a very good technology when you can trust it,” said Biercuk. “But for the situations when you can’t or when it’s not available, you need a robust alternative.”",
    "published": "Tue, 29 Jul 2025 19:05:43 +0000",
    "author": "Tereza Pultarova",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Trinova Leans Into a Three-Wheel, Tilting Motorcycle",
    "link": "https://spectrum.ieee.org/three-wheel-motorcycle",
    "summary": "Life, says Markus Scholten , is not a car commercial: All weirdly empty streets and fantasy mountain adventures , drivers and passengers having a ball, often backed by a nostalgic boomer soundtrack . For Scholten, real life is what any Los Angeleno knows all too well: hours stuck in soul-crushing traffic, Monday through Friday, with only podcasts to allay the tedium. The Trinova is Scholten’s idea of sweet relief. It’s a powerful three-wheel motorcycle that automatically leans into corners for secure control, with an enclosed two-passenger cockpit. Because the Trinova is narrower than Harleys, Honda Gold Wings, or other sizable bikes , it could split lanes in California and other states where that’s legal, saving time and trimming emissions. Scholten figures that a commuter in Los Angeles, or a similarly gridlocked city, could save as many as 180 hours a year in time now wasted in traffic. The South Africa–born engineer and designer worked with Germany’s Karmann on convertible projects for Porsche, Mercedes-Benz, and others. After Fisker Automotive went belly-up in 2013, Scholten—who was leading chassis and convertible-top development for Fisker’s Karma Sunset S plug-in-hybrid—landed a job interview at Tesla’s design studio in Hawthorne, Calif. - YouTube Trinova Scholten was demoralized by the drive away from the Tesla studio but also inspired. “The return trip was a parking lot, all the way home,” and he cast envious looks at motorcycles zipping by between stationary cars on the clogged arteries of Highway 405. “I thought, ‘What’s wrong with this picture? I can ride my bicycle quicker than this,” he says. Scholten had been a budding professional bicycle racer, until a crash injury ended that dream. But even as a teenager, he had been fascinated by the Lean Machine, General Motors’ futuristic motorcycle from 1982. The audacious concept claimed 120-mile-per-gallon (2 liters-per-100-kilometer) fuel economy from a frugal, 185-cc Honda engine, connected to boat-trailer tires through a five-speed gearbox. Even in that benighted time, GM’s promo film for the Lean Machine identified a fundamental weakness of our transportation system: “Car after car, designed for four to six passengers, with only a driver” aboard. Scholten’s wife urged him to get to work building the motorcycle he’d been sketching for years. Three Wheels Can Be Better Than Four “The idea had always been in the back of my head,” Scholten says. That idea is to combine a motorcycle’s agility and efficiency, but in an all-weather package that’s safe and comfortable for people who wouldn’t be caught dead on two wheels. For the teardrop-shaped Trinova, an 85-centimeter width is a bit slimmer than that of traditional touring bikes. An initial prototype featured a 1,000-cc engine from a racy, Italian Aprilia RSV motorcycle. The company, based in Newport Beach, Calif., has since built three more prototypes at a shop in nearby Costa Mesa, powered by dual inboard electric motors from Zero Motorcycles. A roughly 10-to-12 kilowatt-hour battery should provide 160 to 220 kilometers (100 to 135 miles) of driving range. Leveraging Scholten’s experience with convertible cars, a folding or removable top lets in the sun and breeze. Three-wheelers have failed to make a noticeable dent in the marketplace, though models like the luridly styled Polaris Slingshot have a devoted niche of fans. Scholten believes there’s genuine demand, especially for three-wheelers with personality and performance. With a husky 65 kilowatts per motor (about 175 total horsepower—roughly the same as a Mazda Miata, but in a much smaller chassis) and an estimated weight below 340 kilograms (750 pounds), the Trinova is designed to make time and save time. Scholten says that emphasis on performance is what separates his Tilt-a-Whirl from econo-models like the U.K.’s Carver , whose general anemia and sluggish 80 km/h (50 mph) top speed proved a quick route to bankruptcy. The Trinova, Scholten projects, will have a 190 km/h (120 mph) top speed . “I don’t want the Trinova to look like a dorkmobile , another low-speed urban pipe dream,” he says. “I want it to be fast, to do doughnuts, to look cool. There’s no fun in a slow motorcycle.” A sensor monitors speed and steering angle to calculate the appropriate amount of lean in turns, at angles up to 55 degrees, which is roughly what a Moto GP racer might achieve in a tight turn. Instead of centrifugal force shoving passengers (or cargo, or beverages) to the outboard side—the disorienting feeling you get as a car rounds a sharp turn—that lean can be fun or even thrilling. “It’s a phenomenal feeling, so natural and intuitive,” Scholten says of the experience. “Leaning into turns is what humans do, whether you’re running, surfing, cycling, or riding.” Lidar Could Make Lane Splitting Safer As speeds and wheel inertia increase, the bike’s hydraulically activated lean angle changes accordingly, ensuring that the bike can’t tip over, whether at high speed or easing out of a parking space. Scholten’s current, open-source, software remains a bit slow, but “the bike still stays upright and does what I want it to do. Irrespective of any road surface, the bike stands vertically.” Prototypes adopt a steel-tube chassis, but production models would feature an aluminum space frame, with steel-reinforced doors and a roll cage, and a molded composite body. Scholten is in talks with a European supplier on a lidar unit that could measure gaps between vehicles and assure Trinova riders there’s room to safely pass between. With the right software and sensing, that system could monitor surrounding traffic and alert the rider if a car is about to veer into its path. Scholten sees further potential in a small, range-extender battery that users could “pull along like a Samsonite,” recharge at a home or office, and plug in to add extra miles. After a fallout with one partner, followed by a successful legal fight to reclaim his intellectual property from another potential investor, Scholten is looking to kick off production near the end of 2026, with an initial run of about 100 largely hand-built Trinovas. If the project gets off the ground, Scholten’s “crazy dream” is to take a Trinova to the legendary, notoriously dangerous Isle of Man TT motorcycle race in the United Kingdom and attempt to set a lap record for three-wheelers. At least no cars will get in his way.",
    "published": "Tue, 29 Jul 2025 14:01:02 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Mobile BESS Powers Remote Heavy Equipment",
    "link": "https://spectrum.ieee.org/mobile-bess",
    "summary": "In June, a fuel delivery to a Johns Hopkins Hospital campus went terribly awry, spilling 2,000 gallons of diesel into Baltimore’s harbor. As the Maryland capital raced to contain the mess, responders discovered a problem: They didn’t have access to reliable power at the waterfront site. Usually in these kinds of situations, responders bring in fossil-fuel generators. But city officials wanted to do better than burning more fuel while cleaning up diesel. So they tracked down Scott Calhoun , chief operating officer of Power Up Connect . The Baltimore-based company has begun to build mobile battery units that can store enough energy to back up an entire hospital or, in this case, energize a harbor cleanup crew. The company is one of several groups developing mobile battery systems to serve large electricity needs. Volvo builds such systems to charge its all-electric excavators, loaders, and other heavy construction equipment. Tesla has trucked in batteries to beef up the performance of its EV Supercharging stations during times of peak demand. The batteries are a mobile version of a battery energy storage system, or BESS. In the past, BESS has been used in stationary locations to store grid-scale electricity to help balance supply and demand, such as storing solar energy so that it can be used at night or storing backup power in case of outages. The improvements to both the chemistry and engineering of lithium-ion batteries has made it possible to move megawatt-level power on the back of a semi truck. The development opens the possibility to commercialize clean, large-scale electricity on the go for applications that previously relied solely on fossil-fuel generators. Why are Automakers Developing Mobile BESS? Power Up Connect got its start, in 2008, providing small power stations that allowed people at concerts or sporting events to recharge their phones. Later, customers began to ask for enough power to support applications like recharging power wheelchairs. Now, the company has scaled up to a trailer that can daisy-chain up to 10 lithium-ion batteries, each with a capacity of 90 kilowatt-hours—slightly bigger than the one that comes in an entry-level Lucid Air electric sedan. Volvo last year began offering all-electric heavy construction equipment such as loaders and excavators that can move earth with the same force as their fossil-fuel-powered competitors. This equipment needs to be charged, of course, and many clients will want to do that on the job site. So Volvo is building mobile BESS solutions to bring charging to the excavators. The know-how for Volvo’s mobile BESS stemmed from the building of its growing line of all-electric semi trucks, which use advanced battery chemistries to pack a remarkable amount of energy into a mobile battery pack, says Darren Tasker , a vice president at Volvo Penta, a division of the automaker that uses the company’s technologies for industrial applications. The improvements to the lithium-ion batteries are due in part to using a nickel cobalt aluminum oxide (NCA) version with aluminum as the cathode. This allowed them to build 90-kWh transportable batteries. According to Tasker, Volvo could easily fit two six-packs of these units onto the back of a semi truck, providing more than a megawatt of power wherever it might be needed. Those batteries can be driven away to a charging depot overnight where they can be recharged, and then brought back to the job site in the morning. After all, Tasker says, “The definition of a construction site is that it is under construction.” Volvo is looking into lithium iron phosphate (LFP) and lithium-sulfer (Li-S) batteries for future use, Tasker says. The Volvo PU500 BESS offers a capacity of 540 kWh and can charge up to 3 heavy-duty trucks or 20 cars daily. AB Volvo Can Mobile BESS Power Remote Industrial Work? This moveable feast of electricity could be useful in a wide range of industries. Forestry operations, for example, move from place to place, often in remote locations lacking power. Mining, too, could benefit enormously from electrification. Running fossil-fuel-powered trucks and equipment underground creates dangerous emissions that must be vented out of a mine. “The need to electrify underground mining machines is pretty strong,” says Tasker. “To have zero emissions underground is a great driver of new technology,” he says. But the power would need to be mobile. Mobile BESS is also an appealing solution for places that struggle to find the hundreds of thousands of dollars needed up front to install an electric charging station. Testing out electrification with trucked-in batteries is less risky than spending six figures to build permanent electrical infrastructure. Volvo has clients that are using mobile charging stations to support electric garbage trucks, forklifts and loaders at ports. As batteries get better and cheaper, consumer EV charging stations can go off grid. This month Tesla plunked down a battery and solar installation to power an off-grid Tesla Supercharger station, located off Interstate 5 in California. The station provides enough electricity for 80-plus EVs at a time. The challenge to mobile BESS makers is cost. Batteries aren’t cheap; Tasker says that in some cases, clients might be paying $1,000 per kilowatt-hour for mobile BESS power. That temporary solution is still cheaper than building a charging station, but the cost must come down for moveable batteries to make sense for more uses. After the diesel spill in Baltimore’s harbor, the city ultimately turned to trusty-but-dirty generators in an effort to get the spill under control quickly. But next time could be different. Baltimore is now in talks with Power Up Connect to use mobile batteries for future emergency response situations, Calhoun says.",
    "published": "Thu, 24 Jul 2025 16:00:03 +0000",
    "author": "Andrew Moseman",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Faster, Safer Cars Come Into Focus With New Optical Network Tech",
    "link": "https://spectrum.ieee.org/car-cameras-kd-automotive-vision",
    "summary": "Madrid-based fabless semiconductor company KD and Fremont, Calif.–based embedded camera maker Leopard Imaging have launched a significant upgrade to cameras for vehicle vision systems. It’s the first system for automotive applications with an Ethernet networking backbone to break the 10-gigabit-per-second transmission speed barrier. 10 Gb/s is 10,000 times as fast as the widely used 1-megabit-per-second Controller Area Network (CAN) protocol, marking a shift from legacy in-vehicle networks like CAN, the 20-kilobit-per-second Local Interconnect Network (LIN) protocol, and even 1-Gb/s Ethernet to a high-speed backbone capable of supporting autonomous systems, centralized computing, and next-gen infotainment—all at once and with low latency. Pablo Blázquez , KD’s business development manager, says the company’s technology—originally proven in data centers—now meets even stricter automotive standards for durability. Unlike data centers, which are air-conditioned rooms with few if any disturbances, vehicles (and any optical transceivers installed on them) must stand up to harsh conditions including high heat and bitter cold, unrelenting vibration, and physical wear and tear. Standards such as IEEE 802.3cz require a 15-year minimum lifetime for automotive optical transceivers, while those in data centers get swapped out every few years as part of regular maintenance protocols. Optical Fiber in Autonomous Vehicles As automakers push toward advanced driver assistance systems (ADAS) and fully autonomous driving , the volume of in-car data is skyrocketing. Cameras, sensors, and displays all generate massive data streams—and the cables connecting them must keep pace. By replacing heavy copper harnesses with optical fiber, the system eliminates electromagnetic interference , reduces weight, and supports automakers’ goals to cut emissions, lower costs, and boost safety. “I think the car of the future will be a moving data center equipped with a high-performance computer (HPC), numerous sensors, 6G radio systems, and an optical backbone network to connect them all,” says Hiroyuki Tsuda , an electrical and computer engineering professor at Keio University in Tokyo. “This will enable us to use our time in the car for business or entertainment while AI-enabled HPC systems do the driving for us,” adds Tsuda, whose research focuses include in-vehicle optical networks and photonic integrated circuits for long-haul optical networks. The “moving data center” analogy aptly describes KD’s tech. By making use of mature data-center technology like vertical-cavity surface-emitting lasers , or VCSELs, that transmit 980-nanometer wavelength light pulses, the transceiver meets demands for high efficiency, low noise, and low power. Crucially, it’s also future-proof: Automakers can reuse the same fiber and connectors when upgrading from 2.5 to 25, 50, or even 100 Gb/s—simply by swapping out transceivers and peripherals. Blázquez notes that KD chose 980-nm lasers over 650-nm ones in part because the suitable light sources for 650-nm lasers are not yet as widely available as the more established 980- and 850-nm VCSELs which dominate optical data communication and sensing. Though 650-nm VCSELs have lower signal attenuation than 850-nm versions, they don’t outperform the 980-nm lasers KD uses. What’s more, 980-nm lasers are far less susceptible to power dissipation, mechanical stress, and degraded performance at high and low temperatures than their 850-nm counterparts. According to Blázquez, automaker interest in its optical-fiber-backbone solution is already high, particularly in Asia and Europe, with prequalification and pilot projects underway. KD’s optical data transceiver, he says, could show up in premium vehicles within two to three model years, with broader adoption likely to follow. “I think the car of the future will be a moving data center equipped with a high-performance computer, numerous sensors, 6G radio systems, and an optical backbone network to connect them all.” –Hiroyuki Tsuda, Keio University Smoothing the way for rapid adoption is the fact that optical networks also solve persistent design headaches. Because optical fiber is impervious to electromagnetic interference, automakers are free to route cables through tight spaces. And cable lengths up to 40 meters rocketing data from sensors to processors to actuators at 10 Gb/s make optical harnesses ideal for large commercial vehicles that need high-resolution 360-degree camera systems . High-Performance Automotive Cameras KD chose to partner with Leopard Imaging for the system’s cameras because of the company’s reputation for compact, high-performance automotive cameras , says Blázquez. “We wanted to prove our optical transceiver could deliver on standards like IEEE 802.3cz when paired with a tiny optical sensor.” The LI-VENUS-ISX031 camera, with its high-resolution and wide-angle imaging, is smaller than 20 millimeters on a side—minuscule enough for side mirrors or other spots where aerodynamic drag must be minimized. There’s also a safety element. “Lower latency and higher bandwidth mean your car’s sensors react faster and more reliably—and that means people are safer,” Blázquez says. In the relentless push toward self-driving cars, this is an invisible upgrade with unmistakable payoffs: cleaner design, faster data, and lives saved. This article appears in the September 2025 print issue as “ New Optical Networks Drive Speedier, Safer Cars .”",
    "published": "Mon, 21 Jul 2025 16:00:03 +0000",
    "author": "Willie D. Jones",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Chinese Robotaxis Are Gunning for Global Domination",
    "link": "https://spectrum.ieee.org/tesla-robotaxi-chinese-competitors",
    "summary": "This post originally appeared on Recode China AI . When Tesla rolled out its much-anticipated pilot robotaxi service in Austin, Texas, last month—a fleet of 10 to 20 Model Y SUVs with “robotaxi” stickers and minor modifications —the tech and automotive worlds paused in awe. But thousands of miles away, executives at China’s leading autonomous driving firms didn’t flinch. “Tesla isn’t even sitting at the [robotaxi] table yet,” Lou Tiancheng, CTO of Chinese autonomous vehicle company Pony.ai , remarked during an interview in May. Last year, Wang Yunpeng, head of the autonomous driving unit at Baidu, China’s search engine and AI giant, claimed Tesla was at least three to five years behind . The measure of robotaxi success isn’t flashy demos or tech-day reveals—it’s large-scale, commercial, fully autonomous public service. By that standard, Tesla remains far behind. Globally, only Alphabet’s Waymo and a handful of Chinese firms have overcome this barrier. Comparing robotaxi operations: Waymo leads in the United States; Baidu dominates in China. Recode China AI While Waymo pioneered the robotaxi, nearly every other company providing regular public road service is Chinese. It mirrors the global electric vehicle market where, aside from Tesla, Chinese carmakers like BYD dominate the top ranks. China’s Robotaxi Trio: Baidu, Pony.ai, WeRide At the center of this push is Baidu, often considered the West Point of China’s autonomous vehicle (AV) industry. Its alumni populate almost the entire autonomous driving supply chain in China, from chips to software development to robotaxis. When Baidu began self-driving research in 2013, it envisioned becoming the Android of AV—a software ecosystem provider to automakers worldwide. But China’s fiercely competitive automotive landscape quashed this ambition. Top Chinese electric automakers, such as Li Auto and XPeng, opted to develop their own advanced driver-assistance systems (ADAS), while lower-tier companies turned to telecom giant Huawei or drone maker DJI. Baidu’s own electric vehicle venture, Jidu, folded last year. Yet despite these setbacks, Baidu’s robotaxi service, Apollo Go (known affectionately in China as “Luobo Kuaipao” or Carrot Runs Fast), is flourishing. In 2022, it became China’s first fully driverless commercial robotaxi operator—a milestone for the industry. Today, Apollo Go operates a fleet of 1,000 robotaxis across 15 cities, from Beijing to Shenzhen, providing 1.4 million rides in the first quarter of 2025 alone. Baidu’s largest operations hub is Wuhan , a megacity in central China with more than 13 million people, strategically chosen for its supportive regulatory environment and its status as China’s automotive heartland. Baidu’s sixth-generation robotaxi is a sleek vehicle with covered steering wheels and rear sliding doors. Still, 1,000 cars are modest compared to China’s vast traditional taxi market and enormous ride-hailing fleets. Hot on Baidu’s heels are Pony.ai and WeRide , which were founded by former Baidu executives in 2016 and 2017, respectively. Both began in Silicon Valley and moved back to Guangzhou. Both went public on NASDAQ nearly simultaneously in 2024. With backing from Toyota, Pony.ai is aiming to produce 1,000 of its robotaxis this year. Pony.ai Pony.ai, backed by Toyota and co-founded by ex-Baidu executive James Peng and coding prodigy Tiancheng Lou, operates 270 robotaxis. By year end, they aim to scale production to 1,000 of their seventh-generation robotaxis, co-developed with Toyota and two local Chinese automakers. Pony.ai has not disclosed its robotaxi order numbers but claims an impressive 1-to-20 ratio of remote safety operators to vehicles and says its operational footprint is roughly 20 times the size of Waymo’s service area in San Francisco. Since its NASDAQ debut, Pony.ai has attracted significant attention, including a partnership with Uber and rumored discussions involving Uber’s controversial founder, Travis Kalanick, who was supposedly interested in acquiring the company’s U.S. operations . WeRide, another company founded by Baidu’s veterans, overcame early turmoil when its co-founder, former Baidu executive Wang Jing, stepped down amid a lawsuit alleging trade-secret misappropriation. CTO Tony Han stepped in, steering WeRide to success with a 500-robotaxi fleet and diversified offerings including robo-buses and autonomous street sweepers. WeRide also collaborates with Bosch, the German technology giant and WeRide’s major investor, on ADAS development, though major commercial clients remain elusive. WeRide launched the Middle East’s first robotaxi service in Abu Dhabi this year. WeRide Now these firms are turning outward, eyeing overseas expansion in Southeast Asia, Europe, and the Middle East—racing to claim global robotaxi territory ahead of American competitors. Early this year, Baidu expanded into Dubai and Abu Dhabi after securing road‑test permits and reportedly plans to enter Singapore, Malaysia , and Switzerland . Pony.ai signed an agreement with Dubai ’s transit authority, aiming for fully driverless operations by 2026 and maintains test operations in South Korea and Luxembourg. WeRide partnered with Uber for pilot operations in Abu Dhabi , becoming the Middle East’s first fully driverless robotaxi service and plans expansion into 15 more cities globally over the next five years. Cost Advantages and Complex Roads Technologically, Chinese robotaxi firms have largely used Waymo’s playbook in hardware—combining lidar, radar, cameras, precision GPS, and high-definition maps. Their advantage is cost. Thanks to China’s manufacturing prowess, these companies could quickly scale fleets when ready. For example, Baidu brought robotaxi production costs down to just US $28,000 per vehicle—a fraction of Waymo’s hundreds-of-thousands-per-vehicle expense, on par with Tesla’s forthcoming CyberCab . Pony.ai, meanwhile, boasted a 68 percent drop in lidar costs and an 80 percent reduction in computing costs with the launch of its seventh-generation robotaxi. Tesla launched its robotaxi service in Austin, Texas, with a handful of vehicles in limited areas of the city. Tim Goessman/Bloomberg/Getty Images Their software is a combination of AI models and rule-based code, designed to interpret traffic patterns, predict behaviors, and execute driving decisions. All three Chinese robotaxi firms now boast “end-to-end” systems—a term popularized by Tesla that refers to AI models capable of processing raw sensor data and directly outputting driving actions. Unlike Waymo’s early suburban testing in Phoenix, Chinese robotaxis are trained in the dense, chaotic streets of Beijing and Guangzhou, where roads are often packed with motorbikes, bicycles, and street vendors. The ability to operate in such conditions could arguably make their systems more adaptable. Regulatory Hurdles and Chip Reliance Yet challenges persist, mostly regulatory hurdles. Neither China nor the United States has enacted nationwide laws governing robotaxis, leaving the regulation to states and cities. As a result, the industry operates under a fragmented patchwork of local-level policies, with each jurisdiction setting its own rules and requirements. Unlike some U.S. states, which are quicker with permits but stringent on ongoing safety monitoring, Chinese cities initially demand rigorous testing before granting permits. Almost all Chinese cities that allow robotaxis only permit their operation within geofenced zones, often in suburban districts away from dense downtown areas. In contrast, Waymo’s service is allowed to cover large parts of San Francisco , including downtown. Interestingly, Chinese AV companies have leveraged Waymo’s progress to spur government support at home. When Waymo’s ride volume surged last year, Chinese firms intensified their lobbying efforts, urging regulators for more expansive operating permissions. Waymo operates more than 1,500 robotaxis in the metropolitan areas of four U.S. cities. Craig F. Walker/The Boston Globe/Getty Images Social issues also loom large. Apollo Go’s expansion in Wuhan last year sparked protests from local taxi drivers who feared for their livelihoods. In response, the Wuhan Transportation Bureau clarified that Apollo Go operates only 400 robotaxis in the city. Baidu CEO Robin Li acknowledged the concerns, emphasizing that scaling robotaxi operations will be a gradual process that may take many years . Profitability is another challenge for all robotaxi firms. Despite growing ride volumes and improving hardware economics, none of the players have yet reached break-even. Most services remain heavily subsidized, especially during pilot phases. Pony.ai has set the goal of turning profitable by 2029. Another strategic dependency is chips. Most Chinese robotaxi fleets are currently powered by Nvidia chips, particularly the widely used Orin system-on-chip . These chips handle the bulk of sensor fusion, perception, and path-planning workloads. The reliance on a U.S. supplier poses geopolitical and supply chain risks. Recent export restrictions and rising tensions between the United States and China have prompted some Chinese firms to explore domestic alternatives , but so far, no local chipmaker has matched Nvidia’s AV computing capabilities. Tesla’s Uphill Climb Where does this leave Tesla? Elon Musk’s vision-only approach to robotaxis is impressive, but the leap to true Level 4 or 5 autonomy—vehicles that drive entirely on their own in any conditions—remains dauntingly high. Tesla’s modest Austin pilot reveals that the company will need the same careful geographic expansion and safety monitoring that Waymo and Baidu employed years earlier. While Tesla’s production scale could eventually dwarf Waymo and Chinese players, the ultimate winners will ultimately be determined by safety, operational excellence, passenger trust, and regulatory navigation. Tesla must brace for fierce global competition from Chinese robotaxi firms already establishing footholds worldwide. Just as Tesla once found itself surrounded by Chinese electric vehicle rivals, robotaxis could be next.",
    "published": "Tue, 15 Jul 2025 15:00:03 +0000",
    "author": "Tony Peng",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "AI Cameras  Change Driver Behavior at Intersections",
    "link": "https://spectrum.ieee.org/ai-intersection-monitoring",
    "summary": "In cities across the United States, an ambitious goal is gaining traction: Vision Zero , the strategy to eliminate all traffic fatalities and severe injuries. First implemented in Sweden in the 1990s, Vision Zero has already cut road deaths there by 50 percent from 2010 levels. Now, technology companies like Stop for Kids and Obvio.ai are trying to bring the results seen in Europe to U.S. streets with AI-powered camera systems designed to keep drivers honest, even when police aren’t around. Local governments are turning to AI-powered cameras to monitor intersections and catch drivers who see stop signs as mere suggestions. The stakes are high: About half of all car accidents happen at intersections, and too many end in tragedy. By automating enforcement of rules against rolling stops, speeding, and failure to yield, these systems aim to change driver behavior for good. The carrot is safer roads and lower insurance rates; the stick is citations for those who break the law. The Origins of Stop for Kids Stop for Kids, based in Great Neck, N.Y., is one company leading the charge in residential areas and school zones. Cofounder and CEO Kamran Barelli was driven by personal tragedy: In 2018, his wife and three-year-old son were struck by an inattentive driver while crossing the street. “The impact launched them nearly 18 meters down the street, where they landed hard on the asphalt pavement,” Barelli says. Both survived, but the experience left him determined to find a solution. He and his neighbors pressed the municipality to put up radar speed signs. But they turned out to be counterproductive. “Teenagers would race to see who could trigger the highest number,” Barelli says. “And extra police only worked until drivers texted each other to watch out.” So Barelli and his brother, longtime software entrepreneurs, pivoted their tech business to develop an AI-enabled camera system that never takes a day off and can see in the dark. Installed at intersections, the cameras detect vehicles that fail to come to a full stop; then the system automatically issues citations. It uses AI to draw digital “bounding boxes” around vehicles to track their behavior without looking at faces or activities inside a car. If a driver stops properly, any footage is deleted immediately. Videos of violations, on the other hand, are stored securely and linked with DMV records to issue tickets to vehicle owners. The local municipality determines the amount of the fine. Stop for Kids has already seen promising results. In a 2022 pilot of the tech in the Long Island town of Saddle Rock, N.Y., compliance with stop signs jumped from just 3 percent to 84 percent within 90 days of installing the cameras. Today, that figure stands at 94 percent, says Barelli. “The remaining 6 percent of noncompliance comes overwhelmingly from visitors to the area who aren’t aware that the cameras are in place.” Since then, the company has installed its camera systems in municipalities in New York and Florida, with a few cities in California up next . In a Stop for Kids pilot project, cameras installed at intersections drastically improved drivers’ compliance with stop signs over three months. Stop for Kids Still, some experts say they’ll wait to pass judgment on the technology’s efficacy. “Those results are impressive,” says Daniel Schwarz , a senior privacy and technology strategist at the New York Civil Liberties Union (NYCLU). “But these marketing claims are rarely backed up by independent studies that validate what these AI technologies can really do.” Privacy Issues in Automated Ticketing Systems Privacy is a big concern for communities considering camera enforcement. In the Stop for Kids system, faces inside vehicles and in the rest of the scene are automatically blurred. Identifying images come only from an AI license-plate reader . No personal DMV data is shared except with local authorities handling citations. The company has created an online evidence portal that allows vehicle owners to review footage and dispute tickets, helping ensure the system remains fair and transparent. Watchdog groups are not convinced that this type of technology won’t be subject to mission creep. They say that gear originally introduced to help reach the sympathetic goal of lowering traffic deaths may be updated to do things outside of that scope. “Ex panding the overall goal of such a deployment is as simple as software push,” says NYCLU’s Schwarz. “More functionalities could be introduced, additional features that raise more civil-liberties concerns or present other dangers that perhaps the prior version did not.” Obvio.ai’s Approach Meanwhile, in San Carlos, Calif., another startup is taking a similar approach with its own twist. Founded in 2023, Obvio.ai has designed a solar-powered, AI-enabled camera system that mounts on utility poles and street lamps near intersections. Like Stop for Kids, Obvio’s system detects rolling stops, illegal turns, and failures to yield. But instead of automating the entire setup, local governments review potential infractions before any citations are issued, ensuring a human is always in the loop. Obvio.ai cofounder and president Dhruv Maheshwari says the company’s cameras run on solar power and connect to its cloud server via 5G, making them easy to deploy without major construction. Obvio’s AI processor, installed on-site with the camera, uses computer vision models to identify cars, bicycles, and pedestrians in real time. The system continuously streams footage but only stores clips when a violation is likely. Everything else is automatically deleted within hours to protect privacy. And, as with Stop for Kids’ tech, the cameras do not use facial recognition to identify drivers—just the vehicle’s license plate. Last summer, Obvio.ai partnered with Maryland’s Prince George’s County for a pilot program across towns like Colmar Manor, Morningside, Bowie, and College Park. Within weeks, stop-sign violations were cut in half. In Bowie, local leaders avoided concerns about the camera system rollout being a “ticketing for profit” scheme by sending warning letters instead of fines during the trial period. Vision Zero Is the Target Though both Stop for Kids and Obvio.ai declined to offer any specifics about where their cameras will appear next, Barelli told IEEE Spectrum that about 60 towns on Long Island, near the place where it conducted its pilot, are interested. “They asked the state legislature to provide a clear framework governing what they can do with systems like ours,” Barelli says. “Right now, it’s being considered by the state senate.” “Ultimately, we hope our technology becomes obsolete,” says Maheshwari. “We want drivers to do the right thing, every time. If that means we don’t issue any tickets, that means zero revenue but complete success.”",
    "published": "Sat, 05 Jul 2025 13:00:02 +0000",
    "author": "Willie D. Jones",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "GM’s Home-Grown LMR Battery  Opens New Front in EV Competition",
    "link": "https://spectrum.ieee.org/general-motors-lmr-battery",
    "summary": "Lithium iron phosphate (LFP) batteries were a made-in-America innovation, but China ended up cornering the market on what became the world’s leading solution in low-cost EV batteries . Now, following a decade of development, General Motors has announced a battery breakthrough that might help American manufacturers reclaim some high ground: LMR, or lithium manganese-rich batteries. Kushal Narayanaswamy , GM director of advanced battery-cell engineering, says the company’s LMR batteries can deliver 33 percent higher energy density than China’s best LFP cells, at comparable production costs. That potentially opens the door to the more-affordable EVs that consumers want, without unduly sacrificing driving range. “We’ve decided to industrialize this technology for our full-size trucks and SUVs” beginning in 2028, Narayanaswamy says. That plan could make GM the world’s first automaker to deploy LMR batteries in an EV. GM has built a growing EV business via its conventional nickel-rich Ultium batteries —enough to pass Tesla as the largest U.S. producer of battery cells. Those pouch-style Ultium cells, built with partner LG Energy Solution in huge factories in Ohio and Tennessee, deliver up to 792 kilometers (492 miles) of range in GM’s Chevrolet Silverado. That range, verified by the U.S. Environmental Protection Agency , is tops among any full-size electric pickup truck. High Battery Costs Drive Skyrocketing Car Prices But aside from a basic work-oriented version, that Silverado starts at around US $75,000, and tops $90,000 for lavish versions. The Cadillac Escalade IQ I recently tested in metro Detroit—essentially a luxury condo on wheels—is another long-ranger, stretching past 740 km (460 miles) on a charge. Caddy’s three-row SUV is also expensive, starting at nearly $130,000. Those prices trace directly to high costs for cobalt and nickel in today’s most energy-dense cells. Such burdensome costs helped spark an LFP revolution, which jump-started the explosive growth of EVs in China, including budget models with limited range. Ford is racing to build a controversial LFP plant in rural Michigan, and Stellantis is doing the same in Spain, with both automakers licensing LFP technology from China’s CATL . LFP batteries replace pricey cobalt and nickel with plentiful, inexpensive iron and phosphate, and they are notably safe and durable. The trade-off for all that is mediocre energy density. For example, the latest “Blade” LFP battery from Chinese automaker BYD delivers just 350 watt-hours or so per liter of volume, versus more than 600 watt-hours per liter for GM’s Ultium batteries , or Tesla’s 4680 cells. GM has found a middle ground with manganese, a transition metal that could help automakers blunt China’s current near-monopoly on LFP production. “Manganese is dirt cheap, so at a raw materials level, it gives you that benefit to start with,” Narayanaswamy says. Compared with Ultium cells—whose chemical composition is roughly 85 percent nickel, 10 percent manganese and 5 percent cobalt—the LMR cells contain about 65 percent manganese, 35 percent nickel, and only trace amounts of cobalt. And for GM, LMR is a home-grown technology: the Wallace Battery Cell Innovation Center , located at GM’s Eero Saarinen–designed tech campus in suburban Detroit, has become a linchpin of development. The result is a battery that should cut costs without throttling range, delivering more than 650 km of range in a full-size electric truck or SUV. That’s enough to satisfy road-tripping consumers or owners who haul heavy payloads. One GM executive estimated an LMR pack could cost $6,000 less to produce than today’s batteries. A full-size lithium manganese-rich battery cell is about the size of a coffee-table book. Steve Fecht/General Motors The manganese-rich cathode chemistry also lends itself to large-format rectangular cells that make for efficient packaging in larger trucks and SUVs. For prismatic cells roughly the size of a coffee-table book, a higher percentage of active battery material can reduce the number of components in individual battery modules by 75 percent, and total pack components by 50 percent, while still providing the necessary structural rigidity. For example, a Silverado EV or Escalade IQ could replace their double-stacked pack of 24 NCMA (nickel, cobalt, manganese, aluminum) modules with just six LMR modules. More active battery material would partially offset a reduced energy density versus high-nickel cells. And that would translate to more miles-per-dollar for buyers. By the end of last year, Narayanaswamy says, the Wallace Center had produced about one ton of LMR cathode material, allowing it to build 300 prototype cells in 18 varieties. Those cells were tested to the equivalent of 1.4 million miles of real-world EV driving, including vibration testing and extreme swings in ambient temperatures. Being able to create production-feasible cells in-house meant that GM didn’t need to engage potential suppliers in advance, or waste time on back-and-forth validation and duplicated efforts. Vertical Integration Means Faster Development and Lower Costs That’s the kind of vertical integration that Chinese automakers such as BYD —which designs and builds its own cars, batteries, and chargers—have leveraged to speed new cars and batteries to market and build them at unbeatably low costs. Narayanaswamy says the Wallace Center’s goals include taking cell designs from the drawing board to production readiness in as little as 18 months. GM’s internal testing reassured engineers they had overcome longstanding barriers to LMR cells, mainly unreliable lifespan and “voltage attenuation,” with cells losing excessive voltage over time. GM cites proprietary dopants and coatings, particle engineering, and process innovations, all aiming to balance energy-density requirements with cell stability. For coatings, “it could be aluminum or tungsten or boron that helps prevent the contact of manganese with the electrolyte itself,” he says. Narayanaswamy is confident the LMR cells will match the lifespan of GM’s current NCMA batteries, which offer an eight-year, 100,000-mile warranty. Critically, GM can manufacture its prismatic LMR cells in existing battery plants, allowing domestic production without building new lines from scratch. “In fact, the processing steps for making LMR actually get reduced by a couple of steps,” he says. At the Wallace Center, GM continues to work on a range of potential battery solutions, including silicon anodes, lithium-metal, sodium-ion, and in the longer-term, solid state. LFP remains part of its technology road map as well. The automaker plans to open another Detroit-area lab by 2027, the Battery Cell Development Center, that can build and test complete battery packs before they enter production—no matter what kind of chemistry ends up inside.",
    "published": "Tue, 01 Jul 2025 18:58:04 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Superconducting Motor Could Propel Electric Aircraft",
    "link": "https://spectrum.ieee.org/electric-aircraft-motor-hinetics",
    "summary": "Of the countless technologies invented over the past half century, high-temperature superconductors are among the most promising and yet also the most frustrating. Decades of research has yielded an assortment of materials that superconduct at temperatures as high as -140 °C (133 kelvins) at ambient pressure. And yet commercial applications have been elusive. Now, though, a couple of developments could finally push high-temperature superconductors into commercial use. One is the availability, at relatively moderate cost, of copper-oxide-based superconducting tape, which is being produced by a few companies for startups working on tokamak fusion reactors . The reactors use the superconducting tape, which is typically made of yttrium barium copper oxide, in powerful electromagnets. The other development involves a different group of startups that are using the tape to build electric motors with very high power-to-weight ratios, mainly for use in electric aircraft. Among that latter group of startups is Hinetics , formed in 2017 to commercialize research led by Kiruba Haran at the University of Illinois Urbana-Champaign. This past April, the company tested a prototype motor outfitted with superconducting rotor magnets. According to Haran, the tests, which included spinning a propeller in a laboratory setup, validated key components of the company’s designs for superconducting motors that will operate at power levels of 5 and 10 megawatts. Such levels would be high enough to power a regional passenger airliner with multiple motors. The work was funded in part by a grant from the Advanced Research Projects Agency–Energy (ARPA-E). “HTS [high temperature superconductors] are having a moment, because the costs are coming down rapidly, driven by all the work on fusion,” Haran says. “A lot of people are ramping up production, and new startups, and new capabilities, are coming into the market.” Hinetics is one of perhaps a dozen companies, large and small, trying to use high-temperature superconductors to build extremely efficient motors with very high power density. These include aerospace giant Airbus, which is working on a superconducting airliner under a program called ZEROe , as well as Toshiba, Raytheon, and U.K. startup HyFlux . However, Hinetics is taking an unusual approach. Common approaches to building a superconducting machine use the superconducting material for either the rotor or stator coils, or both. Typically, the coils are cooled with a liquid or gas kept at a sufficiently low temperature by an external cryocooling system. The fluid cools the superconducting coils by convection, by physically flowing through heat exchangers in contact with the coils and carrying away heat as it does so. The system has been used successfully in some experimental motors and generators, but it suffers from several fundamental problems. A big one is the need to circulate the cooling fluid through the rotor coils, which are embedded in a rotor assembly that is spinning at perhaps thousands of revolutions per minute. Another problem is that this approach requires a complicated cryocooling system that includes pumps, seals, gaskets, pipes, insulation, a rotary coupling that transfers the cryogen into and out of the rotor, and other components that can fail and that add considerable weight. The rotor coils in an experimental Hinetics electric motor are made of a high-temperature superconductor. They are cooled by a cryocooler that runs axially down the center of the motor. The rotor assembly and the cryocooler are enclosed within a vacuum vessel. Hinetics Hinetics’s Revolutionary Idea: Spin the Cryocooler Hinetics’s system, on the other hand, uses a self-contained cryocooler that is small enough to be attached to the rotor, and which spins along with it, eliminating the need to pass fluids into and out of a spinning vessel. With this arrangement, “you don’t have to immerse the superconductor into the fluid,” notes Laurent Pilon, an associate director for technology at ARPA-E. Instead, “there’s a cryocooler, and a cold connection, and you pull out the heat from the superconducting magnetic coils to the cryocooler, performing a refrigeration cycle. The beauty here is that it simplifies everything because now you just have the cryocooler that spins with the shaft.” In this configuration, the rotor assembly, including the coils, is cooled by conduction rather than convection. The rotor is installed within a vacuum chamber. Heat from the superconducting magnet assembly is transferred through a “thermal bus,” which is basically just a disk-shaped copper structure that conducts the heat to the cryocooler, which is attached to the other side of the copper disk. One of the challenges, Haran says, was finding a cryocooler small and light enough to spin at high rates and keep functioning while doing so. For its proof-of-concept unit, the Hinetics team used an off-the-shelf Stirling-cycle cooler from Sunpower . It can remove only 10 watts of heat from the rotor assembly but, in this configuration, that’s all that’s needed to keep the rotor coils superconducting, Haran says. One potential drawback of the system is that, because of this relatively low heat-removal capacity, the cryocooler takes a few hours to cool the superconducting magnet sufficiently to start operating. Future versions will reduce the period needed, according to Haran. And on the bright side, the low heat-removal rate means high efficiency, because the cooler has just enough power to maintain the low temperatures needed during operation, and not much excess capacity. To provide electric power to the spinning cryostat and rotor magnets the prototype used a slip ring. But future versions of the motor will use a wireless system, possibly based on inductive coupling, Haran says. Tests of Hinetics’s superconducting motor this past April validated the basic design and cleared the way for construction of more powerful units. Hinetics Applications on Ships Are Also Possible He opted not to make the stators superconducting, because in a typical configuration the stator is energized by an alternating-current (AC) waveform. Superconductors are only completely lossless for direct current. So the application of AC to superconducting coils in the stator would result in power losses that would require another cooling system to remove heat from the stator. Haran figures it’s not necessary. With superconductors just in the rotor coils, the motor will achieve efficiencies in the range of 98 to 99.5 percent, which is about four or five percentage points higher than what is realistically possible with a permanent-magnet synchronous motor. Haran also insists that the superconducting design would attain this high efficiency without any reduction in power density, a combination that’s hard to achieve in a conventional motor. Four or five percentage points might not seem like a lot, but it would matter in typical aviation applications, Pilon says, especially when coupled with higher power density. On its website, Hinetics claims that its motor has a continuous specific power of 10 kilowatts per kilogram , which would put the machine among the most power-dense units available, on a continuous-power basis. According to Haran, the next generation of the superconducting motor will achieve 40 kW/kg, which would be far higher than anything commercially available. Although aviation is the initial target, Haran sees potential applications in ship propulsion, where the motor’s high volumetric power density would be a draw. “What’s really exciting is that we are seeing a transformational new technology become practical,” he says. “Once you get to megawatts and low speed, anywhere you need high torque, this could be very interesting.”",
    "published": "Thu, 26 Jun 2025 12:00:03 +0000",
    "author": "Glenn Zorpette",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Why Pilots Will Matter in the Age of Autonomous Planes",
    "link": "https://spectrum.ieee.org/autonomous-planes-certification",
    "summary": "In August 2001, an anonymous guest posted on the forum at Airliners.net, a popular aviation website. “How Long Will Pilots Be Needed?” they wondered, observing that “20 years or so down the road” technology could be so advanced that planes would fly themselves. “So would it really be useful for a person to go to college now and be an airline pilot if a few years down the road they will be phased out by technology?” Twenty-four years later, the basic technology required to make aircraft fly themselves exists, as evidenced by the fact that most commercial flights are flown largely on autopilot. Yet, the fundamental model of flying commercial aircraft hasn’t really changed. Passengers are still flown on large jetliners by two or more highly trained human pilots functioning as a team. The main reason why airlines are still decades away from pilotless planes boils down to the strict regulatory framework for aviation. At the heart of this regulation is certification—the process by which governmental authorities determine that an aircraft design is safe for flight. Even for conventional aircraft based on proven technologies, taking a concept from design through certification can require hundreds of millions of dollars and the better part of a decade. Tack on any novel technologies, such as the autonomy necessary to remove the pilot from the cockpit, and that process just gets longer and more expensive, with no guarantee of success. Nevertheless, and despite the daunting odds against them, a new generation of startups is making a run at certifying autonomous passenger and cargo aircraft, in the process laying the groundwork for the next chapter of aviation. Instead of airliners, these companies are starting with small aircraft: electric air taxis and single-engine planes that typically seat fewer than a dozen people. Not only are the associated capital costs more manageable on a startup’s budget, there’s also a persuasive safety case to be made: Small aircraft are still prone to the types of accidents that have been largely eliminated from commercial airline operations. According to statistics compiled by the Aircraft Owners and Pilots Association, around 300 people die each year in small plane and helicopter crashes in the United States alone. “Loss of control—mishandling the plane, usually as a result of disorientation or excessive workload—and controlled flight into terrain, [those] are the leading causes of accidents in small aircraft,” says Robert Rose , cofounder and CEO of Reliable Robotics , one of a few startups now working on retrofits that could enable Cessna Caravan planes to fly autonomously. A veteran of SpaceX and Tesla, Rose is adamant that “we, as a nation, possess the technology to prevent these accidents. If we can [autonomously] land a rocket on a small barge in the middle of the ocean, clearly we can find the centerline at an airport.” The economic case for autonomy in aviation While the safety argument for making small aircraft autonomous is a compelling one, the move is fundamentally rooted in economics. California-based Reliable Robotics and Massachusetts-based Merlin Labs are developing the commercial versions of their autonomous Caravans initially for the cargo feeder industry, which uses small airplanes to move packages to and from rural markets on behalf of carriers like FedEx and UPS. (Both companies also have military funding to develop autonomous aircraft.) Pilots for these feeder networks are typically flying alone, often at night and in bad weather, and their safety record is poor . This is a comparatively low-volume segment of the aviation industry, and there’s no money for second pilots and other risk mitigations typical of airline operations. Reliable Robotics is one of a couple of companies that are outfitting Cessna Caravan airplanes with advanced software to provide a high level of autonomy, for applications that include cargo transportation. Reliable Robotics The economic argument for autonomy is even more compelling in the emerging air-taxi industry , where hundreds of hopefuls—including a dozen or so serious contenders —are racing to develop electric vertical takeoff and landing aircraft to ferry passengers around crowded urban areas. Most of these eVTOLs are the size of helicopters, with space for just four or five passengers, and their proponents envision scores or even hundreds of them in the air over major cities, collectively moving millions of passengers annually. The concept is called urban air mobility , and in the speculative math that underpins it, eliminating the expense of a pilot and freeing up another seat for a paying passenger are seen as key to maximizing profits and scale. China has already certified a pilotless air taxi: the EH216-S, a two-seat multicopter developed by Guangzhou-based EHang that in March obtained initial approval from the Civil Aviation Administration of China for limited commercial sightseeing operations. However, many Western observers doubt that EHang’s design would pass muster by the U.S. Federal Aviation Administration (FAA) or the European Union Aviation Safety Agency (EASA), both of which have an especially conservative approach to safety. For that reason, most Western eVTOL makers have opted to develop piloted aircraft first and plan to introduce autonomous versions at some later date. They figure that seeking certification of novel electric aircraft designs, even without autonomy, is already a big ask of these regulators. A notable exception to this strategy is Wisk Aero , which began as a project funded by Google cofounder Larry Page and is now a wholly owned subsidiary of Boeing. In January 2022, the company declared that it would obtain FAA certification for its self-flying air taxi by the end of the decade and be operating close to 14 million flights annually within five years after that—a staggering ambition, given that the entire U.S. air traffic system currently manages around 16 million flights per year. While overheated expectations around urban air mobility have cooled considerably in the three years since that announcement, Wisk continues to forge ahead with its autonomous Generation 6 eVTOL , the company’s sixth aircraft design and the first it plans to certify for passenger-carrying operations. A mockup of Wisk’s sixth generation of electric vertical takeoff and landing aircraft was unveiled in October 2022. Wisk Importantly, Wisk, Reliable Robotics, and Merlin Labs are not just developing aircraft that they plan to certify eventually—they have already launched formal certification programs with the FAA (Merlin as part of a joint program with New Zealand’s Civil Aviation Authority). That means they’re working closely with the agency to define the rules and standards by which autonomous aircraft will be approved for commercial operations, blazing a trail for others to follow. The task is a daunting one, but the regulators and industry are not starting from scratch. Rather, they’re building on decades of certification experience and best practices that have helped to dramatically improve the safety of the aviation industry over its history. Aviation safety starts with certification Although the fatal January 2025 midair collision of an Army Black Hawk helicopter and an American Eagle CRJ700 near Washington, D.C.’s Reagan National Airport shook public confidence in the safety of the U.S. air transport system, commercial aviation remains a remarkably safe way to get around. According to researchers at MIT, the risk of a fatality from commercial air travel was just one per 13.7 million passenger boardings worldwide between 2018 and 2022. Fifty years earlier, the risk was an order of magnitude higher: one per 350,000 boardings between 1968 and 1977. There are many reasons for this great leap in safety, and the certification process is an important one. Today, a majority of aviation accidents are attributed to human error, but that’s not because people are inherently less reliable than aircraft. It’s because a systematic approach to design and testing has over the past several decades eliminated many of the mechanical problems that used to cause accidents routinely. In this context, the argument for enhancing safety through autonomy can be thought of as transferring even more responsibilities from highly variable humans to engineered systems that can be subjected to greater scrutiny. The overarching principle of certification is that the equipment and systems on an aircraft must be designed and installed so that they perform as intended during any foreseeable circumstances that they might encounter. “Perform as intended” includes not performing any unintended functions. An example of an unintended function is pushing the nose of an aircraft down past the level that a pilot can recover—that was the fatal result of a hidden software flaw that caused two crashes of the Boeing 737 Max and led to an extended grounding of the fleet while that oversight was remedied. Another key principle of certification is that the probability of a failure condition must be inversely proportional to its consequences. In other words, the more serious the impact of a failure, the more remote its chances of occurrence need to be. Aircraft are complex machines with millions of components that can and do fail, but many of these components can fail with no serious effects. For example, it’s no big deal if a lightbulb in the cabin burns out on a regular basis. Certifying authorities like the FAA generally accept a high probability of failure conditions that have a negligible impact on safety. However, failure conditions that are potentially catastrophic are required to be “extremely improbable.” Whether a failure condition is extremely improbable is fundamentally a qualitative evaluation that relies on the best judgments of engineers about how a system is likely to fail, supported by numerical assessments of the likelihood of failure. The critical systems on large commercial airliners are held to a numerical safety level of 10 -9 , meaning that catastrophic failures are expected no more than once in a billion flight hours (the equivalent of once in about 114,000 years of continuous operation). Achieving such vanishingly low probabilities may require expensive, heavy, and redundant systems, so regulators typically relax the safety expectations for small aircraft that carry fewer people. For example, a four-seat airplane like a Cessna 172 may only be held to a numerical safety level of 10 -6 , meaning that catastrophic failures are expected no more than once in a million flight hours. That said, aircraft manufacturers are free to design to higher standards, and Wisk is targeting the highest numerical safety level, 10 -9 , for its Gen 6 eVTOL. These basic principles of certification apply regardless of whether or not there’s a human pilot sitting in the cockpit, which is why developers of autonomous aircraft are confident they don’t need to completely reinvent the certification framework. “Everybody thinks that you need to think about the autonomy a different way than you would think about a piloted aircraft,” says Cindy Comer , Wisk’s vice president of certification, safety management systems and quality. “But really we just don’t get to pass off these failure conditions to a pilot. We still do our safety assessment the same way. We still may design our aircraft in a very similar way, but it may be to higher levels, it may be with more redundancy, or maybe we add equipment, because we no longer have that person that can sit there and see the things, grab the things, to pull the breakers. “So it drives our safety assessments to say, ‘Okay, we can’t put this on the pilot now. So what do we put it on?’” Key Aircraft Autonomy Projects Making autonomy certifiable presents unique challenges Answering that question—What do we put it on?—for every foreseeable failure condition is where the real work of certifying an autonomous aircraft comes in. Conventionally piloted aircraft may use the same overarching framework for certification, but they have the advantage of decades of certification history and precedent to fill in all of the details, down to requirements for such things as the actuation of the landing gear and the markings of instruments and placards. For the new systems on autonomous aircraft, many of those details must be negotiated with the FAA or some other certifying authority, which must be convinced in each instance that the proposed solution is at least as safe as the approach used on conventional aircraft. In the United States, applicants for type certificates have considerable flexibility in proposing how to meet the FAA’s safety goals. For each project incorporating novel technologies, the applicant and the agency agree on a set of requirements and standards, which becomes the “regulatory basis” for that aircraft. Theoretically, each autonomous-aircraft developer could have a very different regulatory basis, although in practice, the FAA looks for common ground. Nevertheless, the flexibility in this approach allows industry to explore a variety of possible ways to comply with a certification requirement before a solution is codified in regulation. Merlin Labs launched the flight test campaign for its certification-ready autonomy system in June 2024. The Merlin Pilot system is integrated directly onto the aircraft and is intended in the near term to reduce crew workload rather than fully replace pilots. Merlin Labs “Once you have the regulatory basis in place, then you need to come to agreement on how you’re going to demonstrate compliance to all of those regulations,” says Rose. “You can pull from existing standards, you can modify existing standards, or you can, in some cases, even just propose your own standards.” After agreeing upon the means of compliance, the applicant and regulator develop a detailed project plan that outlines the tests that will be performed and the reports—known as artifacts—that will be submitted to the regulator to support certification. For conventional piloted aircraft with a history of real-world operations, much of how those aircraft will function in the national airspace system is assumed. “Large commercial airplanes operate from airports around the world with relatively known and static equipment that helps them navigate and approach and land,” says Brian Yutko , until recently Wisk’s CEO (he now heads commercial airplane product development at Boeing). This infrastructure, he adds, has been established over decades and is reflected in the design of aircraft in ways that are often taken for granted. The existing system relies heavily on human pilots communicating with air traffic controllers over radio. Autonomous aircraft will require new concepts of operations, or “ConOps,” for how they will function, which could include using ground supervisors to handle radio calls, for example. In turn, the specifics of each ConOps will influence aircraft design requirements. According to Comer, crystallizing the ConOps at the beginning of the certification process “helps drive a common understanding of what you’re actually doing, and that may be different for every applicant with the FAA.” Basically, Wisk intends for its autonomous air taxi, which Yutko has likened to “a tram in the sky,” to fly along very specific and limited routes with predetermined emergency landing locations. Such a narrow set of tasks is an easier thing to automate than the varied and flexible operations performed by most small piloted aircraft today (or, for that matter, most self-driving cars). Meanwhile, human supervisors on the ground will monitor flights and communicate with air traffic control as required. Reliable Robotics’ automated Cessna Caravans will also have remote operators to handle communications with air traffic control, but they will fly over a much larger and more variable operating area. Because of this added complexity, Reliable has opted to split up the work of certifying its autonomous aircraft into chunks, beginning with certification of an advanced, always-on autopilot. This will assist but not replace the onboard pilot during all phases of flight, including landing as well as taxi and takeoff—which traditional autopilots are not capable of. Taking the pilot out of the cockpit will come as a follow-on certification project. Autonomous aircraft will do what autopilots can’t Proponents of autonomy like to point out that most commercial airline flights today are flown on autopilot from shortly after takeoff until touchdown or just before. It may therefore seem surprising that Europe’s aviation regulator, EASA, does not expect to see fully autonomous airliners until after 2050, while other regulators haven’t even speculated on a timeline for the shift. There are several reasons why “solving” autonomy in aircraft is not just a matter of expanding the functionality of existing autopilots. Basic flight control—moving flight-control surfaces and power inputs to make an aircraft fly how and where you want—is a relatively simple thing to automate, and most of the time, when everything goes as expected, autopilot works just fine. However, most existing autopilot systems assume there’s a human pilot, and for that reason they aren’t reliable enough to enable full autonomy. “There are autopilot actuators that go into aircraft today,” notes Reliable cofounder Rose. “But there’s a person sitting there monitoring them, and if [the actuators] do anything funny, then you click the off switch or actually, in many cases, you can just physically overpower the actuator. That’s not the case with ours—our actuators need to work all the time.” More challenging is solving for situations when everything does not go as expected, such as when another aircraft conflicts with the programmed flight path or a stray vehicle blocks the assigned runway. Autonomous-aircraft developers can’t count on a remote operator to manage these types of urgent, sudden conflicts, because the command-and-control (C2) link between the ground and the aircraft could also fail. “The aircraft, without having a [pilot] on board, needs to know where it is, and how to get where it’s going and how to avoid things along the way, over the length of its concept of operations,” says Yutko. Wisk’s Gen 6 flier will have the ability to safely complete a flight even if it loses both its C2 link and GPS signal immediately after takeoff, he says. “It turns out that if you don’t do that, then you start to impose really difficult technical requirements on the C2 link, or on your ability to maintain GPS.” In the speculative math that underpins urban air mobility, eliminating the expense of a pilot and freeing up another seat for a paying passenger are seen as key to maximizing profits and scale. Neither Wisk nor Reliable Robotics is using machine learning algorithms in its technical solutions, in large part because there’s no consensus on how to assure, to aviation’s exacting standards, the safety of such algorithms. These algorithms are frequently characterized as “nondeterministic,” meaning that their outputs can’t be reliably predicted from their inputs. Some autonomous-aircraft developers are incorporating artificial intelligence into their designs. Merlin Labs, for example, is developing natural-language-processing algorithms to communicate with air traffic control. For the most part, however, autonomous-aircraft developers aren’t counting on technology alone to solve the innumerable contingencies that can arise in flight—that’s where the ground operators come in. “We basically have taken everything that can be [automated] deterministically, and we’re making it deterministic,” Rose explains. “And all of the things that are…very hard to automate, that a human can do easily, then let the human do it.” Which raises the question: If humans are required to supervise autonomous aircraft, does the business case for them still hold up? Their developers say it does, but in ways that aren’t as simple as just striking “pilots” from the balance sheet. For example, those remote supervisors will need training, but that’s likely to be far less extensive and costly than the training required to competently fly an aircraft. For Reliable Robotics and other companies targeting cargo delivery, autonomy also promises to improve the efficiency of the existing cargo feeder network. “The reality is, in cargo aircraft, especially small cargo aircraft, pilots are super underutilized,” says Rose. Pilots at the feeder airlines may spend most of their day hanging out in a hotel room between their morning and evening flights. If people were instead managing autonomous cargo aircraft remotely, they could conceivably oversee additional flights across multiple time zones. “Our analysis has shown you can easily double the productivity of a pilot by putting them into our control center, potentially triple or quadruple the productivity [depending] on the mission set,” Rose says. Autonomous tech might eventually trickle up Even if companies like Wisk and Reliable Robotics succeed in certifying and commercializing their autonomous aircraft, human pilots still won’t face imminent extinction. Solving autonomy for one aircraft type and concept of operations doesn’t mean it’s solved for all types and concepts of operations. The technical, regulatory, and social barriers standing in the way of autonomous passenger jets are formidable. “I think for as long as we’re all alive, there will be piloted large commercial aircraft,” Yutko says. “If you solve Gen 6, you don’t get uncrewed large airplanes. You just don’t, and I’m not certain that we will in our lifetimes.” However, he does think it likely that some of the technologies now being developed at Wisk—such as navigating in the absence of GPS or techniques for automating emergency checklists—will find their way into conventionally piloted aircraft in ways that enhance safety. “I think those will be the types of things that we see in our lifetime benefiting big commercial transport applications, and I think it’s phenomenal,” adds Comer. As for whether it makes sense for anyone to embark upon a career as an airline pilot under the looming shadow of autonomy, it probably still does, at least for now. But check back in another 20 years. This story was updated on 25 June to reflect the fact that Merlin Labs has a joint certification program with New Zealand’s Civil Aviation Authority.",
    "published": "Tue, 17 Jun 2025 14:00:03 +0000",
    "author": "Elan Head",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Anti-Distraction Systems Shut Down Smartphone Use",
    "link": "https://spectrum.ieee.org/distracted-driving-smartphone",
    "summary": "As mobile phone use continues to be a leading cause of vehicle accidents, a range of technologies has emerged designed to combat distracted driving . From mobile apps to hardware-integrated systems, these tools aim to limit phone use behind the wheel. But a closer look reveals significant differences in how effectively they prevent distractions—especially in fleet vehicles. While apps like AT&T ’s DriveMode and Apple ’s built-in Do Not Disturb While Driving offer basic protections, they rely heavily on driver cooperation. Many can be bypassed with a swipe or a second phone, limiting their effectiveness when liability and safety are paramount. “We think technologies that reduce visual-manual interaction with phones are obviously a good thing,” Ian Reagan , a senior research scientist at the Insurance Institute for Highway Safety told IEEE Spectrum . “But most are opt-in. We’d like to see them as opt-out by default.” “Mobile use while driving is an addiction. We needed a system that prevents distraction without waiting for the driver to choose safety. That’s what we built.” Ori Gilboa, SaverOne Now, a new generation of anti-distraction technology is shifting from soft nudges to hard enforcement. And for companies managing fleets of drivers, the stakes—and the solutions—are getting more serious. The Need for Enforceable Solutions “There’s a difference between tools that monitor and tools that prevent,” says Ori Gilboa , CEO of SaverOne , a Tel Aviv–area startup leading a new wave of hardware-integrated solutions that make driver cooperation a nonissue. “That distinction matters when lives are on the line.” SaverOne’s system uses a passive sensor network to scan the vehicle cabin for phones, identify the driver’s device, and place it into “safe mode”—automatically blocking risky apps while allowing essential functions like navigation and preapproved voice calls. Crucially, the system works even if the driver tries to cheat by disabling Bluetooth or by bringing a second phone. Designed to Be Driverproof The system consists of four small hidden sensors and a central receiver—about the size of an iPhone —installed inside the vehicle. It can pinpoint mobile devices within centimeters and distinguishes between driver and passenger phones. If the driver’s phone is active and doesn’t connect to SaverOne’s app, a buzzer sounds until the issue is resolved. “What sets us apart is our prevention-first approach,” says Gilboa. “Most systems focus on what went wrong after the fact. We stop the distraction before it happens.” Gilboa said the system’s design respects driver usability, preserving tools like turn-by-turn navigation and voice calls to approved contacts. “We want drivers to be reachable—but not distracted,” he adds. Global Expansion, Measurable Impact Since launching its second-generation product in 2022, SaverOne has rapidly expanded. After early pilot deployments with Israeli fleet operators such as Bynet Data Communications , Israel Electric Corporation , and ice-cream purveyor Froneri , the company gained traction, securing deals with a broader array of Israeli companies. By mid-2023, Cemex Israel, the global cement giant’s local subsidiary, had agreed to deploy the driver-distraction-prevention system on its 380-vehicle fleet. In January 2024, following a successful trial with 17 trucks, Strauss Group , one of Israel’s largest food and beverage companies, decided to install the SaverOne system on its fleet of 80 food-delivery trucks. Though smaller than the Cemex Israel contract, that agreement proved significant because Strauss accumulated data demonstrating a statistically significant reduction in accident rates among the equipped vehicles. That news has helped SaverOne in its bid to go global. CEMEX has since outfitted trucks in fleets across Europe. In the United States, SaverOne is now being adopted by FedEx contractors in North Carolina and Philadelphia, says Gilboa. Some fleet operators report as much as a 60 percent reduction in accident rates post-installation. While those figures are difficult to verify independently, a more concrete metric is phone interaction. Fleet managers have observed a dramatic drop—from drivers checking their phones 10 times per hour to near zero. “The system educates through behavior,” says Gilboa. “It’s not about punishment—it’s about making the right choice automatic.” But Reagan cautions that long-term behavioral change remains unproven, comparing it to early intelligent speed assistance trials in Europe using systems that detected vehicles’ locations, used digital maps to keep track of local speed limits, and reduced engine power to prevent the vehicles from exceeding the legal limit. “When the limiter was on,” Reagan says, “people obeyed the posted speed limits. When it was turned off, they sped again. Whether tech like this [driver-distraction-prevention system] creates lasting change—well, we just don’t know yet.” Could Regulation Be the Tipping Point? Despite promising results, broader adoption—particularly in the consumer market—may hinge on regulation. IIHS’s Reagan notes that although distracted driving officially accounts for about 10 percent of crash fatalities, or roughly 3,500 deaths per year, the real figure is likely far higher. Despite the undercount, the urgency is still hard to ignore. As Reagan put it, “Phones let you mentally escape the car, even when you’re barreling down the highway at 115 kilometers per hour [about 70 miles per hour]. That’s the real danger.” He adds that government regulation requiring carmakers to install systems like SaverOne’s could be a game changer. “The tech exists,” Reagan said. “What we need is the political will to mandate it.” SaverOne is still focused on fleet customers, but the company is in discussions with insurers exploring offering discounts to young or high-risk drivers who use distraction-prevention systems, Gilboa says. “Mobile use while driving is an addiction,” he says. “We needed a system that prevents distraction without waiting for the driver to choose safety. That’s what we built.”",
    "published": "Wed, 11 Jun 2025 14:00:03 +0000",
    "author": "Willie D. Jones",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "BYD’s Five-Minute Charging Puts China in the Lead for EVs",
    "link": "https://spectrum.ieee.org/byd-megawatt-charging",
    "summary": "A five-minute charge for an EV, virtually as quick as a gasoline fill-up, has long seemed a quixotic dream. Now electric Don Quixotes can save critical time on their quests, at least in China. BYD’s “megawatt charging” is here. And the company’s 1,000-kilowatt fast chargers could eliminate perhaps the biggest consumer gripe over EVs: That they take too long to charge. BYD, the automaker that has passed Tesla in global EV sales, demonstrated its record-setting tech in Beijing during the recent Shanghai auto show. The numbers are staggering: More than a kilometer of added driving range per second on the plug. It supplies 400 kilometers of fresh range (nearly 250 miles) in five minutes. Even by the U.S. Environmental Protection Agency’s more-realistic estimates, that equates to about 270 kilometers (168 miles) of range in five minutes. “Despite advancements in EV technology, ‘charging anxiety’ remains the biggest pain point affecting the user experience,” BYD chairman and president Wang Chuanfu said in a statement. “To fully address this, our goal is to make the charging time of electric vehicles as short as the refueling time for gasoline cars.” BYD’s Fast Charging Versus Competitors How does BYD’s lightning pace compare with other standards? In the latest Hyundai Ioniq5 , I’ve added 270 kilometers in about 18 minutes. Tesla says its latest Model Y can manage that in 15 minutes. Lucid’s new Gravity SUV , the best of the bunch, can add 320 kilometers in 15 minutes, at a peak rate of 400 kW. In the Shanghai demonstration , a new BYD Han L sedan reached a brief charging peak of 1,002 kW, before steadily tapering off to a “low” of 463 kW. In just under five minutes, the Han L boosted its battery from 13 to 60 percent and added 421 kilometers (262 miles) of range—about three times as fast as the top EV-and-charger combos in the United States. “If I can add 250 miles in five minutes, what does this mean for oil and gas?” says Tu Le, managing director of Sino Auto Insights. “And if China is the only country that’s going to support this, are the rest of us going to live in an analog world?” The real game changer, Le said, is that BYD—which is on pace to sell 5 million EVs and hybrids this year—has the cars, chargers, and batteries to bring these advances to the masses at affordable prices. Without all three, none of this works. And none of that would be possible without being a vertically integrated company at massive scale. That includes an entire “kilovolt manufacturing chain” to develop and build every necessary component. “This is where BYD is uniquely positioned,” Le says. “No other company has that much engineering control over what might seem to be disparate elements, by designing their own cars, chargers, and batteries.” BYD claims its Blade battery’s 1,000-ampere current and 10-C charging rate are global records for the EV industry. BYD In March, BYD debuted its Super e-Platform, which underpins the Han L sedan and Tang L SUV . The world’s first 1,000-volt car platform tops the Lucid’s 926 V, the 800 V of Hyundai, Porsche and other brands, or Tesla’s puny 400 V. To match the charging speeds, the platform integrates the industry’s first mass-produced, 1,500-V silicon-carbide chips. A powerful, 30,000-rpm electric motor can generate up to 580 kilowatts (778 horsepower). That’s enough to scoot the new BYDs from 0 to 100 kilometers per hour (62 miles per hour) in about 2.7 seconds. And while the Han L would surely cost more in Western countries, the sedan starts at roughly 210,000 yuan in China, or about US $29,000. The Tang L sells for the equivalent of about $40,000. BYD’s next advance is a Flash Charging Battery , a variant of its current Blade batteries. Its lithium iron phosphate (LFP) chemistry trades some power density for safety, durability, and unbeatable charging speeds. The company claims its 1,000 ampere current and 10-C charging rate are global records for any EV battery. (A 1-C battery refers to one that can charge or discharge in one hour; a 10-C battery can do the trick in six minutes.) BYD reduced the battery’s internal resistance by 50 percent, redesigning electrolytes, separators, and electrodes for “ultrafast ion channels.” Its latest refrigerant cooling system helps deliver a 35 percent gain in high-temperature lifespan, ensuring that megawatt charging won’t degrade the battery. Finally, there’s the BYD Megawatt charger itself, whose maximum 1,360-kW output whips the 500 kW of Lucid’s new Charging Hub in New York City. The units feature built-in energy storage to reserve juice for when the grid can’t supply it, or for use in China’s rural areas. The company designed its plug handles, or guns, to be less bulky than the CCS units found in the United States and Europe, if not quite as svelte as Tesla’s Supercharger plugs. But BYD’s quick-draw routine can extend to a pair of pistols: When a Megawatt charger isn’t available, the Han L and Tang L can plug into two fast chargers at once to maximize refill speeds, using DC ports on either side of the car. Pull up to a 250-kW charger with two plug outlets, and these Chinese models can charge at about 500 kW, or 360 kW on a pair of 180 kW units. Several Western models offer dual charging ports, but they’re exclusively DC on one side and AC on the other. BYD is the first to let users double their charging pace; no word on how Chinese EV owners might react to seeing one car hogging a pair of public outlets. As Le notes, that speed is a watchword for China’s entire EV ecosystem. While the United States dithers—or seeks to kill incentives that encouraged consumers to buy EVs and automakers to build factories—China continues to innovate through a ruthless blend of competition and government support. Just two months after announcing its kilovolt platform, BYD has already built 500 Megachargers, though only at its dealerships for now, with plans for 4,000 chargers. “The system is ready and the cars are affordable, from day one,” Le says. That country’s arms race in fast charging is already sparking one-upmanship. Since BYD’s big move, Huawei —the smartphone giant now stepping into the automotive industry —and the Geely Group’s Zeekr brand have announced their own chargers that promise speeds of up to 1,500 kW. And Le responded to industry critics who have described these systems as overkill. “Maybe so,” Le said. “But that’s the nature of the Chinese market: You have to outdo your competitor, or you’ll be left behind.” This article appears in the August 2025 print issue as “China’s BYD Achieves 5-Minute EV Charging.”",
    "published": "Fri, 06 Jun 2025 17:19:13 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Look for These 7 New Technologies at the Airport",
    "link": "https://spectrum.ieee.org/7-new-airport-tech",
    "summary": "Take a look around the airport during your travels this summer and you might spot a string of new technologies at every touchpoint: from pre-arrival, bag drop, and security to the moment you board the plane. In this new world, your face is your boarding pass, your electronic luggage tag transforms itself for each new flight, and gate scanners catch line cutters trying to sneak onto the plane early. It isn’t the future—it’s now. Each of the technologies to follow is in use at airports around the world today, transforming your journey-before-the-journey. Virtual queuing speeds up airport security As you pack the night before your trip, you ponder the age-old travel question: What time should I get to the airport? The right answer requires predicting the length of the security line. But at some airports, you no longer have to guess; in fact, you don’t have to wait in line at all. Instead, you can book ahead and choose a specific time for your security screening—so you can arrive right before your reserved slot, confident that you’ll be whisked to the front of the line, thanks to Copenhagen Optimization ’s Virtual Queuing system. Copenhagen Optimization’s machine learning models use linear regression, heuristic models, and other techniques to forecast the volume of passenger arrivals based on historical data. The system is integrated with airport programs to access flight schedules and passenger-flow data from boarding-pass scans, and it also takes in data from lidar sensors and cameras at security checkpoints, X-ray luggage scanners, and other areas. If a given day’s passenger volume ends up differing from historical projections, the platform can use real-time data from these inputs to adjust the Virtual Queuing time slots—and recommend that the airport make changes to security staffing and the number of open lanes. The Virtual Queuing system is constantly adjusting to flatten the passenger arrival curve, tactically redistributing demand across time slots to optimize resources and reduce congestion. While this system is doing the most, you as a passenger can do the least. Just book a time slot on your airport’s website or app, and get some extra sleep knowing you’ll waltz right up to the security check tomorrow morning. Electronic bag tags MCKIBILLO Checking a bag? Here’s another step you can take care of before you arrive: Skip the old-school paper tags and generate your own electronic Bagtag . This e-ink device (costing about US $80, or €70) looks like a traditional luggage-tag holder, but it can generate a new, paperless tag for each one of your flights. You provide your booking details through your airline’s app or the Bagtag app, and the Bagtag system then uses application programming interfaces and secure data protocols to retrieve the necessary information from the airline’s system: your name, flight details, the baggage you’re allowed, and the unique barcode that identifies your bag. The app uses this data to generate a digital tag. Hold your phone near your Bagtag, and it will transmit the encrypted tag data via Bluetooth or NFC. Simultaneously, your phone’s NFC antenna powers the battery-free Bagtag device. On the Bagtag itself, a low-power microcontroller decrypts the tag data and displays the digital tag on the e-ink screen. Once you’re at the airport, the tag can be scanned at the airline’s self-service bag drop or desk, just like a traditional paper tag. The device also contains an RFID chip that’s compatible with the luggage-tracking systems that some airlines are using, allowing your bag to be identified and tracked—even if it takes a different journey than you do. When you arrive at the airport, just drop that checked bag and make your way to the security area. Biometric boarding passes MCKIBILLO Over at security, you’ll need your boarding pass and ID. Compared with the old days of printing a physical slip from a kiosk, digital QR code boarding passes are quite handy—but what if you didn’t need anything besides your face? That’s the premise of Idemia Public Security ’s biometric boarding-pass technology. Instead of waiting in a queue for a security agent, you’ll approach a self-service kiosk or check-in point and insert your government-issued identification document, such as a driver’s license or passport. The system uses visible light, infrared, and ultraviolet imaging to analyze the document’s embedded security features and verify its authenticity. Then, computer-vision algorithms locate and extract the image of your face on the ID for identity verification. Next, it’s time for your close-up. High-resolution cameras within the system capture a live image of your face using 3D and infrared imaging. The system’s antispoofing technology prevents people from trying to trick the system with items like photos, videos, or masks. The technology compares your live image to the one extracted from your ID using facial-recognition algorithms. Each image is then converted into a compact biometric template—a mathematical representation of your facial features—and a similarity score is generated to confirm a match. Finally, the system checks your travel information against secure flight databases to make sure the ticket is valid and that you’re authorized to fly that day. Assuming all checks out, you’re cleared to head to the body scanners—with no biometric data retained by Idemia Public Security’s system. X-rays that can tell ecstasy from eczema meds MCKIBILLO While you pass through your security screening, that luggage you checked is undergoing its own screening—with a major new upgrade that can tell exactly what’s inside. Traditional scanners use one or a few X-ray sources and work by transmission, measuring the attenuation of the beam as it passes through the bag. These systems create a 2D “shadow” image based on differences in the amount and type of the materials inside. More recently, these systems have begun using computed tomography to scan the bag from all directions and to reconstruct 3D images of the objects inside. But even with CT, harmless objects may look similar to dangerous materials—which can lead to false positives and also require security staff to visually inspect the X-ray images or even bust open your luggage. By contrast, Smiths Detection ’s new X-ray diffraction machines measure the molecular structure of the items inside your bag to identify the exact materials—no human review required. The machine uses a multifocus X-ray tube to quickly scan a bag from various angles, measuring the way the radiation diffracts while switching the position of the focal spots every few microseconds. Then, it analyzes the diffraction patterns to determine the crystal structure and molecular composition of the objects inside the bag—building a “fingerprint” of each material that can much more finely differentiate threats, like explosives and drugs, from benign items. The system’s algorithms process this diffraction data and build a 3D spatial image, which allows real-time automated screening without the need for manual visual inspection by a human. After your bag passes through the X-ray diffraction machine without incident, it’s loaded into the cargo hold. Meanwhile, you’ve passed through your own scan at security and are ready to head toward your gate. Airport shops with no cashiers or checkout lanes MCKIBILLO While meandering over to your gate from security, you decide you could use a little pick-me-up. Just down the corridor is a convenience store with snacks, drinks, and other treats—but no cashiers. It’s a contactless shop that uses Just Walk Out technology by Amazon. As you enter the store with the tap of a credit card or mobile wallet, a scanner reads the card and assigns you a unique session identifier that will let the Just Walk Out system link your actions in the store to your payment. Overhead cameras track you by the top of your head, not your face, as you move through the store. The Just Walk Out system uses a deep-learning model to follow your movements and detect when you interact with items. In most cases, computer vision can identify a product you pick up simply based on the video feed, but sometimes weight sensors embedded in the shelves provide additional data to determine what you removed. The video and weight data are encoded as tokens, and a neural network processes those tokens in a way similar to how large language models encode text—determining the result of your actions to create a “virtual cart.” While you shop, the system continuously updates this cart: adding a can of soda when you pick it up, swapping one brand of gum for another if you change your mind, or removing that bag of chips if you put it back on the shelf. Once your shopping is complete, you can indeed just walk out with your soda and gum. The items you take will make up your finalized virtual cart, and the credit card you entered the store with will be charged as usual. (You can look up a receipt, if you want.) With provisions procured, it’s onward to the gate. Airport-cleaning robots MCKIBILLO As you amble toward the gate with your luggage and snacks, you promptly spill that soda you just bought. Cleanup in Terminal C! Along comes Avidbots’ Neo , a fully autonomous floor-scrubbing robot designed to clean commercial spaces like airports with minimal human intervention. When a Neo is first delivered to the airport, the robot performs a comprehensive scan of the various areas it will be cleaning using lidar and 3D depth cameras. Avidbots software processes the data to create a detailed map of the environment, including walls and other obstacles, and this serves as the foundation for Neo’s cleaning plans and navigation. Neo’s human overlords can use a touchscreen on the robot to direct it to the area that needs cleaning—either as part of scheduled upkeep, or when someone (ahem) spills their soda. The robot springs into action, and as it moves, it continuously locates itself within its map and plans its movements using data from wheel encoders, inertial measurement units, and a gyroscope. Neo also updates its map and adjusts its path in real time by using the lidar and depth cameras to detect any changes from its initial mapping, such as a translocated trash can or perambulating passengers. Then comes the scrubbing. Neo’s software plans the optimal path for cleaning a given area at this moment in time, adjusting the robot’s speed and steering as it moves along. A water-delivery system pumps and controls the flow of cleaning solution to the motorized brushes, whose speed and pressure can also be adjusted based on the surface the robot is cleaning. A powerful vacuum system collects the dirty water, and a flexible squeegee prevents slippery floors from being left behind. While the robot’s various sensors and planning algorithms continuously detect and avoid obstacles, any physical contact with the robot’s bumpers triggers an emergency stop. And if Neo finds itself in a situation it’s just not sure how to handle, the robot will stop and call for assistance from a human operator, who can review sensor data and camera feeds remotely to help it along. “Wrong group” plane-boarding alarm MCKIBILLO Your airport journey is coming to an end, and your real journey is about to begin. As you wait at the gate, you notice a fair number of your fellow passengers hovering to board even before the agent has made any announcements. And when boarding does begin, a surprising number of people hop in line. Could all these people really be in boarding groups 1 and 2? you wonder. If they’re not…they’ll get called out. American Airlines’ new boarding technology stops those pesky passengers who try to join the wrong boarding group and sneak onto the plane early. If one such passenger approaches the gate before their assigned group has been called, scanning their boarding pass will trigger an audible alert—notifying the airline crew, and everyone else for that matter. The passengers will be politely asked to wait to board. As they slink back into line, try not to look too smug. After all, it’s been a remarkably easy, tech-assisted journey through the airport today. This article appears in the July 2025 print issue as “A Walk Through 7 New Technologies at the Airport.”",
    "published": "Wed, 04 Jun 2025 16:00:04 +0000",
    "author": "Julianne Pepitone",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Hyundai’s Metaplant Seeks Hard-Working Robots",
    "link": "https://spectrum.ieee.org/hyundai-metaplant-georgia",
    "summary": "Less than three years ago, these were bare fields in humble Ellabell, Georgia. Today, the vast Hyundai Motor Group Metaplant is exactly what people imagine when they talk about the future of EV and automobile manufacturing in America. I’ve driven the 2026 Hyundai Ioniq9 here from nearby Savannah, a striking three-row electric SUV with everything it takes to succeed in today’s market: up to 530 kilometers (335 miles) of efficient driving range, the latest features and tech, and a native NACS connector that lets owners—finally—hook into Tesla Superchargers with streamlined Plug and Charge ease . The success of the Ioniq9 and popular Ioniq5 crossover is deeply intertwined with the US $7.6 billion Metaplant, whose inaugural 2025 Ioniq5 rolled off its assembly line in October. That includes the Ioniq models’ full eligibility for $7,500 consumer tax credits for U.S.-built EVs with North American batteries, although the credits are on the Trump administration’s chopping block . Still, the factory gives Hyundai a bulwark and some breathing room against potential tariffs and puts the South Korean automaker ahead of many rivals. America’s Largest EV Plant With 11 cavernous buildings and a massive 697,000 square meters (7.5 million square feet) of space, it’s set to become America’s largest dedicated plant for EVs and hybrids, with capacity for 500,000 Hyundai, Kia, and Genesis models per year. (Tesla’s Texas Gigafactory can produce 375,000.) Company executives say this is North America’s most heavily automated factory, bar none, a showcase for AI and robotic tech. The factory is also environmentally friendly, as I see when I roll into the factory: “Meta Pros,” as Hyundai calls its workers, can park in nearly 1,900 spaces beneath solar roofs, shielded from the baking Georgia sun that provides up to 5 percent of the plant’s electricity. The automaker has a target of obtaining 100 percent of its energy from renewable sources. Those include hydrogen trucks from the Hyundai-owned Xcient , the world’s first commercialized hydrogen fuel-cell semis. A fleet of 21 trucks haul parts here from area suppliers, taking advantage of 400-kilometer driving ranges with zero tailpipe emissions. The bulk of finished vehicles are shipped by rail rather than truck, trimming fossil-fuel emissions and the automaker’s carbon footprint. At the docks, some of the plant’s 850 robots unload parts from the hydrogen trucks. About 300 automated guided vehicles, or AGVs, glide around the factory with no tracks required, smartly avoiding human workers. As part of an AI-based procurement and logistics system, the AGVs automatically allocate and ferry parts to their proper work stations for just-in-time delivery, saving space, time, and money otherwise used to stockpile parts. “They’re delivering the right parts to the right station at the right time, so you’re no longer relying on people to make decisions,” says Jerry Roach, senior manager of general assembly. The building blocks of a modern unibody car chassis, called “bodies in white,” are welded by an army of 475 robots at Hyundai’s new plant. Hyundai I’ve seen AGVs in action around the world, but the Metaplant shows me a new trick: A pair of sled-like AGVs slide below these electric Hyundais as they roll off the line. They grab and hoist their wheels and autonomously ferry the finished Hyundais to a parking area, with no need for a human driver. Robotic Innovations in Hyundai Factories Some companies have strict policies about pets at work. Here, Spots —robotic quadrupeds designed by Hyundai-owned Boston Dynamics—use 360-degree vision and “athletic intelligence” to sniff out potential defects on car welds. Those four-legged friends may soon have a biped partner: Atlas, the humanoid robots from Boston Dynamics whose breathtaking physical skills — including crawling, cartwheeling, and even breakdance moves—have observers wondering if autoworkers are next in line to be replaced by AI. Hyundai executives say that’s not the case, even as they plan to deploy Atlas models (non-union of course) throughout their global factories. With RGB cameras in their charming 360-degree swiveling heads, Atlas robots are being trained to sense their environments, avoid collisions, and manipulate and move parts in factories in impressively complex sequences. The welding shop alone houses 475 industrial robots, among about 850 in total. I watch massive robots cobble together “ bodies in white, ” the building blocks of every car chassis, with ruthless speed and precision. A trip to the onsite steel stamping plant reveals a facility so quiet that no ear protection is required. Here, a whirling mass of robots stamp out roofs, fenders, and hoods, which are automatically stored in soaring racks overhead. Roach says the Metaplant offered a unique opportunity to design an electrified car plant from the ground up, rather than retrofit an existing factory that made internal-combustion cars, which even Tesla and Rivian were forced to do in California and Illinois, respectively. Regarding automation replacing human workers, Roach acknowledges that some of it is inevitable. But robots are also freeing humans from heavy lifting and repetitive, mindless tasks that, for decades, made factory work both hazardous and unfulfilling. He offers a technical first as an example: A collaborative robot—sophisticated enough to work alongside humans with no physical separation for safety—installs bulky doors on the assembly line. It’s a notoriously cumbersome process to perform without scratching the pretty paint on a door or surrounding panels. “Guess what? Robots do that perfectly,” Roach says. “They always put the door in the exact same place. So here, that technology makes sense.” It also frees people to do what they’re best at: precision tasks that require dexterous fingers, vision, intelligence, and skill. “I want my people doing craftsmanship,” Roach says. The plant currently employs 1,340 Meta Pros at an annual average pay of $58,100. That’s 25 percent higher than average in Bryan County, Ga. Hyundai’s annual local payroll has already reached $497 million. The company foresees an eventual 8,500 jobs on site and another 7,000 indirect jobs for local suppliers and businesses. On the battery front, Hyundai is currently sourcing cells from Georgia and SK On, with some Ioniq5 batteries imported from Hungary. But the Metaplant campus includes the HL-GA battery company. The $4 billion plant, a joint operation with LG Energy Solutions, plans to produce nickel-cobalt-magnesium cells beginning next year, assembled into packs on site by Hyundai’s Mobis subsidiary. Hyundai is also on track to open a second $5 billion battery plant in Georgia, a joint operation with SK On. It’s all part of Hyundai’s planned $21 billion in U.S. investment between now and 2028—more than the $20 billion it invested since entering the U.S. market in 1986. Even a robot could crunch those numbers and come away impressed.",
    "published": "Wed, 28 May 2025 14:53:29 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "LTA Research Airship Flies Over San Francisco Bay",
    "link": "https://spectrum.ieee.org/lta-research-airship-pathfinder-1",
    "summary": "The age of the airship is back, kind of. On 15 May, startup LTA Research flew its Pathfinder 1 airship outside Silicon Valley’s Moffett Federal Airfield for the first time. The 124-meter-long helium airship took two loops over the waters of San Francisco Bay before safely returning to base. That makes it the largest aircraft to fly in public since the 1930s, when a series of crashes ended the glory years of airship travel. (LTA has flown smaller, traditional blimps in the Bay Area a number of times for systems testing.) The milestone flight was the culmination of 12 years’ work for LTA Research , which is funded by Google cofounder Sergey Brin . “I was a little bit emotional to see it over the bay, performing as well as it did,” says the startup’s vice president of engineering, Peter Sonnek. Sonnek grew up in the Lake Constance region of Germany, where the first Zeppelin airships were made. “Flight testing the Pathfinder 1 is more than just learning how it flies,” adds LTA’s new CEO, Brett Crozier. “It’s trying to lay the foundation for a future of electric aviation that’s more sustainable, more adaptable, and more capable, in a way that will potentially change the way we move cargo and people around the world.” Airships can theoretically transport passengers and goods using about a quarter of the energy of jet planes—and with all-electric power sources that emit no carbon. The problem is that they move at only one-tenth the speed of commercial jets, can struggle with winds and weather, and would require a rethink of how airports traditionally operate. Making airships commercially relevant again is a challenge as big as the vehicles themselves, and LTA’s efforts to date have mostly been behind closed doors. But with the Pathfinder 1 now flying in full view around Silicon Valley , the startup granted IEEE Spectrum exclusive access to see the completed airship up close, and to talk with Crozier and Sonnek about the future of lighter-than-air travel. LTA Research airship is an updated helium giant Hangar 2 at Moffett Field was built at the start of World War II to accommodate the Navy’s new lighter-than-air fleet and remains one of the largest unsupported wooden structures in the world. The interior space is breathtaking, a cathedral of wood so vast it can occasionally generate its own clouds. Beneath the vast vault of timber, the Pathfinder 1, awe inspiring in its enormity, rests on a few small landing wheels. The front of the airship is secured to a giant mobile mooring mast used to transport it in and out of the hangar. The semitruck that pulls the mast looks like a toy in comparison. One section of the airship’s covering of UV-resistant white Tedlar (polyvinyl fluoride) was peeled back to reveal a complex structure within. Four large carbon-fiber and foam-core tail fins stabilize the airship during forward flight. (LTA could fly the Pathfinder 1 backward but doesn’t because it would wobble.) The Pathfinder 1 airship is housed at Hangar 2 at Moffett Field, California, which was built during World War II to shelter U.S. Navy airships. LTA Research Like the historic airships of old—but unlike the collapsible Goodyear blimp—the Pathfinder 1 has a three-dimensional, rigid frame supporting internal gas cells. This structure both makes the airship more resilient to weather and allows it to finely control its buoyancy and attitude. The similarities with last century’s airships end there. Instead of aluminum beams inside, Pathfinder 1 uses lightweight carbon fiber rods and titanium hubs, and each of its 13 huge nylon gas cells contains stable helium rather than flammable hydrogen . Conserving that helium, which is piped into the airship from below, is a major effort. The expensive, increasingly scarce, gas is never simply vented to the air. When engineers need to work on the airship’s gas cells, the helium is extracted from the top of the Pathfinder using thick yellow tubes suspended from the roof of the hangar. It is then decanted into a giant “nurse bag,” towering almost to the full height of the hangar like an elongated hot-air balloon. Another big difference to the airships of old is the propulsion. The Pathfinder 1 sports 12 electric motors , four spaced out on either side and four at the rear. Each can swivel 180 degrees in either direction, with a fly-by-wire system that allows pinpoint control of their thrust. The motors draw power from batteries that can be charged on the ground, or during flight using on-board generators. Small scoops on the side of the airship direct ambient air across the batteries to keep them cool. Crozier would not disclose the power source to charge the batteries during flight, other than to call it a hybrid system. This implies LTA is currently using a fossil fuel of some type. The company is exploring zero-carbon power solutions, although it is unlikely to use the hydrogen fuel cells favored by some electric aviation startups. The flight test program approved by the FAA is almost glacially incremental. Since the Pathfinder 1 first ventured out of Hangar 2 in November 2023, it was first moored to the mast and then slowly released to be tested at higher altitudes and speeds. Not everything went smoothly, Crozier admits: “Flight testing is a slow, deliberate process. And after every test, you learn new things and there’s new things you want to adjust.” For example, after the first flights, test engineers noticed that the gas cells were shifting too much within the carbon-fiber supports, making it tricky to keep the airship level. The company added stiffer bulkheads between the cells to fix the issue. Another change was to increase the size of the Pathfinder 1 ’s water ballast system. Many airships hold reservoirs of water on board, pumping the liquid fore or aft to help balance or direct the aircraft. If the airship needs to rise quickly, the water can also be released to add buoyancy. “It’s a very massive structure, but very small changes in buoyancy make a big difference,” says Sonnek. LTA Research As massive as the Pathfinder 1 is, it is merely a subscale prototype of the airship LTA really wants to build. The Pathfinder 3, currently under development at another WWII-era hangar in Akron, Ohio, will form the basis of the airship that LTA will eventually submit for certification by the FAA. The Pathfinder 3 will be larger than the current vessel and will carry more passengers or cargo, but other than that, its design is still far from set, says Crozier: “Everything we’re doing now will inform what that Pathfinder 3 will look like, with the goal of manufacturing commercial airships in Akron.” Multiple airship startups foresee various uses LTA is not the only company trying to bring airships back to life . British firm Hybrid Air Vehicles says that it is preparing a factory to build an intriguing 100-passenger design with a soft, blimp-like envelope in a wing-like shape to provide aerodynamic lift. The company hopes to be producing dozens by 2030, despite its only prototype so far breaking free of its mooring and deflating in 2019. Flying Whales , based in France, wants to build 180-meter airships at a factory in Quebec, while Aeros in L.A. plans to deploy drones from its airships. But LTA has something they don’t—a billionaire funder with a passion as deep as his pockets. Sergey Brin also controls disaster response nonprofit Global Support and Development , which provides assistance to islands hit by hurricanes and other climate disasters. While humanitarian missions are a possible future use case for LTA’s airships, Crozier insists that the Pathfinder 3 will also have to be commercially viable in cargo or passenger travel. “We’re slower than a 777, but we’re faster than most other things, and we don’t need a runway,” he says. “That’s a sweet spot for light cargo and sustainable travel. And once you design to take care of those two, that leaves the door open for humanitarian work, which is important to us.” For now, there’s much more to learn from flight testing at Moffett Field. The company had to ask the FAA for another special airworthiness certificate to extend testing into 2025 and will likely do the same again toward the end of this year. Near-term challenges include operating the Pathfinder 1 at higher speeds and altitudes, and starting to test it in more demanding conditions. “I feel like I’ve paid more attention to weather in the last month than I had my entire life of flying airplanes,” says Crozier. “We’re trying not to get ahead of ourselves. We’re going to focus on the flight testing now with an eye toward the future. And then we’ll use that to design whatever that next generation airship looks like.” Only one thing seems certain. Whatever LTA builds next, it’s going to be very, very large. This article was updated on 28 May 2025.",
    "published": "Tue, 27 May 2025 14:30:03 +0000",
    "author": "Mark Harris",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "One Driver, Two Trucks: Is This the Future of Freight?",
    "link": "https://spectrum.ieee.org/truck-platooning-ohio-indiana",
    "summary": "The pair of semi trucks cruising down Interstate 70 between Columbus, Ohio, and Indianapolis may seem unremarkable at first glance. But these rigs are part of a groundbreaking pilot project that could reshape the U.S. freight industry. Launched in April through a joint initiative between the Ohio and Indiana Departments of Transportation (DOTs), the project tests semiautonomous “platooning” technology, in which a lead truck operated by a human driver is linked to a follower truck via encrypted, military-grade communications. Signals from the lead truck control the follower truck’s steering, acceleration, and braking; in essence, the follower truck mimics what the lead truck does. With one driver effectively operating two trucks, the system extends fleet capacity without doubling head count. Along with addressing the nation’s persistent truck-driver shortage, It can also increase safety and improve fuel efficiency. Ohio Department of Transportation “This is about reimagining the future of transportation in our region,” says Nick Hegemier , managing director for infrastructure and technology at DriveOhio , a smart-mobility initiative within the Ohio DOT . “By collaborating across state lines and sectors, we’re paving the way for smarter, safer, and more efficient freight movement.” What is truck platooning? For the pilot project, Kratos Defense , a San Diego–based defense contractor known for its autonomous military systems, adapted its battlefield vehicle-following technology for civilian use. The trucks are operated by EASE Logistics , in Dublin, Ohio. “We’re not replacing drivers—we’re extending their reach.” –Maynard Factor, Kratos Defense Kratos’s system can be retrofitted to existing trucks and is designed to be robust in high-interference environments. It uses dual-channel, frequency-hopping communications and 256-bit advanced encryption standard . The trucks can switch between two radio frequencies—915 megahertz and 2.4 gigahertz—to maintain a secure connection even as they roll through electronic tollbooths, which mostly use 915 MHz. “There’s no Wi-Fi , no cellular, no Bluetooth,” says Maynard Factor , vice president of business development at Kratos. “Just a direct vehicle-to-vehicle link with intelligent fallback if one frequency becomes unreliable.” The tight coordination between the trucks improves safety by helping to dampen the stop-and-go shockwaves that can lead to accidents. The follower truck also uses up to 10 percent less fuel by staying in the low-pressure wake of the lead truck, while the lead truck’s fuel economy improves by a few percent because it experiences less turbulence at its rear, according to researchers. In the one-year Ohio–Indiana pilot, the follower truck includes a human backup driver. Factor says that the system can support backup drivers who don’t have commercial driver’s licenses; the eventual goal is to have no driver in the second vehicle. Alternatively, if both drivers are qualified, they can switch places when the lead driver gets tired. “At the end of the day, we’re not replacing drivers—we’re extending their reach,” Factor says. “We’re building a future where technology supports the workforce instead of sidelining it.” Pros and cons of truck platooning If platooning becomes widespread, trucking companies could save a lot of money. A 2021 U.S. Department of Energy study on truck platooning found that nationwide spontaneous platooning—where trucks from different locations encounter each other on the road and wirelessly pair up while they’re headed in the same direction—could save nearly US $1 billion a year in fuel, says Mohamadhossein Noruzoliaee , an assistant professor of civil engineering at the University of Texas Rio Grande Valley and coauthor of the study. “It also increases road capacity by about 8 percent, potentially avoiding $4.8 billion in infrastructure expansion costs,” Noruzoliaee says. And platooning trucks’ ability to maintain short following distances allows more trucks to travel on a given stretch of roadway. In the Ohio–Indiana pilot project, the second truck can be as close as 30 meters behind the lead truck—much closer than a human driver could safely manage. That’s because the follower truck can react almost instantaneously if the lead truck brakes suddenly. On closed tracks and in wind tunnel tests, trucks have been spaced as few as 4 meters apart. But on public roads, state laws require much larger distances. RELATED: One Driver Steers Two Trucks With Peloton’s Autonomous Follow System Noruzoliaee warns that a proliferation of closely spaced platooned trucks could accelerate road wear. “This could justify restricting platooning on certain roads—like local streets or bridges—where pavement wasn’t designed for these load patterns,” he says. “State DOTs should analyze these tradeoffs when planning for platooning at scale.” And despite the system’s sophistication, Noruzoliaee cautions that autonomy in the follower truck remains a work in progress. “This technology can reduce cognitive load and fatigue for the follower,” he says, but the human driver in the follower truck should remain alert. Urban environments pose particular challenges. Passenger cars and traffic signals can break up truck platoons, forcing the truck pairs to reform. And that, in turn, takes time and reduces fuel savings. Still, the retrofit-ready nature of the Kratos system should make it appealing to fleet operators. New capabilities—such as allowing the lead and follower trucks to switch positions—could make platooning even more flexible and commercially viable. As testing continues along the I-70 corridor, the familiar roar of these advanced trucks’ engines could signal a practical, incremental path to freight automation—especially when compared with the more ambitious vision of fully autonomous trucks, like those recently launched by Pittsburgh-based Aurora Innovation . Aurora’s self-driving trucks, which began shuttling between Dallas and Houston in April, rely on AI, sensor fusion, and real-time decision-making to navigate highways without human input. But despite rapid progress, fully autonomous trucks still face significant hurdles—regulatory, technical, and public trust—that will likely delay broad adoption for years. During the Aurora truck’s maiden voyage on public roadways, CEO Chris Urmson shared his excitement about riding in the back seat. However, just weeks later—and at a partner’s insistence—Aurora decided that the onboard human “observer” will sit in the driver’s seat instead. While we wait for the driverless truck future, semiautonomous truck platooning may offer a more affordable, lower-risk, and near-term option. Because the Kratos system can be retrofitted to existing trucks, a freight operator can introduce autonomy into the fleet without having to invest in brand-new trucks. “Platooning is the next step in building a resilient, modern freight network—one that’s safer, smarter, and more efficient,” says Factor.",
    "published": "Thu, 22 May 2025 13:00:03 +0000",
    "author": "Willie D. Jones",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "Why This Combustion-Engine Expert Returned to Ford",
    "link": "https://spectrum.ieee.org/ford-powertrain-engineer",
    "summary": "As a Ford power-train engineer for 30 years, Lem Yeung helped shepherd the company’s internal-combustion engines (ICEs) to new heights of performance, durability, and efficiency. But a lifetime of hard-won expertise didn’t matter when Ford shifted to electric vehicles, making Yeung and hundreds of fellow engineers expendable . In 2021, at age 52, Yeung agreed to a buyout and embarked on reinventing himself. But it was short detour: Ford brought Yeung back this year as a consultant to help solve a vexing surge in power-train warranty claims. Like most global automakers, Ford has been slapped back to the reality that ICE-powered cars, including hybrids, aren’t quite ready for the scrapyard of history, and that it still needs skilled combustion engineers to look after cars and customers alike. IEEE Spectrum recently spoke with Yeung about the turbulent transition to EVs , the exodus of traditional engineers at automakers, and life after Ford. Related: Electric Vehicles Made These Engineers Expendable Ford saw some early success with EVs like the Mustang Mach-E introduced in 2019 and dove into electric pickup trucks with the F-150 Lightning. Then the rate of EV adoption slowed, seeming to catch Ford and every legacy automaker completely off guard. What happened? Lem Yeung: We would debate this all the time: Why are you putting all the resources into EVs, when the cars aren’t really selling or generating profits? Of course you need to monitor the market and stay ahead. But to leap in without a full long-term analysis was just hubris—which is pretty normal not just in Detroit, but in any large organization. Companies can fall into the trap of following prevailing industry trends. You’ve come full circle at Ford, back where you started as an intern, fresh out of Purdue University. Yeung: It’s interesting and emotional for me, and I’m just trying to help. I’ve returned as a contract engineer, leading a team focused on reducing power-train warranty claims. I currently have 6 techs and 11 engineers under me. But it does feel like a skeleton crew, with so many people broomed out. Can you connect the dots between the uptick in warranty claims and brain drain? Yeung : Without question. The backbone of the company is your engineering specialists and supervisors—people who have the technical knowledge to both lead and train. When the focus shifted away from engines, many skilled engineers and technicians left, leaving a gap in both numbers and expertise. It’s clear that the strain on quality-control systems has been significant. We’re trying to rebuild it now that the EV bubble has burst a bit. How do you go about that in your new role? Yeung : What I’m trying to do now at Ford is to get engineers to touch and feel stuff again. I worked with some of the best engine builders in the world—people who can feel microns and see things other people can’t see. Of course, what kid wants to come from college now and say, ‘I want to learn about engines?’ But I promise, these are transferable skills. What kinds of problems is your team getting its arms around? Yeung : Our primary focus is on minimizing ongoing costs of warranty claims in the field. This involves multiple strategies: improving technician diagnostics, implementing calibration programs to identify potential component failures before they become catastrophic, optimizing software and hardware, and offering customer incentives for proper maintenance. Engine replacements are typically the highest single cost driver in warranty expenditures. So it’s crucial to ensure these are authorized correctly, especially in today’s environment, where aftermarket parts are prevalent, and maintenance practices can be lacking. In the past, it was relatively straightforward to deny an engine exchange if there was clear evidence of poor maintenance, such as sludge in the oil pan. Today we take a more detailed approach, analyzing engine derates [a loss of power output], oil-change records, and other factors within the vehicle’s calibration system, to make more accurate and fair decisions. There are so many reasons for quality issues. One tiny problem can bleed out—a missed test up front, a switch that gets flipped in a factory—and that changes one of a million variables. When you’re making 200,000 engines, you make one mistake, and you’re affecting a lot of customers. You need experienced people with a remarkable level of detail and discipline. If you don’t have that, you’re always just reacting to the hottest fire. What are some lessons you’ve learned that might benefit the next generation? Yeung: Engineers are often caught between striving for ideal solutions and acknowledging the practical constraints of time and resources. True engineering judgment comes from having the hands-on experience to navigate gray areas. Engineering principles in thermodynamics, CAD, or computational fluid dynamics are critical, but they only go so far. Problem-solving tools such as Six Sigma, 8D, and design of experiments (DOE) play a crucial role, but these tools must be applied with flexibility. Engineers must balance thorough investigation with practical constraints, breaking down problems into smaller, manageable tests to identify root causes. It’s about taking calculated risks, making pragmatic decisions, and understanding that perfection isn’t always achievable. Your father and mother both worked at Ford? Yeung: My father, Fai Yeung, escaped Communist China alone at age 10. He started as a physicist, was a self-taught electrical engineer, and became one of the first minority entry-level executives at Ford. He helped pioneer onboard diagnostic systems during the oil embargo of the 1970s. My mother, Winnie Yeung, programmed power-train controls back when coding was done with punch cards. She operated analytic software that ensured catalytic converters would oxidize emissions throughout a vehicle’s life. Being raised by first-generation parents, I was taught the value of hard work, education, and perseverance. As a native Detroiter and former factory worker, I know how deep this business runs in families. Yeung : The auto industry in Southeast Michigan has always been a central thread in everyone’s lives, and brand loyalty ran deep across generations. So many of my friends and classmates had family members in the auto industry. The workplace often felt like an extension of family, and that emotional connection made me more invested in the work I was doing. When I started at Ford, I joined softball teams, golf leagues, bowling leagues, even a car club with some of the old-timers. Everywhere you turned, there was that feeling of shared identity. It always felt like home. After a lifetime spent around Ford engines, can you choose some favorites? Yeung: From an emotional standpoint, I’d have to go with the 302-cubic-inch, small-block V8. I grew up around it, and it was a huge part of my early automotive experiences. I personally owned a 1990 Mustang GT powered by it. From a technical and engineering perspective, I’d highlight the 6.7-liter “Scorpion” Power Stroke diesel engine. The team that developed it was among the best in the company, and they did a phenomenal job engineering a reliable, high-performing replacement for the problematic Navistar 6.4-liter Power Stroke. It was a leap forward in terms of durability and design sophistication. Being asked to leave a company after three decades of dedication would drive some people to call it a career and take up golf. But not you. Yeung: After taking the buyout, I pursued several ventures: consulting, defense work, a greenfield project for Gleaner’s Food Bank , and even assisting with a friend’s ice cream shop. I worked on a performance engine at Roush Industries [under Ford performance guru Jack Roush , the winningest team owner in NASCAR history]. Now, aside from consulting for Ford, I’m returning to school to pursue my fifth degree, a master of social work from Wayne State University. What advice would you give old-school engineers, or anyone who finds their skills no longer in demand? Yeung : It definitely hurts. I have loved and lost a few times at Ford. Everyone pigeonholed me as an engine engineer, and there was no need for me. I was in this nowhere place. But you have to look inside and soul search and reinvent. I realized I wanted to do something with a little more purpose and calling. I still have a deep desire to make a meaningful impact on the world. So I’ve enrolled back in school, and I’m going to keep going. This article appears in the June 2025 print issue as “ Epilogue: Return to Ford .”",
    "published": "Mon, 05 May 2025 14:00:03 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "ChargePoint’s EV Chargers Can Transform the Game",
    "link": "https://spectrum.ieee.org/chargepoint-ev-charger",
    "summary": "Public DC fast charging hogs the EV spotlight. Automakers and charging providers vie for bragging rights and ever-shorter recharging stops, with the latest models topping out at 1 megawatt . But for a vast majority of EV owners, home is where the charging happens , often at a thumb-twiddling pace. And ChargePoint has unveiled a lineup of Level 2 AC chargers that can roughly double the speed of those sessions—and potentially reshape the charging landscape, home or away. “ChargePoint’s next generation of EV chargers will be revolutionary, not evolutionary,” said Hossein Kazemi, ChargePoint’s chief technical officer for hardware. The California-based company says its new Level 2 architecture can deliver up to 19.2 kilowatts in North America, and up to 22 kW on a three-phase European connection. Say goodnight to overnight charges: An EV with an 80-kW battery will refill from 10 to 80 percent in about three hours on a standard 240-volt home plug, or four hours from dead empty to full. Most plug-in hybrid EVs, like the Toyota RAV4 Prime and its 18.1-kilowatt-hour pack, would be able to charge their small batteries in an hour or less. The Future of Public EV Charging It wasn’t long ago that I was charging in public at 3 or 4 kW, including at my Whole Foods in Brooklyn, where I would hope to add a piddling 8 or 10 miles of range while overpaying for prosciutto di parma. But charging at these speeds would turn so-called opportunity charging into a genuine opportunity. Call it roughly a mile for every minute on the plug: 60 miles while you stuff a shopping cart; 120 or more miles while you watch a movie or hang out in a park. Or, a still-useful 30 miles in the time it takes to scarf a burger and fries, but at a fraction of the price of today’s whiz-bang DC stations. DC charging is decisively faster, with models from Hyundai, Lucid, and others peaking above 250 kW or more on mighty 350 kW chargers. But as Kazemi and other experts are arguing, the gas-station model of charging is looking less and less like the actual future. For one, Tesla and other fast chargers are already seeing long, frustrating lines in some cities, even as EVs make up a tiny fraction of cars on the road. A single DC station with four stalls can cost between $470,000 and $725,000 to site, permit, and install—often including transformer upgrades—and can take up to two years from start to finish. Even for larger apartment complexes or residential developments, those costs and time frames tend to be deal killers. And those DC plugs could only serve a handful of residents at any one time. DC chargers also appear to be a non-starter for many potential station operators, including fleet managers who need the ability to affordably charge dozens or hundreds of cars, vans, or trucks. Beyond onerous installation costs, the “convenient” electricity at public DC chargers can cost as much as or more than gasoline, blunting energy savings, which are a big reason to choose an EV in the first place. “Unfortunately, people can’t move away from the gas-station mentality,” Kazemi says. “Whenever you have more than a few hours of dwell time, you need AC chargers, not DC chargers. You charge where the vehicle stays.” ChargePoint’s Advanced EV Charging Features The new architecture is packed with the latest features. ChargePoint’s flexible “ Omni Port ” links to a NACS plug or a JC 1772 connector with no adapter required. Bidirectional charging and vehicle-to-everything (V2X) connections can let compatible EVs—including some Ford, Hyundai, and Kia models—act as mobile generators during power outages or return power to the grid, though that still requires a home energy system and buy-in from participating utilities. Smart-home features make for smoother connections with solar arrays, home batteries, or energy management systems. And for a future in which multi-EV households will be commonplace, the units bring another bonus: Split-wiring capability allows multiple chargers to daisy chain off a single 240-volt connection. At 19.2 kW, the Omni Port can charge two cars simultaneously at 9.6 kW, or three cars at a still-healthy 6.4 kW. (Homes require a 100-amp dedicated circuit to handle these 80-amp connections, but that’s well within reach of most modern residences.) The units’ dynamic load balancing can prioritize vehicle charging or automatically boost charging speeds when there’s a reduced load. Operators can offer multiple chargers on a single line for fleet operators, apartment owners, or businesses. While users on a single line would share the available kilowatts, Kazemi notes that not every stall tends to be in use simultaneously. “This is a low-barrier entry, an opportunity to provide charging with good speed, and not too much infrastructure cost,” Kazemi says. ChargePoint is already rolling out its chargers for residential, public, or fleet chargers in Europe and plans to offer them in the U.S. by the end of the year, starting below $1,000 for a residential unit. For now, EVs themselves can be a weak link in the chain. Many EVs max out at 7.7 kW through their onboard chargers, though speeds are rapidly increasing. New BMW, BYD, Hyundai, Kia, and Tesla models max out around 11 kW on Level 2 units. General Motors’ GMC Hummers, the Chevy Silverado EV pickup, and the forthcoming Cadillac Escalade iQ can reach 19.2 kW, the better to fill enormous battery packs of up to 205 kWh. The new Lucid Gravity SUV brings the same 19.2-kW rate, combined with its inherent efficiency, enough to add an eye-popping 80 miles of range per hour on AC power. The 2026 Toyota bZ4x has doubled its capability to 22 kW. Electric fleet and delivery trucks, including popular “last mile” models, are getting up to speed as well, though Amazon’s electric vans, built by Rivian, are currently limited to 11 kW. But Peterbilt’s electric box trucks offer 80-amp, 19.2 kW capability, as do Isuzu’s NRR EV box trucks. There’s one more clever feature included with the Omni Port, with a backplate cover that can hide the unsightly wiring connection behind the head units and their interfaces. “If someone is building 50 houses, they can wire them up, the cover goes over, and a buyer or renter can decide if they want a charger,” Kazemi says. “When people move, they can take their chargers and leave the wiring behind,” or leave it—a fine selling point for the prospective buyer who already drives an EV, or who wants to make the switch.",
    "published": "Mon, 28 Apr 2025 14:00:03 +0000",
    "author": "Lawrence Ulrich",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  },
  {
    "title": "High Schoolers’ AI-Enabled Device Deters Drunk Driving",
    "link": "https://spectrum.ieee.org/students-device-deters-drunk-driving",
    "summary": "Accidents happen, but not all of them are inevitable. Drunk driving is one of the deadliest and most preventable causes of roadway fatalities. In 2022 alone, more than 13,000 people died in alcohol-related vehicular crashes in the United States, accounting for nearly a third of all traffic deaths, according to the National Highway Traffic Safety Administration . Now a group of high school students in North Carolina is taking action with SoberRide , an AI-enabled device they designed to prevent intoxicated people from driving. Breathalyzer-based ignition interlocks are already in use; they require the driver to blow into a device, proving they are sober enough to drive. However, these interlocks are not foolproof because someone other than the driver could breathe into them, trying to outsmart the device. SoberRide uses a combination of cameras, sensors, and machine-learning algorithms to detect signs of alcohol impairment in the driver—such as pupil dilation, bloodshot eyes, and the presence of ethanol used in alcoholic beverages—before allowing a vehicle to be put into drive. “We’ve been training our neural network to classify intoxication, refining the system’s ability to reliably sense whether someone is drunk or sober,” says Swayam Shah , chief executive officer and cofounder of SoberRide. He’s an 11th-grader at Enloe Magnet High School , in Raleigh. The SoberRide team presented its invention at the MIT Undergraduate Research Technology Conference in October , sponsored by groups like the IEEE University Partnership Program and IEEE Women in Engineering . The students also showcased their technology at another IEEE-supported event: the International Conference on Artificial Intelligence, Robotics, and Communication , held in December in Xiamen, China. From tragedy to technology The inspiration for SoberRide came from a tragedy. Shah was in eighth grade when a neighbor was killed in a collision caused by a drunk driver. The loss prompted Shah to research the magnitude of the drunk-driving problem. “We learned that nearly 300,000 people die each year in crashes involving at least one drunk driver,” says Shaurya Mantrala, a senior at Enloe and the startup’s chief product officer. “We don’t just want to sell a product. We want to end drunk driving—for good.” —Swayam Shah, SoberRide CEO Motivated to develop technology to address the issue, the students took the initiative to research, design, and build SoberRide. SoberRide now consists of extremely sophisticated technology, which has been issued a U.S. patent and is based on published research presented by Shah and Mantrala at venues such as MIT. Shah leveraged his background in coding—honed since the fourth grade—along with knowledge gained from a Harvard introduction to computer science course, which he took in seventh grade. “I had a background in Python, Java, and C++,” he says, and his intellectual curiosity led to a growing interest in hardware. He spent countless hours learning about Arduino , Raspberry Pi , soldering, and other elements of designing and building electronics. AI-powered detection prevents workarounds SoberRide’s AI-driven approach sets it apart from existing ignition interlocks. Because such devices analyze the breath of the person who blows into them, the system can be bypassed by having a sober person breathe into it. SoberRide’s creators say it will leverage cameras that are already inside a car—technology that automakers are increasingly incorporating for driver-assist monitoring—to analyze the driver’s behavior. Should it detect signs of inebriation, it doesn’t allow the car to be put into drive. The system combines ethanol sensors placed on the dashboard or driver-side B-pillar, which is the vertical roof support between the front and rear doors. Those sensors, combined with facial analysis, assess intoxication indicators such as eye redness and facial swelling. To mitigate racial bias in facial recognition , the AI model was trained using a diverse dataset curated by IIT researchers. “The SoberRide device weighs facial analysis, which accounts for 25 percent of its decision regarding whether the person behind the wheel is impaired,” says Mantrala, who co-authored two research papers along with Shah, which were published in the IEEE Xplore Digital Library . From innovation to legislation In addition to developing the technology, the SoberRide team has lobbied state and federal lawmakers to push for policies mandating in-vehicle DUI detection systems. “I just got back [in March] from Washington, D.C., where I was advocating in Congress for legislation mandating passive anti-drunk systems in all vehicles,” Shah says. He did that as a side quest when he traveled to the nation’s capital to be honored as a 2025 National STEM Festival champion. The award, sponsored by EXPLR , was presented to Shah for being one of the top 106 STEM students in the country. The team also formed a partnership with Mothers Against Drunk Driving to advocate for the HALT law, passed by Congress in 2021 as part of the Infrastructure Investment and Jobs Act . “Under the Biden administration, there was federal action aimed at requiring passive anti-drunk-driving systems in all new vehicles by 2026,” Shah says. “But with the change in administration, the chances of this happening at the federal level have diminished. That’s why we’ve taken our advocacy to state legislators and governors.” Shah and his team have brought this technology to North Carolina Governor Josh Stein , the state’s former Governor Roy Cooper , and Congressional Representative Deborah Ross to continue legislative advocacy. A new business model Although automakers have been slow to adopt the technology, the SoberRide team is targeting fleet vehicle operators such as trucking companies and delivery services, as well as parents of teenage drivers, as early adopters. In the course of their extensive market research, the SoberRide team found that more than 90 percent of teenage drivers’ parents they contacted said they would purchase this technology to serve as a berm against their kids getting behind the wheel while intoxicated. Despite the uphill battle in securing automaker buy-in, the SoberRide team has received national recognition. Most notably, the SoberRide startup became the first high school team ever to be invited to showcase its technology at the CES event (the erstwhile Consumer Electronics Show) in Las Vegas. “ Honda , Nissan , and Toyota were among the many vehicle manufacturer representatives who visited the SoberRide booth at CES,” Mantrala says. “They showed great interest in the technology, with some of them even offering to start beta-testing our product in their vehicles.” The team was also recently named global finalists for both the Conrad and Diamond High School Entrepreneurship Challenges, where they will compete on the international stage for further recognition, mentoring, and funding opportunities. The students were runner-ups at last year’s TiE Young Entrepreneurs (TYE) Globals pitch competition, sponsored by the Indus Entrepreneurs , a Silicon Valley nonprofit. The annual competition evaluates high school startups’ ideas, judging them on customer validation, business models, and execution. They were also recently promised US $100,000 in funding from the TiE Angels program, which they plan to utilize to perfect their technology and bring their product to market. A mission beyond profit Shah and his team understand widespread adoption could take years, he says, but they remain committed to their mission. “We don’t just want to sell a product,” he says. “We want to end drunk driving—for good.”",
    "published": "Tue, 22 Apr 2025 18:00:04 +0000",
    "author": "Willie D. Jones",
    "topic": "automotive",
    "collected_at": "2025-10-08T14:03:18"
  }
]